{
    "address": "Affolternstrasse 44",
    "city": "Zurich",
    "country": "CH",
    "currency": "USD",
    "cusip": "H0010V101",
    "description": "ABB Ltd. is a technology company, which engages in the development and provision of electrification, motion and automation solutions. The company is headquartered in Zurich, Zuerich and currently employs 105,600 full-time employees. The company went IPO on 2001-05-07. The firm's segments include Electrification Products, Robotics and Motion, Industrial Automation, Power Grids, and Corporate and Other. The company operates through four divisions: Electrification Products, Robotics and Motion, Industrial Automation and Power Grids. The company is engaged in serving customers in utilities, industry and transport and infrastructure. The Electrification Products segment manufactures and sells products and services including low and medium-voltage switchgear, breakers, switches and control products. The Robotics and Motion segment manufactures and sells motors, generators, variable speed drives and robots and robotics. The Industrial Automation segment develops and sells control and plant optimization systems, and automation products and solutions. The Power Grids segment supplies power and automation products, systems, and service and software solutions.",
    "employeeTotal": "105600.0",
    "exchange": "SWISS EXCHANGE",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Capital Goods",
    "gind": "Electrical Equipment",
    "gsector": "Industrials",
    "gsubind": "Electrical Components & Equipment",
    "ipo": "2001-05-07",
    "isin": "CH0012221716",
    "logo": "",
    "marketCapitalization": 67445.92,
    "naics": "Electrical Equipment Manufacturing",
    "naicsNationalIndustry": "Power, Distribution, and Specialty Transformer Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Electrical Equipment, Appliance, and Component Manufacturing",
    "name": "Abb Ltd",
    "phone": "41433177111.0",
    "sedol": "7108899",
    "shareOutstanding": 2024,
    "state": "ZUERICH",
    "ticker": "ABBN.SW",
    "weburl": "https://global.abb/"
}