{
    "address": "Ayritie 12 B",
    "city": "Vantaa",
    "country": "FI",
    "currency": "EUR",
    "cusip": "X0806P104",
    "description": "Adapteo Oyj offers modular space rental and rental related services. The company is headquartered in Vantaa, Etela-Suomen and currently employs 505 full-time employees. The company went IPO on 2019-07-01. The Company’s activities are divided into two business areas: Rental Space and Permanent Space. The Rental Space business area encompasses rental of modular space solutions, as well as the provision of assembly and other services. The Permanent Space considers sales and long-term leasing of modular space solutions. Its customer portfolio includes various types of clients, primarily public sector customers, including states and municipalities, as well as private sector customers, including industrial companies and private enterprises. In addition, the Company offers its solutions for temporary purposes, especially in the social infrastructure, such as school, day care, health and social care and special accommodation, and offices, among other. The firm is active in Sweden, Finland, Norway, Denmark and Germany.",
    "employeeTotal": "505.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Construction",
    "ggroup": "Capital Goods",
    "gind": "Construction & Engineering",
    "gsector": "Industrials",
    "gsubind": "Construction & Engineering",
    "ipo": "2019-07-01",
    "isin": "FI4000383898",
    "logo": "https://finnhub.io/api/logo?symbol=ADAPT.ST",
    "marketCapitalization": 8066.279,
    "naics": "Lessors of Real Estate",
    "naicsNationalIndustry": "Lessors of Nonresidential Buildings (except Miniwarehouses)",
    "naicsSector": "Real Estate Rental and Leasing",
    "naicsSubsector": "Real Estate",
    "name": "Adapteo Oyj",
    "phone": "35810661550.0",
    "sedol": "BK8LRF8",
    "shareOutstanding": 49.074385,
    "state": "ETELA-SUOMEN",
    "ticker": "ADAPT.ST",
    "weburl": "https://adapteo.com/"
}