{
    "address": "Birger Jarlsgatan 43, Box 5112",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Addtech AB engages in the development and selling of components and equipment to the mechanical, automotive, telecommunications, and electronics industries. The company is headquartered in Stockholm, Stockholm and currently employs 3,103 full-time employees. The company went IPO on 2001-09-03. The company is organized into four main business areas. Addtech Components area works with technical components and subsystems used in mechanics, electromechanics, electronics and hydraulics. Addtech Energy markets and sells battery solutions, power distribution products and products in electrical safety, as well as equipment for cable harness manufacturing of Dafine Engineering Oy. Addtech Industrial Solutions area sells products made of polymeric materials, electric motors and transmissions and customer-specific products in electromechanics, among others. Addtech Life Science area sells medical equipment to laboratories in healthcare and research, diagnostic equipment for the healthcare sector, and process and analysis equipment for industry. The firm operates Fenno Medical Oy as a wholly owned subsidiary.",
    "employeeTotal": "3103.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Trading Companies & Distributors",
    "ggroup": "Capital Goods",
    "gind": "Trading Companies & Distributors",
    "gsector": "Industrials",
    "gsubind": "Trading Companies & Distributors",
    "ipo": "2001-09-03",
    "isin": "SE0014781795",
    "logo": "https://finnhub.io/api/logo?symbol=ADDT B.ST",
    "marketCapitalization": 41065.5,
    "naics": "Machinery, Equipment, and Supplies Merchant Wholesalers",
    "naicsNationalIndustry": "Industrial Machinery and Equipment Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Durable Goods",
    "name": "Addtech AB",
    "phone": "4684704900.0",
    "sedol": "BLN8T44",
    "shareOutstanding": 269.274712,
    "state": "STOCKHOLM",
    "ticker": "ADDT B.ST",
    "weburl": "http://www.addtech.com"
}