{
    "address": "Blekholmstorget 30",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1R155105",
    "description": "Alimak Group AB engages in the provision of vertical access solutions for the industrial and construction sectors. The company is headquartered in Stockholm, Stockholm and currently employs 2,033 full-time employees. The company went IPO on 2015-06-17. The company offers vertical access solutions to customers in the construction industry, as well as other sectors. The firm develops and manufactures construction hoists, industrial elevators, mast climbing work platforms, transport platforms and material hoists. The company operates in four business segments: Construction Equipment, which designs, develops, manufactures and distributes lifts for temporary installation; Industrial Equipment, providing lifts for permanent installations; Rental, offering renting and service of the Company’s equipment; and After Sales, comprising service, spare parts, upgrades and trainings. Its product lines are Alimak, Champion, Heis-Tes and Hek. The firm is active in Norway, France, Germany, the United Kingdom, Korea, Singapore, Malaysia, Italy, Spain, China, the United States, Brazil and India, among others.",
    "employeeTotal": "2033.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "2015-06-17",
    "isin": "SE0007158910",
    "logo": "",
    "marketCapitalization": 7397.964,
    "naics": "Other General Purpose Machinery Manufacturing",
    "naicsNationalIndustry": "Elevator and Moving Stairway Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Alimak Group AB (publ)",
    "phone": "4684021440.0",
    "sedol": "BZ0Y0T5",
    "shareOutstanding": 53.860889,
    "state": "STOCKHOLM",
    "ticker": "ALIG.ST",
    "weburl": "https://www.alimakgroup.com/"
}