{
    "address": "Regeringsgatan 59",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2419N105",
    "description": "ALM Equity AB operates as a real estate development company. The company is headquartered in Stockholm, Stockholm and currently employs 95 full-time employees. The company went IPO on 2012-06-08. The company acquires, develops and sells primarily residential projects. The company has three business areas: Residential projects, which comprises detail-zoned properties where residential construction is permitted; Plan projects, comprising properties not yet detail-zoned, or detail-zoned properties where the detail-zoning can be changed, and Project properties, which comprises built-up properties with existing operations. The Company’s geographic markets are Stockholm, Uppsala, Malardalen and holiday locations in Sweden. Its portfolio contains over 30 projects in five geographic areas: The Greater Stockholm Metropolitan area, Uppsala, Malardalen, Central Sweden West and the East Coast South. Its customers are home buyers and real estate companies, among others. In May 2014, together with other investors (50%), the Company acquired 50% of two properties in Solna from Vasakronan AB.",
    "employeeTotal": "95.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Real Estate",
    "ggroup": "Real Estate",
    "gind": "Real Estate Management & Development",
    "gsector": "Real Estate",
    "gsubind": "Real Estate Development ",
    "ipo": "2012-06-08",
    "isin": "SE0000540163",
    "logo": "https://finnhub.io/api/logo?symbol=ALM.ST",
    "marketCapitalization": 8370.232,
    "naics": "Lessors of Real Estate",
    "naicsNationalIndustry": "Lessors of Residential Buildings and Dwellings",
    "naicsSector": "Real Estate Rental and Leasing",
    "naicsSubsector": "Real Estate",
    "name": "ALM Equity AB",
    "phone": "46856230300.0",
    "sedol": "B1Y5WV2",
    "shareOutstanding": 20.769176,
    "state": "STOCKHOLM",
    "ticker": "ALM.ST",
    "weburl": "http://www.almequity.se"
}