{
    "address": "Halsovagen 7",
    "city": "Huddinge",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1R97P102",
    "description": "AlzeCure Pharma AB is a pharmaceutical research company. The company is headquartered in Huddinge, Stockholm and currently employs 10 full-time employees. The company went IPO on 2018-11-28. The firm develops five drug candidates within its two main research programs, NeuroRestore and Alzstatin. The drug candidates in NeuroRestore stimulate a central signaling pathway in the brain that is essential for the functioning of nerve cells and has a strong genetic link to cognitive disorders, such as Alzheimer's disease. The main drug candidate, ACD855, is an already approved veterinary medicine available for the treatment of central nervous system (CNS) indications in animals and has undergone preclinical trials for human indications of impaired cognitive disorders. Alzstatin focuses on reducing the production of toxic amyloid beta (Aβ) protein in the brain. Aβ plays a central role in the pathology of Alzheimer’s disease and starts to accumulate in the brain many years before the first symptoms are recognized.",
    "employeeTotal": "10.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2018-11-28",
    "isin": "SE0010133785",
    "logo": "",
    "marketCapitalization": 373.8806,
    "naics": "Scientific Research and Development Services",
    "naicsNationalIndustry": "Research and Development in Biotechnology",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "AlzeCure Pharma AB",
    "phone": "",
    "sedol": "BYX3166",
    "shareOutstanding": 37.765715,
    "state": "STOCKHOLM",
    "ticker": "ALZCUR.ST",
    "weburl": "https://www.alzecurepharma.se/"
}