{
    "address": "Hudiksvallsgatan 4B",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3593A109",
    "description": "Addnode Group AB engages in the acquisition, operation, and development of companies that supply software and digital services. The company is headquartered in Stockholm, Stockholm and currently employs 1,820 full-time employees.  Its operations are divided into four business areas. The Design Management area sells model and design-related IT solutions to the construction, real estate and industry sectors. The Product Lifecycle Management area offers IT solutions for product development and product information concerning the entire lifecycle of a product. The Process Management area offers systems for case management, municipal government, e-archives and geographic IT systems (GIS). The Content Management business area provides IT consultancy services within the areas of Web publishing, collaboration and intranet solutions, systems for e-commerce and cloud services. The firm operates Abou AB, 5D Systemkonsult AB (5D System), Service Works Group Ltd, Intrinsys Ltd and Transcat GmbH as wholly owned subsidiaries. In addition, the Company provides software solutions through its subsidiary, 5D Systemkonsult AB.",
    "employeeTotal": "1820.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "1999-06-10",
    "isin": "SE0000472268",
    "logo": "",
    "marketCapitalization": 11197.2,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Computer Systems Design Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Addnode Group AB (publ)",
    "phone": "4686307070.0",
    "sedol": "7564327",
    "shareOutstanding": 33.632058,
    "state": "STOCKHOLM",
    "ticker": "ANOD B.ST",
    "weburl": "http://addnodegroup.com"
}