{
    "address": "Flaggan 1165",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W04975335",
    "description": "Anoto Group AB engages in the development and provision of digital writing and drawing solutions. The company is headquartered in Stockholm, Stockholm and currently employs 29 full-time employees. The company went IPO on 2013-03-11. Its technology enables transmission of handwritten text and illustrations into digital format from surfaces such, as paper, whiteboards, glass and Liquid Crystal Display (LCD) screens. The Company’s solutions include: Anoto Pen Solutions, which are based on the Company’s pens combined with dot pattern, tools and form applications, and can be used in the Healthcare and Field Services sectors, and Anoto Interactive Solutions, which are based on customized pen products and solutions for customers in the interactive learning and education area. The Company’s product portfolio includes the C-Pen equipped with Optical Character Recognition (OCR), interactive whiteboards and paper applications. Its subsidiaries are DevelopIQ Ltd, XMS Penvision AB, Pen Generation Inc. and Livescribe, Inc.",
    "employeeTotal": "29.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "2013-03-11",
    "isin": "SE0010415281",
    "logo": "https://finnhub.io/api/logo?symbol=ANOT.ST",
    "marketCapitalization": 188.0539,
    "naics": "Computer and Peripheral Equipment Manufacturing",
    "naicsNationalIndustry": "Other Computer Peripheral Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Anoto Group AB",
    "phone": "",
    "sedol": "BYXH7R1",
    "shareOutstanding": 215.65815,
    "state": "STOCKHOLM",
    "ticker": "ANOT.ST",
    "weburl": "http://www.anoto.com"
}