{
    "address": "Annavagen 1",
    "city": "Vaxjo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W14411107",
    "description": "Arcoma AB engages in the provision of digital radiographic systems for use in hospitals, clinics, imaging centers, and private practices of all sizes. The company is headquartered in Vaxjo, Kronoberg and currently employs 29 full-time employees. The company went IPO on 2014-11-14. The company develops, produces and markets digital radiographic systems. Its products offer digital imaging technology combined with advanced mobile positioning system. The firm's product portfolio comprises: complete radiographic systems available as ceiling suspensions and floor mounted systems, as well as detectors; radiographic system components, such as overhead tube crane, cube, tilting wall stand and radiographic tables; and mobile imaging tables in two series, namely Precision and Elite. Its products are designed for hospitals, clinics, imaging centers and private practices, and available through three market channels: its own brand IMIX, private label distributors and original equipment manufacturers (OEM).",
    "employeeTotal": "29.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2014-11-14",
    "isin": "SE0006219176",
    "logo": "https://finnhub.io/api/logo?symbol=ARCOMA.ST",
    "marketCapitalization": 247.9134,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Arcoma AB",
    "phone": "46470706900.0",
    "sedol": "BSM8T66",
    "shareOutstanding": 12.81206,
    "state": "KRONOBERG",
    "ticker": "ARCOMA.ST",
    "weburl": "http://arcoma.se/"
}