{
    "address": "Kristian IV:s vag 3",
    "city": "Halmstad",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1452G100",
    "description": "Arise AB engages in the construction and operation of turbines; development of onshore wind farms; and sale of renewable energy. The company is headquartered in Halmstad, Hallands and currently employs 30 full-time employees. The company went IPO on 2010-03-24. The firm is engaged in the marketing of electricity generated using its own wind turbines. Its operations are divided into two operating segments: Wind Power Operations and Other Wind Power Development. As of December 31, 2011, the Company’s project portfolio consisted of three operational Generation One projects in Oxhult, Rabelov and Brunsmo, three Generation Two projects in Froslida, Idhult, Kaphult, as well as four Generation Three projects in Sodra Karra, Blekhem, Gettnabo and Skappentorp. As of December 31, 2011, it had 22 Generation One turbines, 24 Generation Two turbines and 19 Generation Three turbines. As of December 31, 2011, the Company had 17 wholly owned subsidiaries, such as Arise Elnat AB, Arise Service AB, Arise Kran AB, Arise Wind Farm 1 AB and Arise Wind Farm 2 AB, among others.",
    "employeeTotal": "30.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Utilities",
    "ggroup": "Utilities",
    "gind": "Independent Power and Renewable Electricity Producers",
    "gsector": "Utilities",
    "gsubind": "Renewable Electricity ",
    "ipo": "2010-03-24",
    "isin": "SE0002095604",
    "logo": "",
    "marketCapitalization": 1699.645,
    "naics": "Electric Power Generation, Transmission and Distribution",
    "naicsNationalIndustry": "Other Electric Power Generation",
    "naicsSector": "Utilities",
    "naicsSubsector": "Utilities",
    "name": "Arise AB",
    "phone": "46104507100.0",
    "sedol": "B55NH41",
    "shareOutstanding": 37.040036,
    "state": "HALLANDS",
    "ticker": "ARISE.ST",
    "weburl": "http://www.arise.se/"
}