{
    "address": "ul. Fabryczna 1",
    "city": "Kostrzyn nad Odra",
    "country": "PL",
    "currency": "PLN",
    "cusip": "X01990104",
    "description": "Arctic Paper SA is a holding company, which engages in production of book paper and fine graphic paper. The company is headquartered in Kostrzyn Nad Odra, Woj. Lubuskie and currently employs 1,500 full-time employees. The company went IPO on 2009-10-23. The firm divides its business into three segments of graphic paper: Fine paper, Newsprint, and Magazine paper. The firm's main activities are manufacturing and sale of graphic fine uncoated and coated paper, under the brands: Amber, G-Print, Munken, Pamo, Arctic, L-Print and AP Tech, among others. The company offers uncoated wood-free paper, coated wood-free paper, as well as uncoated wood-containing paper. The firm operates four paper mills, located in Kostrzyn, Poland, Munkendals and Grycksbo, Sweden, and Mochenwangen, Germany. Among the Company’s customers are printing houses, distributors, publishing houses and advertising agencies. The firm is a parent entity of the Arctic Paper Capital Group As of December 31, 2011 Arctic Paper AB, based in Sweden, held a 74.8% stake in the Company. On February 26, 2013, the Company increased its stake in Rottenros AB to 54.2%.",
    "employeeTotal": "1500.0",
    "exchange": "WARSAW STOCK EXCHANGE/EQUITIES/MAIN MARKET",
    "finnhubIndustry": "Paper & Forest",
    "ggroup": "Materials",
    "gind": "Paper & Forest Products",
    "gsector": "Materials",
    "gsubind": "Paper Products",
    "ipo": "2009-10-23",
    "isin": "PLARTPR00012",
    "logo": "",
    "marketCapitalization": 415.7267,
    "naics": "Pulp, Paper, and Paperboard Mills",
    "naicsNationalIndustry": "Paperboard Mills",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Paper Manufacturing",
    "name": "Arctic Paper SA",
    "phone": "48616262000.0",
    "sedol": "B56C565",
    "shareOutstanding": 69.287783,
    "state": "WOJ. LUBUSKIE",
    "ticker": "ATC.WA",
    "weburl": "https://www.arcticpaper.com/pl/"
}