{
    "address": "Stureplan 15",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W06972165",
    "description": "Artificial Solutions International AB provides conversational AI technology, which makes it easy to build, implement and manage a wide range of natural language applications, such as virtual assistants, conversational bots, speech-based conversational UIs for smart devices and more. The company is headquartered in Stockholm, Stockholm and currently employs 69 full-time employees. The company went IPO on 2017-11-13. The firm specializes in global enterprise-oriented conversational Artificial Intelligence (AI), a form of AI that allows people to communicate with applications, websites and devices, humanlike natural language via voice, text, touch or gesture input. The Company’s conversational AI platform, Teneo, allows business users and developers to collaborate on creating intelligent applications that run across more than 30 languages, multiple platforms and channels. Teneo analyzes and uses the conversational data, delivering insight that reveal what customers are thinking. The Company’s technology aims to implement natural language applications such as virtual assistants, chatbots, and speech-based user interfaces (UIs) for smart devices, among others. The firm provides its products and services to both private and public customers from different sectors.",
    "employeeTotal": "69.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "2017-11-13",
    "isin": "SE0012323756",
    "logo": "https://finnhub.io/api/logo?symbol=ASAI.ST",
    "marketCapitalization": 485.5628,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Computer Systems Design Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Artificial Solutions International AB",
    "phone": "4613465854646.0",
    "sedol": "BJJMM92",
    "shareOutstanding": 51.919721,
    "state": "STOCKHOLM",
    "ticker": "ASAI.ST",
    "weburl": "https://www.artificial-solutions.com/"
}