{
    "address": "Sickla Industrivag 19",
    "city": "Nacka",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1R924161",
    "description": "Atlas Copco AB engages in the provision of sustainable productivity solutions. The company is headquartered in Nacka, Stockholm and currently employs 40,482 full-time employees.  The firm offers customers compressors, air treatment systems, vacuum solutions, industrial power tools and assembly systems, and power and flow solutions. The firm divides its activities into four segments: Compressor Technique, Vacuum Technique, Industrial Technique and Power Technique. Compressor Technique provides industrial compressors, vacuum solutions, gas and process compressors and expanders, air and gas treatment equipment and air management systems. Vacuum Technique provides vacuum products, exhaust management systems, valves and related products. Industrial Technique provides , industrial power tools and assembly solutions, including tightening, bolting, riveting, adhesive dispensing, assurance products, material removal, software and service. The Power Technique business area provides air, power and flow solutions through products such as mobile compressors, pumps, light towers and generators.",
    "employeeTotal": "40482.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "1920-01-01",
    "isin": "SE0011166610",
    "logo": "https://finnhub.io/api/logo?symbol=ATCO A.ST",
    "marketCapitalization": 642431.6,
    "naics": "Other General Purpose Machinery Manufacturing",
    "naicsNationalIndustry": "Air and Gas Compressor Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Atlas Copco AB",
    "phone": "4687438000.0",
    "sedol": "BD97BN2",
    "shareOutstanding": 1216.850596,
    "state": "STOCKHOLM",
    "ticker": "ATCO A.ST",
    "weburl": "https://www.atlascopco.com/"
}