{
    "address": "Farogatan 33, 24th floor",
    "city": "Kista",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1R80E114",
    "description": "AVTECH Sweden AB engages in the development of products and services for digital air traffic management. The company is headquartered in Kista, Stockholm and currently employs 9 full-time employees. The company went IPO on 2012-02-20. The firm develops and sells products and services within the area of digital air traffic management (Digital ATM), enabling planning of routes and trajectories, analysis of future capacity needs for airports, measurement of noise and emissions, wind information, and analysis of performance of a single flight and whole flight operations. Its product portfolio includes Aventus NowCast, Efficiency Analyzer, Environmental Analyzer with SONUS, Runway Capacity Analyzer, Performance Based Wake Vortex Separation System, as well as validation and simulation services. The Company’s customer base includes airline operators, airports, air navigation service providers (ANSPs) and civil aviation authorities, among others.",
    "employeeTotal": "9.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Aerospace & Defense",
    "ggroup": "Capital Goods",
    "gind": "Aerospace & Defense",
    "gsector": "Industrials",
    "gsubind": "Aerospace & Defense",
    "ipo": "2012-02-20",
    "isin": "SE0004270445",
    "logo": "https://finnhub.io/api/logo?symbol=AVT B.ST",
    "marketCapitalization": 67.51923,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Avtech Sweden AB (publ)",
    "phone": "46854410480.0",
    "sedol": "B436J05",
    "shareOutstanding": 56.479561,
    "state": "STOCKHOLM",
    "ticker": "AVT B.ST",
    "weburl": "http://avtech.aero/"
}