{
    "address": "Birger Jarlsgatan 57 B",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1043J100",
    "description": "Ayima Group AB engages in the provision of digital marketing services. The company is headquartered in Stockholm, Stockholm. The company went IPO on 2017-05-29. The firm offers search and digital marketing strategies through proprietary information technology search tools and customized in-house services. The Company’s services and products comprise: search engine optimization (SEO), social media marketing, pay-per-click (PPC) service, display advertising, tools for content analysis, predictive modeling, performance optimization, as well as Ayima Query tool, which implies a dashboard solution that allows the aggregation of any third party or proprietary data source, Ayima RT for tracking changes in keyword rankings and traffic, Ayima Pulse for market research, Appotate tool, which helps developers to communicate with their customers, and Redirect Path to discover redirection errors. The firm has clients over the world within such sectors as game industry, finance, retail, telecommunication, recreation, medical and lead generation.",
    "employeeTotal": "",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "2017-05-29",
    "isin": "SE0009888506",
    "logo": "",
    "marketCapitalization": 93.16934,
    "naics": "Management, Scientific, and Technical Consulting Services",
    "naicsNationalIndustry": "Marketing Consulting Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Ayima Group AB (publ)",
    "phone": "",
    "sedol": "BDZZRZ4",
    "shareOutstanding": 7.166872,
    "state": "STOCKHOLM",
    "ticker": "AYIMA B.ST",
    "weburl": "https://www.ayimagroup.com/"
}