{
    "address": "1 Francis Crick Avenue",
    "city": "Cambridge",
    "country": "GB",
    "currency": "USD",
    "cusip": "G0593M107",
    "description": "AstraZeneca Plc is a holding company, which engages in the research, development, and manufacture of pharmaceutical products. The company is headquartered in Cambridge, Cambridgeshire and currently employs 76,100 full-time employees. The company went IPO on 2007-09-21. The company focuses on discovery and development of products, which are then manufactured, marketed and sold. The company focuses on three main therapy areas: Oncology, Cardiovascular, Renal & Metabolic (CVRM) and Respiratory, while selectively pursuing therapies in Autoimmunity, Infection and Neuroscience. In CVRM, it is expanding its portfolio into the cardiovascular-renal area with roxadustat, as well as investing to explore the benefits of its SGLT2 and GLP-1 franchises in chronic kidney disease (CKD) and heart failure (HF). The company has approximately 38 projects in Phase I, including 26 new molecular entities (NMEs), and 12 oncology combination projects. The company has approximately 43 projects in Phase II, including 25 NMEs; six additional indications for projects that have reached phase II, and 12 oncology combination projects. The company has approximately 22 projects in late-stage development, either in Phase III/pivotal Phase II studies or under regulatory review.",
    "employeeTotal": "76100.0",
    "exchange": "LONDON STOCK EXCHANGE",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2007-09-21",
    "isin": "GB0009895292",
    "logo": "https://finnhub.io/api/logo?symbol=AZN.L",
    "marketCapitalization": 131365,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "AstraZeneca PLC",
    "phone": "11442073045000.0",
    "sedol": "0989529",
    "shareOutstanding": 1549.116129,
    "state": "CAMBRIDGESHIRE",
    "ticker": "AZN.L",
    "weburl": "https://www.astrazeneca.com/Home"
}