{
    "address": "Biblioteksgatan 25",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Bactiguard Holding AB is a medical device company, which engages in the development and supply of infection protection solutions. The company is headquartered in Stockholm, Stockholm and currently employs 180 full-time employees. The company went IPO on 2014-06-19. Its technology is based on the Bactiguard Infection Protection (BIP), a thin coating permanently bound to the surface of medical devices. The company consists of the noble metals: gold, palladium and silver, which reduces the adhesion of bacteria to the coated surfaces. Its product portfolio includes: BIP Foley Catherer, made from medical grade latex, and BIP Foley Catheter - Silicone, used for drainage and irrigation of the bladder; BIP Endotracheal Tube, for general anesthesia, intensive care, and emergency medicine for airway management and mechanical ventilation; and BIP Central Venous Catherer, made of polyurethane and used to administer drugs and intravenous solutions, monitor pressure and blood sampling. The firm is also present in Portugal, via a distribution agreement with Socime Medical Ltd, and Zambia.",
    "employeeTotal": "180.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Supplies",
    "ipo": "2014-06-19",
    "isin": "SE0005878741",
    "logo": "https://finnhub.io/api/logo?symbol=BACTI B.ST",
    "marketCapitalization": 5518.798,
    "naics": "Medical Equipment and Supplies Manufacturing",
    "naicsNationalIndustry": "Surgical Appliance and Supplies Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Miscellaneous Manufacturing",
    "name": "Bactiguard Holding AB",
    "phone": "4684405880.0",
    "sedol": "BNGN4R8",
    "shareOutstanding": 33.543885,
    "state": "STOCKHOLM",
    "ticker": "BACTI B.ST",
    "weburl": "https://www.bactiguard.se/"
}