{
    "address": "Dragarbrunnsgatan 45",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Beijer Alma AB engages in the manufacturing and developing of industrial springs and cables for nuclear power and mobile telecom. The company is headquartered in Uppsala, Uppsala and currently employs 2,685 full-time employees.  Its business concept is to acquire, own and develop small and medium-sized companies with growth potential. Its operations are conducted by the subsidiaries focused on industrial customers. Lesjofors is an international supplier of industrial springs, wire and flat strip components. Habia Cable is a manufacturer and marketer of cables and cable systems for demanding applications, such as mobile telecommunication, defense, nuclear power and infrastructure. Beijer Tech is a company focused on industrial trading within the areas of hoses, fittings, rubber sheeting, wear protection, power transmission and surface treatment, as well as foundry, steelworks and smelters. The firm has approximately 40 subsidiaries active in Denmark, Norway, Finland, the United Kingdom, Germany, Latvia, China, Russia, Slovakia, the Netherlands, the United States, France and Poland.",
    "employeeTotal": "2685.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "1987-01-01",
    "isin": "SE0011090547",
    "logo": "https://finnhub.io/api/logo?symbol=BEIA B.ST",
    "marketCapitalization": 10405.55,
    "naics": "Spring and Wire Product Manufacturing",
    "naicsNationalIndustry": "Spring (Light Gauge) Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Fabricated Metal Product Manufacturing",
    "name": "Beijer Alma AB",
    "phone": "4618157160.0",
    "sedol": "BDZVKR5",
    "shareOutstanding": 60.2622,
    "state": "UPPSALA",
    "ticker": "BEIA B.ST",
    "weburl": "https://beijeralma.se/"
}