{
    "address": "Stortorget 8",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Beijer Ref AB (publ) is a SE-based company operating in Trading Companies & Distributors industry. The company is headquartered in Malmo, Skane and currently employs 4,015 full-time employees.  Beijer Ref publ AB, formerly G & L Beijer AB, is a Sweden-based technology company active in the fields of refrigeration and air conditioning. The firm operates one business area, Beijer Ref, which carries out operations in over 20 countries in Europe, South Africa, Australia, New Zealand, India, Namibia, Botswana, Mozambique and Thailand. Its product portfolio also includes comfort cooling products and related operations, such as heat pumps, aside from the standard offering. The firm offers commercial refrigeration products, which are installed in supermarkets, restaurants and food retail outlets; comfort cooling products, which include a range of heating and cooling air conditioning products for commercial and domestic use, as well as products for the industrial refrigeration sector for large refrigerated distribution centers, such as ice rinks. The firm operates Real Cold and DX Por as subsidiaries.",
    "employeeTotal": "4015.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Trading Companies & Distributors",
    "ggroup": "Capital Goods",
    "gind": "Trading Companies & Distributors",
    "gsector": "Industrials",
    "gsubind": "Trading Companies & Distributors",
    "ipo": "1988-12-05",
    "isin": "SE0015949748",
    "logo": "https://finnhub.io/api/logo?symbol=BEIJ B.ST",
    "marketCapitalization": 58231.01,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Beijer Ref AB (publ)",
    "phone": "4640358900.0",
    "sedol": "BP2NJ48",
    "shareOutstanding": 359.77618853969994,
    "state": "SKANE",
    "ticker": "BEIJ B.ST",
    "weburl": "http://beijerref.com/"
}