{
    "address": "Regeringsgatan 28",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Betsson AB is a SE-based company operating in Hotels, Restaurants & Leisure industry. The company is headquartered in Stockholm, Stockholm and currently employs 1,831 full-time employees.  Betsson AB is a Sweden-based holding company that invests in and manages fast-growing companies within online gaming. The Group runs its operational business through subsidiaries that hold gaming licences in seventeen jurisdictions. Betsson’s operational subsidiaries offer casino, sportsbook and other games via gaming licences in twelve countries in Europe and Central Asia. The business model is to offer gaming under multiple brands, including Betsson, Betsafe, Nordicbet and Casinoeuro. Betsson is responsible for setting strategic direction for the Group, corporate structure and governance, acquisitions and divestments, policies and guidelines for the Group, risk management and internal audit, control and follow-up of the business operations and financial communication.",
    "employeeTotal": "1831.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Hotels, Restaurants & Leisure",
    "ggroup": "Consumer Services",
    "gind": "Hotels, Restaurants & Leisure",
    "gsector": "Consumer Discretionary",
    "gsubind": "Casinos & Gaming",
    "ipo": "1996-03-26",
    "isin": "SE0015672282",
    "logo": "https://finnhub.io/api/logo?symbol=BETS B.ST",
    "marketCapitalization": 8814.117,
    "naics": "Other Financial Investment Activities",
    "naicsNationalIndustry": "Miscellaneous Intermediation",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Betsson AB",
    "phone": "46850640300.0",
    "sedol": "BL9YN44",
    "shareOutstanding": 136.65233,
    "state": "STOCKHOLM",
    "ticker": "BETS B.ST",
    "weburl": "https://www.betssonab.com/"
}