{
    "address": "Nordenskioldsgatan 24",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R75M145",
    "description": "BIMobject AB is a technology company, which engages in the digitalization of building products and materials. The company is headquartered in Malmo, Skane and currently employs 156 full-time employees. The company went IPO on 2014-01-13. The company supports corporate customers with technology and services related to computer-aided design (CAD) and building information modeling (BIM). The company assists building producers and interior manufacturers in development and management of digital replicas of their products as BIM objects, either starting from two-dimensional drawings, CAD data or scanning the physical form of buildings and products. The BIM objects allow carrying detailed physical representation of products, as well as links to product information, websites, contact details and assembly instructions. The firm offers a cloud-based database for BIM objects, BIMobject software applications for formats such as Autodesk Revit and Atlantis (BIM Render), services such as modeling, programming, scripting and conversion, market analysis and online seminars. The company operates subsidiaries in Italy, the United States and Poland.",
    "employeeTotal": "156.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "2014-01-13",
    "isin": "SE0011644376",
    "logo": "https://finnhub.io/api/logo?symbol=BIM.ST",
    "marketCapitalization": 1046.291,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Other Computer Related Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Bimobject AB",
    "phone": "46446685294646.0",
    "sedol": "BF5KT79",
    "shareOutstanding": 139.319684,
    "state": "SKANE",
    "ticker": "BIM.ST",
    "weburl": "https://www.bimobject.com"
}