{
    "address": "Vimpelgatan 5",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Biotage AB engages in the provision of separation and synthesis technology solutions. The company is headquartered in Uppsala, Uppsala and currently employs 462 full-time employees. The company went IPO on 2000-06-30. Its customers include pharmaceutical and biotechnology companies, companies within the food industry and academic institutions. The firm offers systems and services within three areas: analytical chemistry, organic chemistry and industrial resins. Biotage’s offering within analytical chemistry consists of consumables with related applications to extract selected substances from various types of samples. The Company’s offering within organic chemistry includes products for pharmaceutical development based on both small molecules and peptides and its offering within industrial resins is composed of polymer-based resins and research services that lead to the development and manufacture of polymer-based materials. As of December 31, 2013, the Company operated 12 wholly owned subsidiaries worldwide.",
    "employeeTotal": "462.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Life Sciences Tools & Services",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Life Sciences Tools & Services",
    "gsector": "Health Care",
    "gsubind": "Life Sciences Tools & Services",
    "ipo": "2000-06-30",
    "isin": "SE0000454746",
    "logo": "https://finnhub.io/api/logo?symbol=BIOT.ST",
    "marketCapitalization": 13496.77,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Biotage AB",
    "phone": "4618565900.0",
    "sedol": "B1VN5T8",
    "shareOutstanding": 65.201784,
    "state": "UPPSALA",
    "ticker": "BIOT.ST",
    "weburl": "http://www.biotage.com"
}