{
    "address": "Klarabergsviadukten 90, Box 44",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W17218178",
    "description": "Boliden AB is a SE-based company operating in Metals & Mining industry. The company is headquartered in Stockholm, Stockholm and currently employs 6,101 full-time employees.  Boliden AB is a Sweden-based high-tech metal company. The firm operates mines and smelters that work over the long term to guarantee society's supply of base metals and metals through the mining of ore (minerals) and the production and delivery of the metals to industry. The firm has operations in Sweden, Finland, Norway and Ireland. Boliden is organized into two segments: Business Area Mines and Business Area Smelters. Business Area Mines comprises the operations of the Swedish mines Aitik, the Boliden Area and Garpenberg, the Tara mine in Ireland, and the Kylylahti and Kevitsa mines in Finland. Business Area Smelters includes the Kokkola and Odda zinc smelters in Finland and Norway respectively, the Ronnskr and Harjavalta copper smelters in Sweden and Finland respectively, and the Bergsoe lead smelter in Sweden.",
    "employeeTotal": "6101.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Metals & Mining",
    "ggroup": "Materials",
    "gind": "Metals & Mining",
    "gsector": "Materials",
    "gsubind": "Diversified Metals & Mining",
    "ipo": "1905-06-19",
    "isin": "SE0015811559",
    "logo": "https://finnhub.io/api/logo?symbol=BOL.ST",
    "marketCapitalization": 87797.09,
    "naics": "Nonferrous Metal (except Aluminum) Production and Processing",
    "naicsNationalIndustry": "Primary Smelting and Refining of Copper",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Primary Metal Manufacturing",
    "name": "Boliden AB",
    "phone": "4686101500.0",
    "sedol": "BMWPW33",
    "shareOutstanding": 273.511169,
    "state": "STOCKHOLM",
    "ticker": "BOL.ST",
    "weburl": "https://www.boliden.com/"
}