{
    "address": "Hyllie Boulevard 35",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2198L106",
    "description": "Boozt AB engages in the operation of online fashion retail stores for men, women, and children. The company is headquartered in Malmo, Skane and currently employs 864 full-time employees. The company went IPO on 2017-05-31. The firm offers customized e-commerce software and services that create e-commerce platforms, namely Boozt.com and its mono-brand stores, that are fully hosted and managed. Its software includes Propilot, a Web shop management administration system that enables changes to Web shop content; Podium, a front end module which ensures optimized user experience for users on mobile devices; Fastlane, a warehouse management system (WMS) that runs fulfillment processes in warehouses and integrates them with distribution partners; CS Eye, a customer overview service; and Brand Portal, a business intelligence (BI) service suite. Its services include the development of an initial strategy, building an online shop, fulfilling orders, handling returns, running ongoing campaigns and acquiring and retaining customers.",
    "employeeTotal": "864.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Retail",
    "ggroup": "Retailing",
    "gind": "Internet & Direct Marketing Retail",
    "gsector": "Consumer Discretionary",
    "gsubind": "Internet & Direct Marketing Retail",
    "ipo": "2017-05-31",
    "isin": "SE0009888738",
    "logo": "https://finnhub.io/api/logo?symbol=BOOZT.ST",
    "marketCapitalization": 12318.73,
    "naics": "Electronic Shopping and Mail-Order Houses",
    "naicsNationalIndustry": "Electronic Shopping",
    "naicsSector": "Retail Trade",
    "naicsSubsector": "Nonstore Retailers",
    "name": "Boozt AB",
    "phone": "4640128005.0",
    "sedol": "BZ30KS9",
    "shareOutstanding": 63.692578,
    "state": "SKANE",
    "ticker": "BOOZT.ST",
    "weburl": "https://www.booztfashion.com/"
}