{
    "address": "Frosundaviks Alle 1",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R39H265",
    "description": "Bjorn Borg AB is a SE-based company operating in Textiles, Apparel & Luxury Goods industry. The company is headquartered in Solna, Stockholm and currently employs 185 full-time employees. The company went IPO on 2007-05-01. Bjorn Borg AB is a Sweden-based company engaged in the fashion industry. The firm owns and develops the Bjorn Borg brand, which specializes in underwear for women, men and children. Its business activities comprise four segments: Brand, responsible for gaining royalties; Product Development, which develops, designs and produces underwear and adjacent products, as well as sportswear through Bjorn Borg Sport; Wholesale, which provides lingerie and complementary products in Sweden, Finland and England, as well as footwear in Sweden, Finland and the Baltic countries; and Retail, which operates an online shop, as well as over 15 own stores and outlets in Sweden, Finland and England. The Company’s product portfolio is divided into three areas: Underwear, Sportswear, and Licensed products. Furthermore, the Company is a parent of Bjorn Borg Brands AB, Bjorn Borg Inc, Bjorn Borg UK Limited, Bjorn Borg Services AB, Bjorn Borg Sport BV, and Bjorn Borg Limited (China) Limited CR, among others.",
    "employeeTotal": "185.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Textiles, Apparel & Luxury Goods",
    "ggroup": "Consumer Durables & Apparel",
    "gind": "Textiles, Apparel & Luxury Goods",
    "gsector": "Consumer Discretionary",
    "gsubind": "Apparel, Accessories & Luxury Goods",
    "ipo": "2007-05-01",
    "isin": "SE0015811807",
    "logo": "https://finnhub.io/api/logo?symbol=BORG.ST",
    "marketCapitalization": 746.907,
    "naics": "Cut and Sew Apparel Manufacturing",
    "naicsNationalIndustry": "Women's and Girls' Cut and Sew Lingerie, Loungewear, and Nightwear Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Apparel Manufacturing",
    "name": "Bjorn Borg AB",
    "phone": "46850633700.0",
    "sedol": "BNNTL78",
    "shareOutstanding": 25.148384,
    "state": "STOCKHOLM",
    "ticker": "BORG.ST",
    "weburl": "https://corporate.bjornborg.com/"
}