{
    "address": "Domnarsvgatan 4",
    "city": "Spanga",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1784C140",
    "description": "Boule Diagnostics AB engages in the development, manufacture, sale and marketing of instruments and consumable products for blood diagnostics. The company is headquartered in Spanga, Stockholm and currently employs 213 full-time employees. The company went IPO on 2011-06-23. The firm specializes in the development, manufacture and sale of complete blood count (CBC) systems in the field of hematology. The company provides reagents, cleaning products and blood calibrators and controls that are used in human and veterinarian laboratories, as well as analyzers and complementing accessories for hematology systems. The Company’s product portfolio comprises five brands: Clinical Diagnostic Solutions, Exigo, Medonic, Swelab and Quintus. The Company’s primary customer base comprises small and medium-sized hospitals, clinics, diagnostics firms and laboratories. Furthermore, It operates worldwide through a number of subsidiaries, such as Boule Medical AB, Boule Nordic AB, Clinical Diagnostic Solutions Inc and Boule Medical (Beijing) Co Ltd.",
    "employeeTotal": "213.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2011-06-23",
    "isin": "SE0011231158",
    "logo": "",
    "marketCapitalization": 1124.218,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Boule Diagnostics AB",
    "phone": "4687447700.0",
    "sedol": "BG0GNY4",
    "shareOutstanding": 19.416552,
    "state": "STOCKHOLM",
    "ticker": "BOUL.ST",
    "weburl": "https://www.boule.com/"
}