{
    "address": "Arstaangsvagen 11 8Tr",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1792H107",
    "description": "Bredband2 i Skandinavien AB engages in the provision of communication services. The company is headquartered in Stockholm, Stockholm and currently employs 235 full-time employees. The company went IPO on 2000-04-27. The company offers its services to both private and corporate customer base. The Company’s products and services are divided into three principal product groups: Broadband, which comprises Internet and enterprise network, among others; Telephony, which comprises basic telephony services, Session Initiation Protocol (SIP) Trunk and Internet Protocol (IP) Centrex, among others; as well as other services, such as storage and backup, and security and advanced business services, among others. The firm offers its services in the southern and eastern part of Sweden in cities, such as Trelleborg, Stockholm, Sundsvall and Kiruna, as well as in Copenhagen, Denmark and Oslo, Norway. As of December 31, 2011, the Company had four wholly owned subsidiaries, namely Bredband2 AB, Orexis Communication AB, Bredband2 Datacenter AB and SkyCom Option AB.",
    "employeeTotal": "235.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Telecommunication",
    "ggroup": "Telecommunication Services",
    "gind": "Diversified Telecommunication Services",
    "gsector": "Communication Services",
    "gsubind": "Alternative Carriers",
    "ipo": "2000-04-27",
    "isin": "SE0000648669",
    "logo": "https://finnhub.io/api/logo?symbol=BRE2.ST",
    "marketCapitalization": 2172.606,
    "naics": "Wired Telecommunications Carriers",
    "naicsNationalIndustry": "Wired Telecommunications Carriers",
    "naicsSector": "Information",
    "naicsSubsector": "Telecommunications",
    "name": "Bredband2 i Skandinavien AB",
    "phone": "46406215200.0",
    "sedol": "5934171",
    "shareOutstanding": 957.095167,
    "state": "STOCKHOLM",
    "ticker": "BRE2.ST",
    "weburl": "https://www.bredband2.com/"
}