{
    "address": "Grevgatan 34",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1830N108",
    "description": "BTS Group AB engages in the provision of consultancy solutions and training services. The company is headquartered in Stockholm, Stockholm and currently employs 868 full-time employees. The company went IPO on 2001-06-06. BTS uses customized simulation models to support executive management in making change and improving profitability. The Company’s solutions and services train the corporate organization to analyze and make decisions centered on the factors that promote growth and profitability. The company has three practice areas: Strategic Alignment & Business Acumen, Leadership, and Sales Force Transformation. BTS customers include such companies as Accenture, Deloitte, Humana, Schlumberger, Unilever, AT&T, Coca-Cola, Sony, Microsoft, Vodafone, BBVA, Ericsson, Telefonica, National Australia Bank, Telstra, Xerox, BG, GAP, Texas Instruments, HP, Toyota, and others. The firm has subsidiaries in Sweden, Finland, the United States, Australia, South Africa, Mexico, Italy, Spain, Belgium, Switzerland, Singapore and Thailand, among others. The company operates through Wizerize A/S, Cesim Italia Srl and Design Innovation Srl, among others.",
    "employeeTotal": "868.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Professional Services",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Professional Services",
    "gsector": "Industrials",
    "gsubind": "Human Resource & Employment Services",
    "ipo": "2001-06-06",
    "isin": "SE0000805426",
    "logo": "https://finnhub.io/api/logo?symbol=BTS B.ST",
    "marketCapitalization": 5733.225,
    "naics": "Management, Scientific, and Technical Consulting Services",
    "naicsNationalIndustry": "Administrative Management and General Management Consulting Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "BTS Group AB",
    "phone": "",
    "sedol": "B132QN4",
    "shareOutstanding": 19.318292,
    "state": "STOCKHOLM",
    "ticker": "BTS B.ST",
    "weburl": "https://www.bts.com/"
}