{
    "address": "Nybrogatan 6",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W72479103",
    "description": "Bure Equity ABis an investment company with ownership interests in Nordic companies. The company is headquartered in Stockholm, Stockholm and currently employs 10 full-time employees.  The firm specializes in long-term owning, developing, as well as disposing listed and unlisted operating entities. Its holding portfolio comprises eight firms: Cavotec, an engineering group that delivers power transmission, distribution and control technologies to a range of areas; MedCap, which owns and develops companies involved in the Life Science sector; Mycronic, which designs and manufactures laser-based pattern generators that are used in the flexible electronics production; PartnerTech, providing product development, as well as production, logistics and aftermarket services; Vitrolife, a developer and producer of solutions for fertility treatment; XVIVO Perfusion AB, which focuses on organ, tissue and cell preservation in relation with transplantation; Investment AB Bure, which owns and manages leasing of locomotives; and Mercuri International, which offers sales and management training consultancy.",
    "employeeTotal": "10.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Financial Services",
    "ggroup": "Diversified Financials",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Asset Management & Custody Banks",
    "ipo": "1993-10-08",
    "isin": "SE0000195810",
    "logo": "",
    "marketCapitalization": 28516.91,
    "naics": "Other Financial Investment Activities",
    "naicsNationalIndustry": "Miscellaneous Intermediation",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Bure Equity AB",
    "phone": "4686140020.0",
    "sedol": "4152651",
    "shareOutstanding": 74.146921,
    "state": "STOCKHOLM",
    "ticker": "BURE.ST",
    "weburl": "http://www.bure.se/"
}