{
    "address": "Vastmannagatan 4 3Tr",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1R91S102",
    "description": "Bambuser AB engages in the provision of live video streaming service. The company is headquartered in Stockholm, Stockholm and currently employs 15 full-time employees. The company went IPO on 2017-05-05. The company offers a platform IRIS for interactive mobile live video broadcasting and enables the users to stream live video directly from a mobile phone or webcam to the Internet. The IRIS platform comprises two products: IRIS Flow and IRIS Dev. The IRIS Flow is a product suite, which comprises various tools for live video broadcasting, such as access to a browser, a so-called Content Management System (CMS) that includes communication capabilities with the sender (voice/text), filtering capabilities, application program interfaces for integration, among others. The IRIS Dev is a software development kit, which enables integration of live streaming into various iOS and Android applications. The platform allows sharing to the global social networks and is available as a free service for consumers and no-profits, as well as a service for commercial use.",
    "employeeTotal": "15.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Media",
    "ggroup": "Media & Entertainment",
    "gind": "Interactive Media & Services",
    "gsector": "Communication Services",
    "gsubind": "Interactive Media & Services",
    "ipo": "2017-05-05",
    "isin": "SE0009663834",
    "logo": "https://finnhub.io/api/logo?symbol=BUSER.ST",
    "marketCapitalization": 3110.059,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Custom Computer Programming Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Bambuser AB",
    "phone": "4684464616464640.0",
    "sedol": "BD8Z3Y2",
    "shareOutstanding": 197.338787,
    "state": "STOCKHOLM",
    "ticker": "BUSER.ST",
    "weburl": "https://bambuser.com/"
}