{
    "address": "Kungsgatan 37, Box 22564",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R512105",
    "description": "C.A.G Group AB provides information technology services. The company is headquartered in Stockholm, Stockholm and currently employs 356 full-time employees. The company went IPO on 2018-12-12. Through its subsidiaries, the Company provides IT management, development, operation and training services. The firm's IT project management service offering includes process and requirements analysis, order and purchase support, as well as change management. The firm's system development offering includes integration, continuous delivery, Java programming, agile testing, test management and measurement systems, as well as support for Microsoft products, including .NET platform, SharePoint, Azure and Office 365. The firm's operations services include operation critical applications, financial systems management, hosting and cloud services. In addition, the Company offers a range of certifications, courses, seminars, workshops and lectures in the field of IT. The firm serves customers in such sectors as banking and finance, healthcare, defense, industry, and trade and services.",
    "employeeTotal": "356.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "2018-12-12",
    "isin": "SE0011923341",
    "logo": "https://finnhub.io/api/logo?symbol=CAG.ST",
    "marketCapitalization": 569.7117,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Custom Computer Programming Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "CAG Group AB",
    "phone": "4687852200.0",
    "sedol": "BGWL4F5",
    "shareOutstanding": 6.981128,
    "state": "STOCKHOLM",
    "ticker": "CAG.ST",
    "weburl": "https://www.cag.se/"
}