{
    "address": "Birger Jarlsgatan 6, P.O. Box 5894",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R51J116",
    "description": "Catella AB engages in the provision of asset management, investment, and financial advisory services. The company is headquartered in Stockholm, Stockholm and currently employs 543 full-time employees. The company went IPO on 2011-06-17. Its business is divided into two segments: Corporate Finance and Asset Management. The Corporate Finance operations offer financial advisory services in the areas of sales and acquisitions, debt and equity, and valuation and research. The Asset Management offers institutions, companies and individuals financial products and advisory services in the areas of fund management and wealth management. The firm operates through more than 30 offices in Sweden, Denmark, Estonia, Finland, France, Luxembourg, Germany, Italy, Latvia, Lithuania, Norway, Spain and the United Kingdom. The company has a subsidiary active in the real estate sector, Link Prop Investment AB, and holds majority stakes in EKF Enskild Kapitalforvaltning AB and IPM Informed Portfolio Management (IPM).",
    "employeeTotal": "543.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Financial Services",
    "ggroup": "Diversified Financials",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Asset Management & Custody Banks",
    "ipo": "2011-06-17",
    "isin": "SE0000188518",
    "logo": "https://finnhub.io/api/logo?symbol=CAT B.ST",
    "marketCapitalization": 2570.184,
    "naics": "Other Financial Investment Activities",
    "naicsNationalIndustry": "Investment Advice",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Catella AB",
    "phone": "4684633310.0",
    "sedol": "4770741",
    "shareOutstanding": 88.348572,
    "state": "STOCKHOLM",
    "ticker": "CAT B.ST",
    "weburl": "http://www.catella.com/"
}