{
    "address": "Designvagen 1",
    "city": "Moelnlycke",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R81R104",
    "description": "Christian Berner Tech Trade AB engages in trading technical components, materials, and advance equipment. The company is headquartered in Moelnlycke, Vastra Gotalands and currently employs 201 full-time employees. The company went IPO on 2014-10-20. The company operates as a supplier of technical equipment, components and materials. The firm is active in two business areas: Material Technology, comprising sales of various kinds of materials and vibration and noise dampers, further divided in product areas such as technical plastics, vibration technology and alloying; and Process and Environment, providing handling and processing equipment as well as complete systems in product areas such as powders, liquids, packaging, paper, gas and energy, high pressure, filters, and pumps and instruments. The firm also provides a range of services: technical advice, customized solutions, support, training and after-sales services, as well as technologically advanced products. The company targets such sectors as food, medicine, pulp and paper, chemistry and technology, workshop, water supply, building and construction. The firm operates in Sweden, Norway, Denmark and Finland.",
    "employeeTotal": "201.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Technology Distributors",
    "ipo": "2014-10-20",
    "isin": "SE0006143129",
    "logo": "https://finnhub.io/api/logo?symbol=CBTT B.ST",
    "marketCapitalization": 609.327,
    "naics": "Machinery, Equipment, and Supplies Merchant Wholesalers",
    "naicsNationalIndustry": "Industrial Machinery and Equipment Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Durable Goods",
    "name": "Christian Berner Tech Trade AB",
    "phone": "467467468273.0",
    "sedol": "BRKD9V1",
    "shareOutstanding": 18.759398,
    "state": "VASTRA GOTALANDS",
    "ticker": "CBTT B.ST",
    "weburl": "http://www.christianberner.com/"
}