{
    "address": "Via G.B. Pioda 14",
    "city": "Lugano",
    "country": "CH",
    "currency": "EUR",
    "cusip": "H13678109",
    "description": "Cavotec SA engages in the design and manufacture of automated connection and electrification systems for ports, airports, and industrial applications . The company is headquartered in Lugano, Ticino and currently employs 753 full-time employees. The company went IPO on 2011-10-19. Through the Ports and Maritime segment, it offers automated mooring equipment, shore-to-ship electrical systems and electrical transmission and control systems, such as collector columns, swivel joint units and cable reels. The Airports segment includes propulsion controlled aircraft systems, fuelling arms, units for power and dry preconditioned air supply of aircrafts, cable coilers and power conversion equipment. The Mining and Tunneling segment comprises various mining equipment, such as cables, cable reels, power connectors and industrial radio remote controls. The General Industry segment offers a range of products, including slip ring columns for wind turbines and power connectors for high speed trains, among others. On September 3, 2012, it acquired aircraft ground support equipment manufacturer Combibox Systems Scandinavia AB.",
    "employeeTotal": "753.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "2011-10-19",
    "isin": "CH0136071542",
    "logo": "https://finnhub.io/api/logo?symbol=CCC.ST",
    "marketCapitalization": 2256.358,
    "naics": "Industrial Machinery Manufacturing",
    "naicsNationalIndustry": "All Other Industrial Machinery Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Cavotec SA",
    "phone": "",
    "sedol": "B42JP74",
    "shareOutstanding": 94.2432,
    "state": "TICINO",
    "ticker": "CCC.ST",
    "weburl": "http://www.cavotec.com"
}