{
    "address": "Masthuggsterminalen",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2226E108",
    "description": "Concordia Maritime AB engages in the provision of shipping services focusing on the transportation of refined petroleum products. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 3 full-time employees.  The firm specializes in the transportation of refined petroleum products, such as petrol, diesel and fuel, vegetable oils, light chemicals, as well as crude oil. The company is responsible for the development, construction, manning and charter of tanker vessels within time and spot charters. Its fleet comprises four types of vessels: Suezmax, Panamax, Long Range One (LR1) and Medium Range (MR). The company provides services primarily to oil and energy firms. Furthermore, the Company operates worldwide and is a parent of a number of entities, such as Concordia Maritime Chartering AB, Concordia Maritime (Bermuda) Ltd, Rederi AB Concordia, Concordia Maritime AG, CM P-MAX I Ltd, and CM P-MAX III Ltd, which are located in Sweden, Switzerland, Bermuda and Cyprus. The company is a subsidiary of Stena Sessan Rederi AB.",
    "employeeTotal": "3.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Energy ",
    "ggroup": "Energy",
    "gind": "Oil, Gas & Consumable Fuels",
    "gsector": "Energy",
    "gsubind": "Oil & Gas Storage & Transportation",
    "ipo": "1984-01-01",
    "isin": "SE0000102824",
    "logo": "",
    "marketCapitalization": 300.861,
    "naics": "Deep Sea, Coastal, and Great Lakes Water Transportation",
    "naicsNationalIndustry": "Deep Sea Freight Transportation",
    "naicsSector": "Transportation and Warehousing",
    "naicsSubsector": "Water Transportation",
    "name": "Concordia Maritime AB",
    "phone": "4631855000.0",
    "sedol": "4218296",
    "shareOutstanding": 47.729798,
    "state": "VASTRA GOTALANDS",
    "ticker": "CCOR B.ST",
    "weburl": "https://www.concordiamaritime.com/"
}