{
    "address": "Mobilvagen 12",
    "city": "Lund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2128U119",
    "description": "CellaVision AB engages in the provision of automated microscopy systems in the field of hematology. The company is headquartered in Lund, Skane and currently employs 177 full-time employees. The company went IPO on 2007-05-28. The firm develops and sells digital solutions for medical microscopy, as well as products enabling blood cell analysis and morphology diagnosis. CellaVision AB’s product portfolio consists of analyzers for automated medical microscopy analysis and software applications designed for remote access, competency testing and education. The analyzers include such brands as CellaVision DM96 and CellaVision DM1200, whereas the software applications are divided into CellaVision Body Fluid Application, CellaVision Remote Review Software and CellaVision Competency Software, among others. The firm operates four subsidiaries, based in Sweden, Canada, the United States and Japan. In June 2014, CellaVision AB acquired technology platform from Clear Lake Medical Foundation.",
    "employeeTotal": "177.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2007-05-28",
    "isin": "SE0000683484",
    "logo": "",
    "marketCapitalization": 9230.549,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "CellaVision AB",
    "phone": "46464601600.0",
    "sedol": "4018786",
    "shareOutstanding": 23.851547,
    "state": "SKANE",
    "ticker": "CEVI.ST",
    "weburl": "http://www.cellavision.com"
}