{
    "address": "Brogatan 7",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2397U105",
    "description": "Cloetta AB manufacturse, and markets sugar confectionery, chocolate products, pastilles, and chewing gum. The company is headquartered in Malmo, Skane and currently employs 2,609 full-time employees. The company went IPO on 2008-12-08. The primary ingredient for its products is cocoa. The firm uses cocoa mass that is produced from seeds found in the fruit of cocoa trees grown along the equator. The company produce and sells products within three main categories, namely Chocolate, which comprises chocolate wafers, plates, pralines and dragees; Sugar confectionery, which comprises foam, wine gums, liquorice, toffees, hard boiled candy, chewy candy, toffee/fudge/caramel and lollypops, and Refreshment, which comprises pastilles and chewing gum. The firm owns such brands, as Lakerol, Cloetta, Jenkki, Kexchoklad, Malaco, Sportlife, Saila, Red Band and Sperlari. The firm has 12 production units in six countries. In January 2014, it acquired Alrifai Nutisal AB. In May 2014, it acquired 75% of shares of Aran Candy Ltd and the brand The Jelly Bean Factory, Irish company producing and selling gourmet Jelly Beans.",
    "employeeTotal": "2609.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Food Products",
    "ggroup": "Food, Beverage & Tobacco",
    "gind": "Food Products",
    "gsector": "Consumer Staples",
    "gsubind": "Packaged Foods & Meats",
    "ipo": "2008-12-08",
    "isin": "SE0002626861",
    "logo": "https://finnhub.io/api/logo?symbol=CLA B.ST",
    "marketCapitalization": 7496.427,
    "naics": "Sugar and Confectionery Product Manufacturing",
    "naicsNationalIndustry": "Chocolate and Confectionery Manufacturing from Cacao Beans",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Food Manufacturing",
    "name": "Cloetta AB",
    "phone": "4640324200.0",
    "sedol": "B3K5QQ3",
    "shareOutstanding": 294.354548,
    "state": "SKANE",
    "ticker": "CLA B.ST",
    "weburl": "https://www.cloetta.com/"
}