{
    "address": "Sjogatan 6 J",
    "city": "Oernskoeldsvik",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2213Q122",
    "description": "Clavister Holding AB develops, produces and sells cybersecurity solutions. The company is headquartered in Oernskoeldsvik, Vasternorrland and currently employs 137 full-time employees. The company went IPO on 2014-05-21. The firm delivers a range of security solutions for physical and virtualized environments. Its customers include enterprises, cloud service providers and telecommunication operators. The product portfolio includes: Clavister cOS, a security network operating system comprising hardware and virtual appliances; Clavister InControl, a centralized management solution; and Clavister Web Management, a management solution for a single product; the built-in command-line interface (CLI); and Clavister Virtual Series, an appliance to secure virtual environments and cloud computing. Additionally, the Company offers four series of hardware products: Eagle, designed for remote access and branch office applications; Lynx, for industrial applications; Wolf, mainly for data centers; and PolarBear, aimed at telecommunication enterprises and large-scale data centers. The company also provides technical training program for network administrators.",
    "employeeTotal": "137.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Systems Software",
    "ipo": "2014-05-21",
    "isin": "SE0005308558",
    "logo": "",
    "marketCapitalization": 448.4814,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "Clavister Holding AB",
    "phone": "46664629924646.0",
    "sedol": "BCGD8Y6",
    "shareOutstanding": 54.826571,
    "state": "VASTERNORRLAND",
    "ticker": "CLAV.ST",
    "weburl": "https://www.clavister.com/"
}