{
    "address": "Torshamnsgatan 44",
    "city": "Kista",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W23981132",
    "description": "Climeon AB operates as a technology company, which engages in the development, production, and sale of heat power systems. The company is headquartered in Kista, Stockholm and currently employs 71 full-time employees. The company went IPO on 2017-10-13. The company offers Climeon Heat Power system, which utilizes the energy in waste heat and low-temperature geothermal heat to generate electricity. The heat, from geothermal sources, industrial waste heat or power production, is processed within Climeon unit. Inside the Climeon unit a heat exchanger transfers the heat to internal fluid, which vaporizes due to its lower boiling point. The vapors are then expanded over a turbine to run a generator and produce electricity. The working fluid at the exit of the turbine is condensed by direct contact with cooled fluid in a condensation vessel. A part of fraction of the fluid at the exit of the condensation vessel goes to the hot side heat exchanger. The rest is circulated through the cold side heat exchanger where the unused heat is rejected to cooling water. At this point cooler heat source re-injects into the reservoir for geothermal heat or sent for industrial process.",
    "employeeTotal": "71.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Capital Goods",
    "gind": "Electrical Equipment",
    "gsector": "Industrials",
    "gsubind": "Heavy Electrical Equipment",
    "ipo": "2017-10-13",
    "isin": "SE0009973548",
    "logo": "https://finnhub.io/api/logo?symbol=CLIME B.ST",
    "marketCapitalization": 712.1619,
    "naics": "Electrical Equipment Manufacturing",
    "naicsNationalIndustry": "Motor and Generator Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Electrical Equipment, Appliance, and Component Manufacturing",
    "name": "Climeon AB (publ)",
    "phone": "46101604433.0",
    "sedol": "BYSTHQ1",
    "shareOutstanding": 54.440679,
    "state": "STOCKHOLM",
    "ticker": "CLIME B.ST",
    "weburl": "https://www.climeon.com/"
}