{
    "address": "Arvid Wallgrens Backe 20",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R67K123",
    "description": "Cellink AB is a bioconvergence company, which provides technologies, products and services to create, understand and master biology. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 676 full-time employees. The company went IPO on 2016-11-03. The firm focuses on the application areas of bioprinting, multiomics, cell line development, and diagnostics. The firm develops and markets technologies that enable researchers in the life sciences to culture cells in 3D, perform high-throughput drug screening and print human tissues and organs for the medical, pharmaceutical, and cosmetic industries. The Company’s operations divided in two segments: The Industrial Solutions segment that offers products within precision dispensing and biosensor technology for industrial customers, which make a high-capacity contribution to customers production; and The Laboratory Solutions segment that offers 3Dprinters, single- cell and liquid- dispensing instruments as well as services and consumables related to these products.",
    "employeeTotal": "676.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Life Sciences Tools & Services",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Life Sciences Tools & Services",
    "gsector": "Health Care",
    "gsubind": "Life Sciences Tools & Services",
    "ipo": "2016-11-03",
    "isin": "SE0013647385",
    "logo": "https://finnhub.io/api/logo?symbol=CLNK B.ST",
    "marketCapitalization": 24333.2,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Cellink AB",
    "phone": "463112874646.0",
    "sedol": "BKMFJ94",
    "shareOutstanding": 58.077398,
    "state": "VASTRA GOTALANDS",
    "ticker": "CLNK B.ST",
    "weburl": "https://cellink.com/"
}