{
    "address": "Medicon Village, Scheelevagen 2",
    "city": "Lund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2397V103",
    "description": "Clinical Laserthermia Systems AB engages in the development and manufacture of pharmaceutical products. The company is headquartered in Lund, Skane and currently employs 7 full-time employees. The company went IPO on 2009-04-16. The firm develops and markets a product for the treatment of solid cancer tumors. The product is based on Immunostimulating Laser Thermo Therapy (imILT). imILT method can be used for all tumors in solid organ and the potential market is considerable. Examples of tumors which are suitable for treatment are those found in liver, breast, lung, prostate, kidney, pancreas and thyroid. Clinical Laserthermia Systems AB's treatment system consists of two main parts: a mobile laser device and a sterile patient unit for single use. The firm's product is intended for medical professionals within surgical oncology or interventional radiology within oncology. In April 2014, the Company announced the establishment of a subsidiary in the United States.",
    "employeeTotal": "7.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2009-04-16",
    "isin": "SE0002756130",
    "logo": "",
    "marketCapitalization": 218.4947,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Clinical Laserthermia Systems AB",
    "phone": "4646152100.0",
    "sedol": "B4Y62V6",
    "shareOutstanding": 59.09475,
    "state": "SKANE",
    "ticker": "CLS B.ST",
    "weburl": "https://clinicallaser.se/"
}