{
    "address": "Sjukhusvagen 12K",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W24210101",
    "description": "C-RAD AB engages in the development of innovative solutions for use in advanced radiation therapy. The company is headquartered in Uppsala, Uppsala and currently employs 57 full-time employees. The company went IPO on 2007-07-23. The company offers products and solutions to the radiation therapy market. C-Rad AB is the parent company within the C-Rad group (the Group). The Group provides such products, as Sentinel, a surface contour laser scanning system for patient positioning, monitoring and gating applications; Catalyst, a surface scanning system, which allows the identification and tracking of markers, and GEMini, a system based on a gaseous detector using metal converters interleaved with Gas Electron Multipliers (GEMs), as well as other products. The firm operates through several subsidiaries: C-RAD Positioning AB, C-RAD Imaging AB, C-RAD Innovation AB and Cyrpa International Sprl. The Company’s largest shareholder is Inter Life Science AB.",
    "employeeTotal": "57.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2007-07-23",
    "isin": "SE0002016352",
    "logo": "https://finnhub.io/api/logo?symbol=CRAD B.ST",
    "marketCapitalization": 1970.076,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "C Rad AB",
    "phone": "4618666930.0",
    "sedol": "B1XH5G5",
    "shareOutstanding": 33.659302,
    "state": "UPPSALA",
    "ticker": "CRAD B.ST",
    "weburl": "https://c-rad.se/"
}