{
    "address": "The Fris, Level 6, Triq Gorg Borg Olivier Street",
    "city": "Sliema",
    "country": "MT",
    "currency": "EUR",
    "cusip": "X1R6QC105",
    "description": "Catena Media plc provides marketing services for online gaming industry. is a Malta-based online lead generation company. The firm operates within iGaming and Financial Services. The firm attracts consumers through online marketing techniques, principally search engine optimization (SEO) and pay-per-click (PPC) and subsequently seeks to channel users to clients. The company owns and develops websites with unique content, usability and functions. The firm has three operating segments: Casino, Sports and Financial Services. The firm owns and operates more than 30 online brands, that is websites providing consumers with information about casino, sport and financial companies and their respective offers to the users. The firm has subsidiaries in Malta, United Kingdom, Serbia, Italy, United States, Canada, Australia, Japan and Sweden. Its subsidiaries include Catena Media US Inc., Catena Media UK Limited, Catena Operations Limited, Catena Media Australia Pty. Ltd., Catena Media Financials US Inc and Catena Media Canada LTD.",
    "employeeTotal": "411.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Media",
    "ggroup": "Media & Entertainment",
    "gind": "Interactive Media & Services",
    "gsector": "Communication Services",
    "gsubind": "Interactive Media & Services",
    "ipo": "2016-02-11",
    "isin": "MT0001000109",
    "logo": "https://finnhub.io/api/logo?symbol=CTM.ST",
    "marketCapitalization": 4426.574,
    "naics": "Other Information Services",
    "naicsNationalIndustry": "Internet Publishing and Broadcasting and Web Search Portals",
    "naicsSector": "Information",
    "naicsSubsector": "Other Information Services",
    "name": "Catena Media PLC",
    "phone": "35621310325.0",
    "sedol": "BYZYH36",
    "shareOutstanding": 70.392144,
    "state": "",
    "ticker": "CTM.ST",
    "weburl": "https://www.catenamedia.com"
}