{
    "address": "Brukslagarvagen 5",
    "city": "Nykoeping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W23219103",
    "description": "CTT Systems AB engages in the provision of condensation prevention and active humidification control systems for commercial aircraft. The company is headquartered in Nykoeping, Sodermanlands and currently employs 85 full-time employees.  The firm develops, manufactures and sells humidity control systems for commercial aircrafts. Its activities are divided into three business units: CTT Systems, responsible for humidity control in aircraft; Bribo Mekaniska, providing stamped metal components; and Catron Elektronik, which offers communication and control equipment. The Company’s product portfolio comprises: Zonal Drying System, which eliminates the accumulation of condensation in an aircraft; Cair, a moisture management system that removes condensation from the aircraft’s structure and humidifies the cabin; Crew Humidifiers, increases humidity in the crew rest compartments and flight deck; as well as Cair VIP, a humidification system adapted to private jet plane. The company collaborates with a range of entities, such as Boeing and Airbus. Furthermore, the Company is a parent of CTT Systems Inc, Catron Elektronik AB and Bribo Mekaniska AB.",
    "employeeTotal": "85.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Aerospace & Defense",
    "ggroup": "Capital Goods",
    "gind": "Aerospace & Defense",
    "gsector": "Industrials",
    "gsubind": "Aerospace & Defense",
    "ipo": "1997-11-11",
    "isin": "SE0000418923",
    "logo": "https://finnhub.io/api/logo?symbol=CTT.ST",
    "marketCapitalization": 2656.242,
    "naics": "Aerospace Product and Parts Manufacturing",
    "naicsNationalIndustry": "Other Aircraft Parts and Auxiliary Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Transportation Equipment Manufacturing",
    "name": "CTT Systems AB",
    "phone": "46155205900.0",
    "sedol": "5364778",
    "shareOutstanding": 12.529,
    "state": "SODERMANLANDS",
    "ticker": "CTT.ST",
    "weburl": "https://www.ctt.se/"
}