{
    "address": "Traktorgranden 3",
    "city": "Lund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2590D108",
    "description": "Dignitana AB engages in the development, manufacture and marketing of medical technology systems related to medical cooling. The company is headquartered in Lund, Skane and currently employs 27 full-time employees. The company went IPO on 2009-06-18. The company develops, manufactures and markets a medical device primarily used for scalp cooling in order to eliminate or reduce chemotherapy induced hair loss. The firm focuses on the product DigniCap, which counteracts hair loss during chemotherapy. The product is a cold cap, which when put on the patient’s head, lowers the temperature of the scalp. The low temperature reduces perfusion, delivery of blood and metabolism. The reduced blood flow results in a smaller amount of chemotherapy available for uptake in the cells, while the decreased temperature results in less absorption and reduced effects of chemotherapy. These factors together reduce the risk of hair loss. The DigniCap scalp cooling system is patented in Europe, Japan and the United States. The company has a subsidiary BrainCool AB, which focuses on producing different models of brain cooling for stroke and cardiac arrest patients.",
    "employeeTotal": "27.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2009-06-18",
    "isin": "SE0002108001",
    "logo": "https://finnhub.io/api/logo?symbol=DIGN.ST",
    "marketCapitalization": 744.9273,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Dignitana AB",
    "phone": "4646163090.0",
    "sedol": "B3P0MK9",
    "shareOutstanding": 65.059155,
    "state": "SKANE",
    "ticker": "DIGN.ST",
    "weburl": "http://www.dignitana.com"
}