{
    "address": "Hamngatan 13, Box 188",
    "city": "Ostersund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Diös Fastigheter AB engages in the provision of real estate services. The company is headquartered in Ostersund, Jamtlands and currently employs 151 full-time employees. The company went IPO on 2006-05-22. The company is engaged in the acquisition, development, management and sale of primarily commercial real estate property, such as offices, retail premises and industrial premises, among others. Its real estate portfolio is focused in the municipalities of Borlange, Falun, Gavle, Mora, Ostersund, Sundsvall, Skelleftea and Lulea. As of December 31, 2011, the Company’s real estate portfolio comprised 93 properties with a total leasable area of 338,721 square meters. The firm has nine subsidiaries: Dios Fastigheter I AB, Dios Fastigheter II AB, Dios Fastigheter V AB, Fastighets AB Uprum, Dios Fastigheter X AB and Are Contrum AB, among others. In July 2014, it sold property Borgmastaren 4, Strandgatan 22 to a newly formed housing association Borgmastaren 4 in Ostersund. In September 2014, the Company sold a property at Solhojden 31 in Sundsvall to HSB Produktion.",
    "employeeTotal": "151.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Real Estate",
    "ggroup": "Real Estate",
    "gind": "Real Estate Management & Development",
    "gsector": "Real Estate",
    "gsubind": "Real Estate Operating Companies",
    "ipo": "2006-05-22",
    "isin": "SE0001634262",
    "logo": "https://finnhub.io/api/logo?symbol=DIOS.ST",
    "marketCapitalization": 13007.35,
    "naics": "Lessors of Real Estate",
    "naicsNationalIndustry": "Lessors of Nonresidential Buildings (except Miniwarehouses)",
    "naicsSector": "Real Estate Rental and Leasing",
    "naicsSubsector": "Real Estate",
    "name": "Dios Fastigheter AB",
    "phone": "46770332200.0",
    "sedol": "B1323T9",
    "shareOutstanding": 134.07102,
    "state": "JAMTLANDS",
    "ticker": "DIOS.ST",
    "weburl": "http://www.dios.se"
}