{
    "address": "Hemvarnsgatan 15",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R936106",
    "description": "Dometic Group AB engages in the provision of solutions for mobile living in the areas of food and beverage; climate; power and control; and other applications. The company is headquartered in Solna, Stockholm and currently employs 6,500 full-time employees. The company went IPO on 2015-11-25. Its products include awnings, air conditioners, refrigerators, ovens, stoves, windows, lights, doors, sanitation systems, generators, sinks, cooktops, portable fridges and freezers, holding tanks, ovens, sinks, cool boxes, dishwashers, grills, inverters, safes, vacuum cleaners, generators, battery charging systems, wine coolers, and minibars, among others. Its products are sold through multiple distribution channels in around 100 countries under the brands: Dometic, WAECO, Marine Air, Cruisair, Condaria, SeaLand and Mobicool. The firm operates production facilities in Asia, Europe and the United States",
    "employeeTotal": "6500.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Auto Components",
    "ggroup": "Automobiles & Components",
    "gind": "Auto Components",
    "gsector": "Consumer Discretionary",
    "gsubind": "Auto Parts & Equipment",
    "ipo": "2015-11-25",
    "isin": "SE0007691613",
    "logo": "https://finnhub.io/api/logo?symbol=DOM.ST",
    "marketCapitalization": 46647,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Automatic Environmental Control Manufacturing for Residential, Commercial, and Appliance Use",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Dometic Group AB (publ)",
    "phone": "46850102500.0",
    "sedol": "BYSXJB2",
    "shareOutstanding": 295.833333,
    "state": "STOCKHOLM",
    "ticker": "DOM.ST",
    "weburl": "http://www.dometicgroup.com"
}