{
    "address": "6363 Woodway Dr Ste 1025",
    "city": "Houston",
    "country": "US",
    "currency": "SEK",
    "cusip": "W2592T150",
    "description": "Dome Energy AB operates as an independent oil and gas company. The company is headquartered in Houston, Texas and currently employs 15 full-time employees. The company went IPO on 2006-06-12. The firm is focused on the development and production of existing oil and gas assets onshore in the United States. The firm has a production capacity of 1,250 barrels of oil equivalent per day from a portfolio of oil, condensate and gas produced in Arkansas, Kentucky, Louisiana, Michigan, Mississippi, Oklahoma, Texas and Wyoming. The firm's properties include Texas - Orange, Texas - Concorde Dome, Texas - VistaTex Energy LLC (VistaTex), Wyoming - Gas Ventures LLC (Gas Ventures) and Kentucky - KYTX Oil & Gas LLC, KYTX Pipeline LLC and KYTX Drilling LLC (collectively, KYTX). The VistaTex portfolio is a portfolio of operated and non-operated assets producing oil, gas and condensate from approximately 180 wells primarily in Texas, but also in Arkansas, Louisiana, Mississippi and Oklahoma. The company operates approximately seven fields in the Bighorn and Wind River Basins. The KYTX portfolio consists of approximately 100 gas wells.",
    "employeeTotal": "15.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Energy ",
    "ggroup": "Energy",
    "gind": "Oil, Gas & Consumable Fuels",
    "gsector": "Energy",
    "gsubind": "Oil & Gas Exploration & Production",
    "ipo": "2006-06-12",
    "isin": "SE0011415710",
    "logo": "",
    "marketCapitalization": 25.6146,
    "naics": "Oil and Gas Extraction",
    "naicsNationalIndustry": "Crude Petroleum and Natural Gas Extraction",
    "naicsSector": "Mining",
    "naicsSubsector": "Oil and Gas Extraction",
    "name": "Dome Energy AB (publ)",
    "phone": "12815588585.0",
    "sedol": "BD36VG8",
    "shareOutstanding": 7.381729,
    "state": "TEXAS",
    "ticker": "DOME.ST",
    "weburl": "https://www.domeenergy.com/"
}