{
    "address": "Industrivagen 2",
    "city": "NORA",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2601M105",
    "description": "Drillcon AB engages in the diamond core drilling and raise boring for mining and construction drilling solutions. The company is headquartered in Nora, Orebro and currently employs 329 full-time employees. The company went IPO on 2006-08-07. Its main activities are diamond core drilling above and below ground, directional core drilling, raise boring and horizontal raise boring. As of December 31, 2011, the Company operated through four wholly owned subsidiaries, namely Drillcon Core AB, a Sweden-based core drilling contractor that operates on the Scandinavian market; Suomen Malmi Oy, a Finland-based company, which performs core drilling, mainly on surface, and geophysical services such as survey planning, field work and data processing, among others; Drillcon Iberia SA , which is based in Portugal and focuses on activities within core drilling in the Iberian Peninsula, and Drillcon Norway AS, which monitors and operates the Company’s services on the Norwegian market. As of December 31, 2011, the Company’s largest shareholder was AB Traction, which held 29.99% shares.",
    "employeeTotal": "329.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Metals & Mining",
    "ggroup": "Materials",
    "gind": "Metals & Mining",
    "gsector": "Materials",
    "gsubind": "Diversified Metals & Mining",
    "ipo": "2006-08-07",
    "isin": "SE0001770702",
    "logo": "https://finnhub.io/api/logo?symbol=DRIL.ST",
    "marketCapitalization": 395.156,
    "naics": "Nonmetallic Mineral Mining and Quarrying",
    "naicsNationalIndustry": "All Other Nonmetallic Mineral Mining",
    "naicsSector": "Mining",
    "naicsSubsector": "Mining (except Oil and Gas)",
    "name": "Drillcon AB",
    "phone": "4658782820.0",
    "sedol": "B197VC7",
    "shareOutstanding": 44.6,
    "state": "OREBRO",
    "ticker": "DRIL.ST",
    "weburl": "https://www.drillcon.se"
}