{
    "address": "Ostra Varvsgatan 9",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2410U124",
    "description": "Duni AB engages in the provision of napkin and table cover products. The company is headquartered in Malmo, Skane and currently employs 2,228 full-time employees. The company went IPO on 2007-11-14. The company also provides packaging and packaging systems to the take-away market. In March 2014, the Company introduced new organizational structure, based on five business areas. The Professional business area was divided in three separate ones: the Table Top, offering napkins, table coverings and candles for traditional restaurants in Europe; the Meal Service, manufacturing products for take-away packaging, serving and catering, targeting fast food segment; and the New Markets, active in geographic markets outside Europe. In addition, it is active in the Consumer business area, focused on the grocery retail trade; and the Materials and Services, comprising all other sales, such as tissue paper and hygiene products. Duni AB operates in over 15 countries and has production units in Sweden, Germany and Poland. In June 2014, it acquired 100% of the shares in the Paper+Design Group.",
    "employeeTotal": "2228.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Consumer products",
    "ggroup": "Consumer Durables & Apparel",
    "gind": "Household Durables",
    "gsector": "Consumer Discretionary",
    "gsubind": "Housewares & Specialties",
    "ipo": "2007-11-14",
    "isin": "SE0000616716",
    "logo": "https://finnhub.io/api/logo?symbol=DUNI.ST",
    "marketCapitalization": 5357.89,
    "naics": "Converted Paper Product Manufacturing",
    "naicsNationalIndustry": "All Other Converted Paper Product Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Paper Manufacturing",
    "name": "Duni AB",
    "phone": "4640106200.0",
    "sedol": "B03RSL4",
    "shareOutstanding": 46.999032,
    "state": "SKANE",
    "ticker": "DUNI.ST",
    "weburl": "https://www.duni.com/"
}