{
    "address": "Svardvagen 5",
    "city": "Danderyd",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W24147105",
    "description": "Duroc AB engages in designing, molding, and manufacture of stamping tools in the plastic-processing and metal-working industries. The company is headquartered in Danderyd, Stockholm and currently employs 1,122 full-time employees.  The company operates through two business areas: Industrial Trade and Technology/Production. The Industrial Trade area provides machine tools, and automation services and support to the engineering industries. The company includes companies active within the Duroc Machine Tool Group, which sells machine tools and accessories in Sweden, Norway, Denmark, Finland and the Baltic states, as well as distributes Doosan machine tools in Finland. The Technology/Production area manufactures customized products, as well as offers design solutions, processing and maintenance of the components for the engineering, power, process, timber processing and transportation industries. The segment comprises such entities as Duroc Special Steel, Duroc Rail and Duroc Engineering. The firm has over 15 subsidiaries located in Sweden, England, Estonia, Latvia and Norway.",
    "employeeTotal": "1122.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Chemicals",
    "ggroup": "Materials",
    "gind": "Chemicals",
    "gsector": "Materials",
    "gsubind": "Commodity Chemicals",
    "ipo": "1996-10-23",
    "isin": "SE0000331266",
    "logo": "https://finnhub.io/api/logo?symbol=DURC B.ST",
    "marketCapitalization": 1177.205,
    "naics": "Other General Purpose Machinery Manufacturing",
    "naicsNationalIndustry": "All Other Miscellaneous General Purpose Machinery Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Duroc AB",
    "phone": "46878911346.0",
    "sedol": "5197145",
    "shareOutstanding": 39.35,
    "state": "STOCKHOLM",
    "ticker": "DURC B.ST",
    "weburl": "https://www.duroc.com/"
}