{
    "address": "Augustendalsvagen 7",
    "city": "NACKA STRAND",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2R21A104",
    "description": "Dustin Group AB operates as a holding company. The company is headquartered in Nacka Strand, Stockholm and currently employs 1,696 full-time employees. The company went IPO on 2015-02-13. The company offers a portfolio of hardware, software and services, aimed at businesses, private customers and public organizations. The firm is divided in two business segments: business customer segment, also known as Business-to-Business (B2B); and consumer segment, also called Business-to-Consumer (B2C). Its product offering comprises computers and tablets, accessories, servers and storage supplies, network and security solutions, components, printers and supplies, phones, global positioning systems (GPS), audio and video equipment, office equipment, and software. Its solutions and services include personalized and secure mobility services, software licensing, print solutions, IT infrastructure, cloud services, installation, financing, client management, and support services, among others. The firm operates in Sweden, Denmark, Norway and Finland.",
    "employeeTotal": "1696.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Retail",
    "ggroup": "Retailing",
    "gind": "Internet & Direct Marketing Retail",
    "gsector": "Consumer Discretionary",
    "gsubind": "Internet & Direct Marketing Retail",
    "ipo": "2015-02-13",
    "isin": "SE0006625471",
    "logo": "",
    "marketCapitalization": 9253.898,
    "naics": "Professional and Commercial Equipment and Supplies Merchant Wholesalers",
    "naicsNationalIndustry": "Computer and Computer Peripheral Equipment and Software Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Durable Goods",
    "name": "Dustin Group AB",
    "phone": "46855344000.0",
    "sedol": "BVFB413",
    "shareOutstanding": 88.695631,
    "state": "STOCKHOLM",
    "ticker": "DUST.ST",
    "weburl": "http://www.dustingroup.com/"
}