{
    "address": "Tvistevagen 47",
    "city": "Umea",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2746N182",
    "description": "Ecoclime Group AB engages in the supply of real estate technology for recycling, charging, storage, recovery, and distribution of recycled and renewable thermal energy. The company is headquartered in Umea, Vasterbottens. The company went IPO on 2014-02-18. The company manufactures ceiling panels for indoor cooling with features such as improved effect per square meter, low air speeds with maintained air flow, low pressure resistance in ventilation system, easier installation and light weight. Its offer includes three types of ceiling solutions: passive comfort panel, based on cooled liquid circulation; semi-active comfort panel, equipped with fan; and active comfort panel, connected to ventilation air. The products are based on patented warmth absorbent, PGX, made of acrylonitrile butadiene styrene (ABS) plastic. The offer is primarily dedicated to real estate companies specialized in commercial properties, but also to residential properties, schools, medical facilities, hotels and conference centers.",
    "employeeTotal": "",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Building",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "ipo": "2014-02-18",
    "isin": "SE0012729937",
    "logo": "",
    "marketCapitalization": 694.0126,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Ecoclime Group AB",
    "phone": "4690771900.0",
    "sedol": "BJLK4Q5",
    "shareOutstanding": 40.255955,
    "state": "VASTERBOTTENS",
    "ticker": "ECC B.ST",
    "weburl": "http://ecoclime.se"
}