{
    "address": "Kungstensgatan 18",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2479G107",
    "description": "Elekta AB is a medical technology company. The company is headquartered in Stockholm, Stockholm and currently employs 4,128 full-time employees.  The firm offers and develops systems for radiation therapy and radio-surgery, as well as software systems that enhance workflow efficiency throughout the entire spectrum of cancer care. The firm has four product areas: Elekta Neuroscience, which develops solutions for the diagnosis and treatment of neurological diseases; Elekta Oncology, which creates clinical solutions for radiation therapy, such as linear accelerators, integrated imaging systems and clinical solutions for patient positioning and immobilization; Elekta Brachytherapy, which is engaged in the treatment of cancer through internal radiation, and Elekta Software, which develops software solutions for patient information, workflow management and treatment planning in oncology. The firm owns the service business of Asesores Electronicos Especializados SA de CV (AEESA).",
    "employeeTotal": "4128.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "1994-03-01",
    "isin": "SE0000163628",
    "logo": "https://finnhub.io/api/logo?symbol=EKTA B.ST",
    "marketCapitalization": 47584.66,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Elekta AB (publ)",
    "phone": "46858725400.0",
    "sedol": "B0M42T2",
    "shareOutstanding": 382.08312,
    "state": "STOCKHOLM",
    "ticker": "EKTA B.ST",
    "weburl": "https://www.elekta.com/"
}