{
    "address": "Trangsundsvagen 20",
    "city": "Kalmar",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W2830N106",
    "description": "Electra Gruppen AB is a holding company that develops and operates information technology (IT) concepts in supply chain management, distribution, and retail. The company is headquartered in Kalmar, Kalmar and currently employs 145 full-time employees. The company went IPO on 2006-04-05. The firm develops and operates information technology (IT) approach to supply chain management in consumer electronics and telecommunications industries. The company is responsible for marketing, product delivery, inventories, IT and concept development. The firm owns the brand names and business concepts for such chains, as AUDIO VIDEO (consumer electronics), RingUp (mobile phones and communication solutions to enterprises and institutions), Digitalbutikerna (consumer electronics), while the stores are owned by local contractors. The company also sells the store computer system, SMART. The firm is active in Sweden and Denmark. The firm operates Electra Sweden AB, Audio Video Sverige AB, Telemobilkommunikation AB, Entusiasterna AB and Logistik Partner i Kalmar AB, among others as wholly owned subsidiaries and El Salg as a minority owned subsidiary.",
    "employeeTotal": "145.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Retail",
    "ggroup": "Retailing",
    "gind": "Specialty Retail",
    "gsector": "Consumer Discretionary",
    "gsubind": "Computer & Electronics Retail",
    "ipo": "2006-04-05",
    "isin": "SE0001572520",
    "logo": "https://finnhub.io/api/logo?symbol=ELEC.ST",
    "marketCapitalization": 335.9923,
    "naics": "Electronics and Appliance Stores",
    "naicsNationalIndustry": "Radio, Television, and Other Electronics Stores",
    "naicsSector": "Retail Trade",
    "naicsSubsector": "Electronics and Appliance Stores",
    "name": "Electra Gruppen AB (publ)",
    "phone": "4648058400.0",
    "sedol": "B12LVX7",
    "shareOutstanding": 5.20112,
    "state": "KALMAR",
    "ticker": "ELEC.ST",
    "weburl": "https://www.electra.se/"
}