{
    "address": "Adolfsbergsvagen 13",
    "city": "Bromma",
    "country": "SE",
    "currency": "EUR",
    "cusip": "W2R50W100",
    "description": "Eltel AB engages in the provision of technical services for the critical infrastructure networks. The company is headquartered in Bromma, Stockholm and currently employs 5,330 full-time employees. The company went IPO on 2015-02-06. The company combines electricity, telecommunications and information technology (IT) to build Infranet infrastructure. The firm provides solutions in three segments: Power Transmission and Power Distribution, comprising building and maintaining of power transmission lines and substations, maintenance and improving distribution networks, metering, and Smart Grid solutions; Fixed Telecom and Mobile Telecom, providing planning, building, connection and maintenance services to wireless and wired networks; and Homeland Security & Aviation and Rail, including development and maintenance of alarm and radio networks, operation and construction of Communication, Navigation and Surveillance (CNS) systems, as well as Infranet for railway systems. The company is active in the Nordic and Baltic countries, Poland, Germany and the United Kingdom. The firm operates through Eltel Sonnico AS and Celer Oy.",
    "employeeTotal": "5330.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Construction",
    "ggroup": "Capital Goods",
    "gind": "Construction & Engineering",
    "gsector": "Industrials",
    "gsubind": "Construction & Engineering",
    "ipo": "2015-02-06",
    "isin": "SE0006509949",
    "logo": "https://finnhub.io/api/logo?symbol=ELTEL.ST",
    "marketCapitalization": 3689.086,
    "naics": "Utility System Construction",
    "naicsNationalIndustry": "Power and Communication Line and Related Structures Construction",
    "naicsSector": "Construction",
    "naicsSubsector": "Heavy and Civil Engineering Construction",
    "name": "Eltel AB",
    "phone": "46858537600.0",
    "sedol": "BVRZ9V8",
    "shareOutstanding": 157.499081,
    "state": "STOCKHOLM",
    "ticker": "ELTEL.ST",
    "weburl": "https://www.eltelgroup.com/"
}