{
    "address": "S:t Goransgatan 143, Stadshagen",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W24713120",
    "description": "Electrolux AB engages in the manufacturing of home and professional appliances. The company is headquartered in Stockholm, Stockholm and currently employs 51,276 full-time employees.  The firm offers designs and sustainable solutions, under brands including Electrolux, AEG, Zanussi and Frigidaire. The firm's segments include Major Appliances Europe, Middle East and Africa; Major Appliances Latin America; Major Appliances Asia/Pacific; Small Appliances and Professional Products. The firm's business areas include kitchen, laundry, small appliances and home care and services. The firm's Major Appliances and Small Appliances are producing appliances for the consumer market. Products within Major Appliances comprise of refrigerators, freezers, cookers, dryers, washing machines, dishwashers, room air-conditioners and microwave ovens. Small appliances include vacuum cleaners and other small appliances. Professional Products consists of foodservice equipment and laundry solutions for professional users.",
    "employeeTotal": "51276.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Consumer products",
    "ggroup": "Consumer Durables & Apparel",
    "gind": "Household Durables",
    "gsector": "Consumer Discretionary",
    "gsubind": "Household Appliances",
    "ipo": "1905-04-11",
    "isin": "SE0000103814",
    "logo": "https://finnhub.io/api/logo?symbol=ELUX B.ST",
    "marketCapitalization": 74039.66,
    "naics": "Household Appliance Manufacturing",
    "naicsNationalIndustry": "Household Cooking Appliance Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Electrical Equipment, Appliance, and Component Manufacturing",
    "name": "Electrolux AB",
    "phone": "4687386000.0",
    "sedol": "B1KKBX6",
    "shareOutstanding": 287.39745,
    "state": "STOCKHOLM",
    "ticker": "ELUX B.ST",
    "weburl": "https://www.electroluxgroup.com/"
}