{
    "address": "Postboxens nummer 5822",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3007A232",
    "description": "Endomines AB engages in the exploration, mining, and extraction of gold and ilmenite deposits. The company is headquartered in Stockholm, Stockholm and currently employs 30 full-time employees. The company went IPO on 2007-01-01. The company is engaged in the development and extraction of gold, ilmenite and carbonate deposits. As of December 31, 2011, the Company had two Finnish wholly owned subsidiaries, namely Endomines Oy and Kalvinit Oy, and one dormant Swedish subsidiary, Endomines Forvaltning AB. Endomines Oy is engaged in the exploration and development of gold deposits and planned gold mining. Kalvinit Oy is focused on the development of the industrial mineral ilmenite deposits. The firm explores gold along the Karelian Gold Line in eastern Finland, as well as in Porkonen and Kivimaa in Finnish Lappland. Ilmenite deposits are located in Kalvia area in central Ostrobothnia. The firm owns five ilmenite deposits: Koivu, Kaire, Pera, Riutta and Lyly in the Karleby region. On November 26, 2012, it sold its wholly owned subsidiary, Kuovila Limestone Oy to Juuan Dolomiittikalkki Oy, a private company in Finland.",
    "employeeTotal": "30.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Metals & Mining",
    "ggroup": "Materials",
    "gind": "Metals & Mining",
    "gsector": "Materials",
    "gsubind": "Gold",
    "ipo": "2007-01-01",
    "isin": "SE0008294334",
    "logo": "https://finnhub.io/api/logo?symbol=ENDO.ST",
    "marketCapitalization": 583.7569,
    "naics": "Metal Ore Mining",
    "naicsNationalIndustry": "Gold Ore Mining",
    "naicsSector": "Mining",
    "naicsSubsector": "Mining (except Oil and Gas)",
    "name": "Endomines AB (publ)",
    "phone": "",
    "sedol": "BD9Y1C2",
    "shareOutstanding": 243.852467,
    "state": "STOCKHOLM",
    "ticker": "ENDO.ST",
    "weburl": "http://www.endomines.com"
}