{
    "address": "Ideon Science Park, Scheelevagen 19",
    "city": "Lund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3106X109",
    "description": "Enzymatica AB engages in the research, development, and sale of medical technology products. The company is headquartered in Lund, Skane and currently employs 24 full-time employees. The company went IPO on 2011-06-14. The company researches, develops and registers enzyme-based health and wellbeing products. The firm uses a patented enzyme, Penzyme, a cold-adapted trypsin from deep sea cod. The enzyme is active at about 37 Celsius degree and decomposes disease-related proteins, counteracting viral and bacterial infections and supporting healing processes. The firm conducts clinical studies of ColdZyme Munspray, a cold medicine. The company operates such subsidiaries, as Enzymatica Care AB, Zymetech ehf, among others. Main shareholders of Enzymatica AB are Humea AB, Medi AB, and Nordic Consulting Group AB, among others. In November 2013, the Company established another subsidiary in the United States, Enzymatica North America Inc., responsible for future production and sale of veterinary products in the United States and Canada.",
    "employeeTotal": "24.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2011-06-14",
    "isin": "SE0003943620",
    "logo": "https://finnhub.io/api/logo?symbol=ENZY.ST",
    "marketCapitalization": 1610.46,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Enzymatica AB (publ)",
    "phone": "46462863100.0",
    "sedol": "B597NK7",
    "shareOutstanding": 147.748651,
    "state": "SKANE",
    "ticker": "ENZY.ST",
    "weburl": "http://www.enzymatica.se"
}