{
    "address": "Karlavagen 60",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3106G106",
    "description": "Episurf Medical AB engages in patient-specific technology for the treatment of painful joint injuries. The company is headquartered in Stockholm, Stockholm and currently employs 25 full-time employees. The company went IPO on 2010-11-05. The company is engaged in the development, manufacture and marketing of implants and surgical drilling templates used in the treatment of local cartilage damage in knee joints. The Company’s product portfolio includes the Episealer, and individually customized implant used as a cartilage replacement for early-stage patients; and Epiguide, a drill guide designed to attach to the knee’s surface, as well as related surgical tools. The personalization of implants and instruments is based on magnetic resonance imaging (MRI) and enables less invasive treatment. The process of ordering and creation of patient-specific implants and surgical instruments is covered by software suite, microiFidelity, comprising microiClinic, microiDesign and microiManufacture. The main shareholder of the Company is Serendipity Ixora Fund AB.",
    "employeeTotal": "25.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2010-11-05",
    "isin": "SE0003491562",
    "logo": "https://finnhub.io/api/logo?symbol=EPIS B.ST",
    "marketCapitalization": 709.9833,
    "naics": "Medical Equipment and Supplies Manufacturing",
    "naicsNationalIndustry": "Surgical Appliance and Supplies Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Miscellaneous Manufacturing",
    "name": "Episurf Medical AB",
    "phone": "4686120020.0",
    "sedol": "B3X8WQ1",
    "shareOutstanding": 222.040543,
    "state": "STOCKHOLM",
    "ticker": "EPIS B.ST",
    "weburl": "https://episurf.com/"
}