{
    "address": "Torshamnsgatan 21",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W26049119",
    "description": "Telefonaktiebolaget LM Ericsson engages in the provision of telecommunications equipment and related services to mobile and fixed network operators. The company is headquartered in Stockholm, Stockholm and currently employs 101,113 full-time employees. The company went IPO on 2008-01-01. The firm's segments include Networks, IT & Cloud and Media. The Networks segment consists of two business units: Network Products and Network Services. The overall focus is on evolving and managing access networks, including the development of hardware and software for radio access and transport networks. The IT & Cloud business includes two business units: IT & Cloud Products and IT & Cloud Services. The focus in IT & Cloud is to help telecom operators and selected enterprises through the digital transformations ahead. The company develops and delivers software-based solutions for television and media and combines a product portfolio that spans the television value chain, with systems integration and managed services. The portfolio includes compression, content publishing through set-top box or pure over-the-top, content delivery and analytics.",
    "employeeTotal": "101113.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Communications",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Communications Equipment",
    "gsector": "Information Technology",
    "gsubind": "Communications Equipment",
    "ipo": "2008-01-01",
    "isin": "SE0000108656",
    "logo": "https://finnhub.io/api/logo?symbol=ERIC B.ST",
    "marketCapitalization": 340327,
    "naics": "Communications Equipment Manufacturing",
    "naicsNationalIndustry": "Radio and Television Broadcasting and Wireless Communications Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Telefonaktiebolaget LM Ericsson",
    "phone": "46107190000.0",
    "sedol": "5959378",
    "shareOutstanding": 3329.585934,
    "state": "STOCKHOLM",
    "ticker": "ERIC B.ST",
    "weburl": "https://www.ericsson.com/"
}