{
    "address": "Tegelviksgatan 32",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W0R63Z102",
    "description": "Fagerhult AB engages in the manufacture, development, and marketing of lighting solutions for professional environments. The company is headquartered in Stockholm, Stockholm and currently employs 4,185 full-time employees.  Its product offering is divided into six groups. Office Lighting offers products and solutions for office environments, hotels and other public spaces. School Lighting offers solutions for educational premises, such as lecture halls, study rooms and libraries. Industrial Lighting offers systems, applications and products for industrial environments. Health and Hospital Care Products offers medical technical equipment, such as panels for intensive care units and treatment rooms, and dialysis columns in hospitals. Retail Lighting offers lighting solutions and service for retail environments. Outdoor Lighting offers lighting for public spaces such as roads, paths and parks, as well as architectural lighting. In June 2013, it acquired 100% of the shares of I-Valo Oy based in Iittala, Finland. In February 2014, it completed the acquisition of Arlight.",
    "employeeTotal": "4185.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Capital Goods",
    "gind": "Electrical Equipment",
    "gsector": "Industrials",
    "gsubind": "Electrical Components & Equipment",
    "ipo": "1997-05-13",
    "isin": "SE0010048884",
    "logo": "",
    "marketCapitalization": 13413.5,
    "naics": "Electric Lighting Equipment Manufacturing",
    "naicsNationalIndustry": "Commercial, Industrial, and Institutional Electric Lighting Fixture Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Electrical Equipment, Appliance, and Component Manufacturing",
    "name": "Fagerhult AB",
    "phone": "4636108500.0",
    "sedol": "BD8P085",
    "shareOutstanding": 176.147,
    "state": "STOCKHOLM",
    "ticker": "FAG.ST",
    "weburl": "https://www.fagerhultgroup.com/"
}