{
    "address": "Domnarvsgatan 16",
    "city": "Spanga",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3089L106",
    "description": "Ferroamp Elektronik AB offers a new technology to improve the benefits of local energy production. The company is headquartered in Spanga, Stockholm and currently employs 7 full-time employees. The company went IPO on 2019-03-22. The firm provides the EnergyHub system, a patented technology that improves the utilization of the solar power while increasing the output of the system. The EnergyHub system includes ACE (Adaptive Current Equalization) functionality and an integrated energy storage that continues utilizing the power modules after sunset. The system communicates with all the system components gathering relevant information for optimize the energy flow between solar panels, energy storage, and the grid. Through a power inverter, the system converts the DC (direct current) energy from the solar panels and energy storage into AC (alternating current) energy that can be used in the building, sold to the electric grid company or charge the batteries in the energy storage. The system allows the integration of solar cells, energy storage, small-scale wind and electric vehicle charging.",
    "employeeTotal": "7.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Capital Goods",
    "gind": "Electrical Equipment",
    "gsector": "Industrials",
    "gsubind": "Electrical Components & Equipment",
    "ipo": "2019-03-22",
    "isin": "SE0012229920",
    "logo": "",
    "marketCapitalization": 887.1963,
    "naics": "Electrical Equipment Manufacturing",
    "naicsNationalIndustry": "Power, Distribution, and Specialty Transformer Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Electrical Equipment, Appliance, and Component Manufacturing",
    "name": "Ferroamp Elektronik AB",
    "phone": "46868433390.0",
    "sedol": "BJ1F7W7",
    "shareOutstanding": 12.254092,
    "state": "STOCKHOLM",
    "ticker": "FERRO.ST",
    "weburl": "https://www.ferroamp.com/"
}