{
    "address": "885 Georgia St W",
    "city": "Vancouver",
    "country": "CA",
    "currency": "CAD",
    "cusip": "31730E101",
    "description": "Filo Mining Corp. operates as a mineral exploration company, which engages in the acquisition, exploration, and development of gold properties. The company is headquartered in Vancouver, British Columbia and currently employs 60 full-time employees. The company went IPO on 2016-08-26. The firm has interest in the Filo del Sol Project located in South America. The Filo del Sol Project is located on the border of Argentina's San Juan Province and Chile's adjacent Region III. The project is located approximately 100 kilometers southeast of the city of Copiapo, Chile. The Filo del Sol Project consists of mineral titles in both Chile and Argentina. Those in Argentina are referred to as the Filo del Sol Property, and those in Chile are referred to as the Tamberias Property. The Filo del Sol Project is a high sulfidation epithermal copper-gold-silver system associated with a porphyry copper-gold system. The company is based on drill holes, of approximately three kilometers in a north-south direction and one kilometer in an east-west direction. The mineralized system includes both disseminated and stock work mineralization. The total project area is approximately 16,000 hectares.",
    "employeeTotal": "60.0",
    "exchange": "TSX VENTURE EXCHANGE - NEX",
    "finnhubIndustry": "Metals & Mining",
    "ggroup": "Materials",
    "gind": "Metals & Mining",
    "gsector": "Materials",
    "gsubind": "Diversified Metals & Mining",
    "ipo": "2016-08-26",
    "isin": "CA31730E1016",
    "logo": "",
    "marketCapitalization": 977.2938,
    "naics": "Metal Ore Mining",
    "naicsNationalIndustry": "Gold Ore Mining",
    "naicsSector": "Mining",
    "naicsSubsector": "Mining (except Oil and Gas)",
    "name": "Filo Mining Corp",
    "phone": "16046897842",
    "sedol": "BD3VM71",
    "shareOutstanding": 113.243772,
    "state": "BRITISH COLUMBIA",
    "ticker": "FIL.V",
    "weburl": "https://www.filo-mining.com/"
}