{
    "address": "Kungsgatan 20",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3147N292",
    "description": "Fingerprint Cards AB engages in the development and provision of biometric system solutions. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 287 full-time employees.  The technology consists of biometric sensors, processors, algorithms and modules that can be used separately or combined. The Company’s product portfolio includes the FPC1011F Area and FPC1080A Swipe sensors, FPV2020 biometric processor, FPC-AM3 biometric module, FPC-BUND and FPC-AMD3 prototyping area development kits (DevKits), and FPC-SSK and SPC-SAK prototyping swipe DevKits, among others. As of December 31, 2011, the Company had one wholly owned subsidiary, namely Fingerprint Security System Databarare AB. As of December 31, 2011, the Company's two largest shareholders were Solrosen AB (22.05%) and Forsakringsaktiebolaget Avanza Pension (5.74%). In May 2014, it acquired all outstanding shares of Anacatum Design AB.",
    "employeeTotal": "287.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "1998-01-01",
    "isin": "SE0008374250",
    "logo": "https://finnhub.io/api/logo?symbol=FING B.ST",
    "marketCapitalization": 8722.04,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Fingerprint Cards AB",
    "phone": "46101720000.0",
    "sedol": "BD6S127",
    "shareOutstanding": 290.656,
    "state": "VASTRA GOTALANDS",
    "ticker": "FING B.ST",
    "weburl": "https://www.fingerprints.com"
}