{
    "address": "Sveavagen 168",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W38198102",
    "description": "FormPipe Software AB engages in the development of software products in the field of enterprise content management. The company is headquartered in Stockholm, Stockholm and currently employs 262 full-time employees. The company went IPO on 2005-01-01. The firm specializes in the software development within the area of enterprise content management (ECM). Its main products are Platina, a web-based information ECM product based on Microsoft; W3D3, a complete ECM platform intended for case and document management; LaserNet, a document management solution to support the switch from work and paper-intensive routines to electronic document management; Life Science, an enterprise quality management software (EQMS); Long-Term Archive, a system for preservation of digital information, and One2One, a document communication solution for insurance, bank and pension companies. The firm has four wholly owned subsidiaries, namely FormPipe Software Uppsala AB, FormPipe Software Linkoping AB, FormPipe Software A/S and FormPipe Software Skelleftea AB. On July 1, 2014, the Company completed the acquisition of the United Kingdom (UK) company GXP Limited (GXPi).",
    "employeeTotal": "262.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "2005-01-01",
    "isin": "SE0001338039",
    "logo": "https://finnhub.io/api/logo?symbol=FPIP.ST",
    "marketCapitalization": 1488.212,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "FormPipe Software AB",
    "phone": "46855529060.0",
    "sedol": "B05DWM9",
    "shareOutstanding": 53.463907,
    "state": "STOCKHOLM",
    "ticker": "FPIP.ST",
    "weburl": "http://www.formpipe.com"
}