{
    "address": "Klarabergsviadukten 63, Box 190",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3927Z101",
    "description": "Generic Sweden AB operates as a technology company, which provides messaging services for all applications. The company is headquartered in Stockholm, Stockholm and currently employs 17 full-time employees. The company went IPO on 2006-10-30. The Company’s activities are divided into two divisions, namely Consultancy and Telecom. The Consultancy division offers services to clients within the defense and civil security sector, as well as product development companies within the energy, telecommunications, transport/infrastructure and medical technology sectors. The Telecom division is a telecommunications operator that operates its own network for critical communication. The division offers products and services within the Minicall and Messit product areas. The Company’s customer base includes TeliaSonera, Telenor and Tele2, among others. As of December 31, 2011, the Company had four wholly owned subsidiaries, namely Generic Systems Sweden AB, Generic Mobile Systems Sweden AB, Generic Solutions Sweden AB and Generic Vaktis AB. As of December 31, 2011, the Company’s largest shareholder was Krantz Svedberg Forvaltning AB, which held 51.3% shares.",
    "employeeTotal": "17.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "2006-10-30",
    "isin": "SE0001790791",
    "logo": "https://finnhub.io/api/logo?symbol=GENI.ST",
    "marketCapitalization": 870.275,
    "naics": "Management, Scientific, and Technical Consulting Services",
    "naicsNationalIndustry": "Administrative Management and General Management Consulting Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Generic Sweden AB (publ)",
    "phone": "4686013800.0",
    "sedol": "B50PWX6",
    "shareOutstanding": 12.29202,
    "state": "STOCKHOLM",
    "ticker": "GENI.ST",
    "weburl": "http://www.generic.se"
}