{
    "address": "Lindholmspiren 7",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3443C107",
    "description": "Getinge AB is a medical technology company specializes in providing equipment, systems, operating rooms, intensive-care units to the healthcare and the life science industries. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 10,745 full-time employees.  The company provides products and services for intensive care units, sterilization centers, elderly care and companies and institutions active in the life sciences area. Its operations are divided into three business areas: The Medical Systems business area offers equipment for surgical disciplines, cardiology and intensive care; the Extended Care business area offers products and services geared toward the hospital and elderly care markets, including solutions for preventing the risk of pressure ulcers and deep vein thrombosis, and the Infection Control business area features systems for preventing the occurrence and spread of infection. Its products comprise disinfectors, sterilizers, including low temperature sterilization solutions, information technology (IT) solutions, as well as advice, training and technical support. The firm's products are sold under the Getinge, Lancer, ArjoHuntleigh and MAQUET brands.",
    "employeeTotal": "10745.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "1995-06-08",
    "isin": "SE0000202624",
    "logo": "https://finnhub.io/api/logo?symbol=GETI B.ST",
    "marketCapitalization": 91850.66,
    "naics": "Medical Equipment and Supplies Manufacturing",
    "naicsNationalIndustry": "Surgical and Medical Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Miscellaneous Manufacturing",
    "name": "Getinge AB",
    "phone": "46103350000.0",
    "sedol": "7698356",
    "shareOutstanding": 272.369573,
    "state": "VASTRA GOTALANDS",
    "ticker": "GETI B.ST",
    "weburl": "http://www.getingegroup.com/"
}