{
    "address": "Hemvarnsgatan 9",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4227F100",
    "description": "Guideline Geo AB engages in the development, manufacture, marketing, and sale of geophysical and geotechnical solutions. The company is headquartered in Solna, Stockholm and currently employs 68 full-time employees. The company went IPO on 2005-12-15. The firm develops and markets technology for the identification of objects, structures and processes underground. The company operates within three business areas, namely MALA, ABEM and SPC joint venture. The MALA business area develops, manufactures and markets products and solutions in the field of ground radar. The ABEM business area develops and sells products and solutions in the areas of resistivity, seismic and electromagnetic visualization. The SPC joint venture business area develops and sells solutions aimed at drilling optimization. Marketing and sales are carried out in collaboration with Atlas Copco Secoroc. The firm has own operations in the North America, Europe, Asia and Australia, as well as a global sales network. As of December 31, 2011, it had three wholly owned subsidiaries, Guideline AB, MALA Geoscience Forvaltnings Ab and ABEM Instrument AB.",
    "employeeTotal": "68.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "",
    "ggroup": "Energy",
    "gind": "Energy Equipment & Services",
    "gsector": "Energy",
    "gsubind": "Oil & Gas Equipment & Services",
    "ipo": "2005-12-15",
    "isin": "SE0005562014",
    "logo": "https://finnhub.io/api/logo?symbol=GGEO.ST",
    "marketCapitalization": 72.91101,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Guideline Geo AB (publ)",
    "phone": "46855761300.0",
    "sedol": "BGQV246",
    "shareOutstanding": 10.787918,
    "state": "STOCKHOLM",
    "ticker": "GGEO.ST",
    "weburl": "https://www.guidelinegeo.com/"
}