{
    "address": "10700 Stringfellow Rd Ste 10",
    "city": "Bokeelia",
    "country": "US",
    "currency": "EUR",
    "cusip": "36467X206",
    "description": "Gaming Innovation Group Inc. operates as an iGaming technology company, which engages in the provision of products and services to iGaming Operators. The company is headquartered in Bokeelia, Florida and currently employs 427 full-time employees. The company went IPO on 2000-03-30. The firm provides gambling solutions and entertainment. The firm's principal activity is to provide a platform for and facilitate Internet gambling, gaming and sports betting. The firm operates two segments, the Business to Consumer (B2C) segment which includes the gaming operations directed towards end users, and the Business to Business (B2B) segment which includes its iGC platform offering, sports trading, games and affiliate marketing. The Company’s GiG Core is a cloud-based solution licensed in Malta, United Kingdom, New Jersey, Germany, Sweden, Iowa, Latvia and Romania. The Company’s sportsbook can deliver end users a betting experience on offline or online channels. The Company’s GiG Data is a data platform, which can be integrated with GiG Core or with third-party solutions for data system. The firm operates in Nordic countries, Europe excluding Nordic countries and Rest of world.",
    "employeeTotal": "427.0",
    "exchange": "OSLO BORS ASA",
    "finnhubIndustry": "Hotels, Restaurants & Leisure",
    "ggroup": "Consumer Services",
    "gind": "Hotels, Restaurants & Leisure",
    "gsector": "Consumer Discretionary",
    "gsubind": "Casinos & Gaming",
    "ipo": "2000-03-30",
    "isin": "US36467X2062",
    "logo": "",
    "marketCapitalization": 1759.496,
    "naics": "Other Information Services",
    "naicsNationalIndustry": "Internet Publishing and Broadcasting and Web Search Portals",
    "naicsSector": "Information",
    "naicsSubsector": "Other Information Services",
    "name": "Gaming Innovation Group Inc",
    "phone": "12392820563.0",
    "sedol": "BHNZKX3",
    "shareOutstanding": 90.075626,
    "state": "FLORIDA",
    "ticker": "GIG.OL",
    "weburl": "https://www.gig.com/"
}