{
    "address": "Ulls Vag 29",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4R14D103",
    "description": "GomSpace Group AB engages in design, integration, and manufacture of nano-satellites for customers in the academic, government and commercial markets. The company is headquartered in Uppsala, Uppsala and currently employs 148 full-time employees. The company went IPO on 2016-06-16. The company operates as a parent of GomSpace ApS, which is a Denmark-based company that develops and sells hardware and software components for small satellites. The company offers engineering and consulting services, and a range of subsystems. The firm provides mission solutions, flight components, small satellites, flight hardware, flight software, components, embedded software, and hardware for embedded systems. Among the Company's main product categories are platforms, payloads, solar panels, ground stations, computers and other products. The firm also provides control software for applications spanning sea, land, aerospace, and space systems. GomSpace ApS offers software support for all microprocessor based products, including client libraries for ground stations and protocol software for communication.",
    "employeeTotal": "148.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Aerospace & Defense",
    "ggroup": "Capital Goods",
    "gind": "Aerospace & Defense",
    "gsector": "Industrials",
    "gsubind": "Aerospace & Defense",
    "ipo": "2016-06-16",
    "isin": "SE0008348304",
    "logo": "",
    "marketCapitalization": 967.0839,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "GomSpace Group AB",
    "phone": "",
    "sedol": "BYVG9J6",
    "shareOutstanding": 52.274803,
    "state": "UPPSALA",
    "ticker": "GOMX.ST",
    "weburl": "https://gomspace.com/"
}