{
    "address": "Karlavagen 60 2Tr",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4R143105",
    "description": "Greater Than is marketing and technology Company that has developed a car insurance solution based on AI that enables individual pricing over traditionally average prices. The company is headquartered in Stockholm, Stockholm and currently employs 25 full-time employees. The company went IPO on 2014-06-12. The company develops information technology (IT) solutions and platforms designed to improve car driving. The driving performance can be measured and compared regardless of car model, fuel consumption, traffic, weather and cargo. The Company’s portfolio includes: LeanHaulage, a platform for professional drivers, which provides individual advice, and enables reduction of fuel costs and improvement of driving efficiency; and Enerfy, an application to check, analyze and compare the efficiency of driving. The firm also provides its own hardware, designed to be connected with the CANbus systems of trucks. The company is equipped with modem to broadcast vehicle data via general packet radio service (GPRS) to the customers’ servers and provide them with results and improvement advice.",
    "employeeTotal": "25.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "2014-06-12",
    "isin": "SE0005881554",
    "logo": "https://finnhub.io/api/logo?symbol=GREAT.ST",
    "marketCapitalization": 1439.156,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "Greater Than AB",
    "phone": "467467579719.0",
    "sedol": "BLTVD56",
    "shareOutstanding": 12.624171,
    "state": "STOCKHOLM",
    "ticker": "GREAT.ST",
    "weburl": "https://greaterthan.eu/"
}