{
    "address": "Torshamnsgatan 35 6Tr",
    "city": "Kista",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4993R106",
    "description": "Hanza Holding AB engages in the provision of manufacturing solutions in mechanics, electronics, cables, and final assembly. The company is headquartered in Kista, Stockholm and currently employs 1,791 full-time employees. The company went IPO on 2014-06-19. The company provides complete manufacture solutions in the areas of mechanics, electronics, cable harnesses and final assembly. The firm has two segments: Mechanics, further divided into Technology machining, which offers lathing, milling, electronic discharge machining and grinding, and Sheet metal work, for both thin and thick plates processing; and Electronics, divided into Printed Circuit Board (PCB), which offers assembly of both flexible boards and large PCBs, as well as services such as automated optical inspection and testing, and Technology cabling, which manufactures and supplies cables for all applications. The firm operates in Sweden, Finland, Estonia, Poland, Slovakia and China. Its customers include Atlas Copco, Ericsson, ABB, and Saab Defense.",
    "employeeTotal": "1791.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Manufacturing Services",
    "ipo": "2014-06-19",
    "isin": "SE0005878543",
    "logo": "",
    "marketCapitalization": 791.7323,
    "naics": "Other Investment Pools and Funds",
    "naicsNationalIndustry": "Other Financial Vehicles",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Funds, Trusts, and Other Financial Vehicles",
    "name": "Hanza Holding AB",
    "phone": "",
    "sedol": "BNFX606",
    "shareOutstanding": 35.779928,
    "state": "STOCKHOLM",
    "ticker": "HANZA.ST",
    "weburl": ""
}