{
    "address": "Lilla Bantorget 15",
    "city": "Stockholm",
    "country": "SE",
    "currency": "EUR",
    "cusip": "W4R431112",
    "description": "Hexagon AB is a SE-based company operating in Electronic Equipment, Instruments & Components industry. The company is headquartered in Stockholm, Stockholm and currently employs 20,905 full-time employees.  Hexagon AB is a Sweden-based company, which operates as a provider of information technologies that drive productivity across geospatial and industrial enterprise applications for a range of industries. The firm's solutions integrate geospatial and industrial sensors, software, three-dimensional (3D) mapping, five-dimensional visualization and analysis, domain knowledge and customer workflows into intelligent information ecosystems that deliver actionable information. The firm's solutions are used in broad range of industries, such as agriculture, metals and mining, oil and gas, automotive, chemical, power, shipbuilding, construction, safety, defense and aerospace, surveying, medical devices and pharmaceutical, among others. Hexagon AB is active in approximately 50 countries. The company operates through numerous subsidiaries, including NESTIX Oy, MSC Software, Catavolt Inc and DST Computer Services SA, among others.",
    "employeeTotal": "20905.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "1905-06-10",
    "isin": "SE0015961909",
    "logo": "https://finnhub.io/api/logo?symbol=HEXA B.ST",
    "marketCapitalization": 323093.8,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Hexagon AB",
    "phone": "4686012620.0",
    "sedol": "BNZFHC1",
    "shareOutstanding": 2478.355614,
    "state": "STOCKHOLM",
    "ticker": "HEXA B.ST",
    "weburl": "https://hexagon.com/"
}