{
    "address": "Box 4126",
    "city": "Halmstad",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4598X110",
    "description": "HMS Networks AB is engaged in the development, manufacture, and supply of communication technology for industrial automation. The company is headquartered in Halmstad, Hallands and currently employs 661 full-time employees. The company went IPO on 2007-10-19. The firm provides solutions to connect industrial devices to networks and products enabling interconnection between different industrial networks. The Company’s products are classified into two brands, namely Anybus and Netbiter. HMS, under the brand name Anybus, manufactures and markets intelligent communication technology for machines and electrically controlled equipment. Under the brand name Netbiter it develops and sells communication equipment that facilitates remote management through the Internet, either via the fixed telephony network or the mobile telephony network. The firm operates through numerous subsidiaries, including HMS Industrial Networks AB, IXXAT GmbH, a supplier of communication technology for industrial automation, machine manufacturing and the automotive industry, as well as eWON SA.",
    "employeeTotal": "661.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Communications",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Communications Equipment",
    "gsector": "Information Technology",
    "gsubind": "Communications Equipment",
    "ipo": "2007-10-19",
    "isin": "SE0009997018",
    "logo": "https://finnhub.io/api/logo?symbol=HMS.ST",
    "marketCapitalization": 18072.08,
    "naics": "Communications Equipment Manufacturing",
    "naicsNationalIndustry": "Telephone Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "HMS Networks AB",
    "phone": "4635172900.0",
    "sedol": "BZ30ML6",
    "shareOutstanding": 46.661297,
    "state": "HALLANDS",
    "ticker": "HMS.ST",
    "weburl": "https://www.hms-networks.com/"
}