{
    "address": "Strandvagen 1",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Holmen AB engages in the manufacture of paperboard, paper and wood products and runs forestry and energy production operations. The company is headquartered in Stockholm, Stockholm and currently employs 3,318 full-time employees.  The firm is engaged in the manufacture of printing paper, paperboard and sawn timber and conducting forestry and energy production operations. The Company’s operations are divided into five business areas. The Holmen Paper business area manufactures magazine and book paper, white and colored newsprint, and telephone directory paper at two mills in Sweden and one in Spain. The Iggesund Paperboard business area produces solid bleached board (SBB) and folding boxboard (FBB) for consumer packaging and graphics printing at one mill in Sweden and one in the United Kingdom. The Holmen Timber business area produces pine joinery timber and spruce construction timber at two Swedish sawmills. The Holmen Skog business area is responsible for the Company’s forests and wood supply. The Holmen Energi business area is in charge of the Company’s hydro and wind power operations.",
    "employeeTotal": "3318.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Paper & Forest",
    "ggroup": "Materials",
    "gind": "Paper & Forest Products",
    "gsector": "Materials",
    "gsubind": "Paper Products",
    "ipo": "1936-05-11",
    "isin": "SE0011090018",
    "logo": "https://finnhub.io/api/logo?symbol=HOLM B.ST",
    "marketCapitalization": 68086.13,
    "naics": "Pulp, Paper, and Paperboard Mills",
    "naicsNationalIndustry": "Newsprint Mills",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Paper Manufacturing",
    "name": "Holmen AB",
    "phone": "4686662100.0",
    "sedol": "BDQQ1Q5",
    "shareOutstanding": 161.925685,
    "state": "STOCKHOLM",
    "ticker": "HOLM B.ST",
    "weburl": "https://www.holmen.com/"
}