{
    "address": "SKEPPSBRON 3",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "HEXPOL AB engages in the manufacture and sale of polymer compounds and engineered products. The company is headquartered in Malmo, Skane and currently employs 4,580 full-time employees. The company went IPO on 2008-01-01. Its operations are divided into two business areas. The HEXPOL Compounding business area develops and manufactures advanced polymer compounds for demanding applications, and includes 25 production units with production, sales and development operations, which are divided into four areas: the geographic regions of North American Free Trade Agreement (NAFTA), Europe and Asia, as well as the HEXPOL Thermoplastic Elastomer (TPE)-Compounding product area. The HEXPOL Engineered Products business area offers a combination of material and application technology in polymer materials and special components, and develops and manufactures rubber gaskets for plate heat exchangers and rubber and plastic wheels for forklifts. The firm focuses mainly on the Original Equipment Manufacturer (OEM) customers. In August 2014, Hexpol AB completed the acquisition of Kardoes Rubber.",
    "employeeTotal": "4580.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Chemicals",
    "ggroup": "Materials",
    "gind": "Chemicals",
    "gsector": "Materials",
    "gsubind": "Specialty Chemicals",
    "ipo": "2008-01-01",
    "isin": "SE0007074281",
    "logo": "https://finnhub.io/api/logo?symbol=HPOL B.ST",
    "marketCapitalization": 36593.51,
    "naics": "Resin, Synthetic Rubber, and Artificial Synthetic Fibers and Filaments Manufacturing",
    "naicsNationalIndustry": "Plastics Material and Resin Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Hexpol AB",
    "phone": "4640254660.0",
    "sedol": "BXBZB01",
    "shareOutstanding": 344.436846,
    "state": "SKANE",
    "ticker": "HPOL B.ST",
    "weburl": "http://www.hexpol.com"
}