{
    "address": "Westmansgatan 29",
    "city": "Linkoping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4863E102",
    "description": "Impact Coatings AB engages in the provision and development of physical vapor deposition technology solutions. The company is headquartered in Linkoping, Ostergotland and currently employs 34 full-time employees. The company went IPO on 2004-12-15. The company develops and commercializes the technology for physical vapor deposition (PVD) coating processes. PVD is a method to apply thin films of metals and ceramics on various components. The firm offers MaxPhase coatings, a replacement for gold on electrical contacts, as well as other coatings for decorative and functional purposes on plastics and metals. Additionally, the Company’s product portfolio comprises: ReelCoater, which focuses on the needs of the electrical component industry, where production is often reel-to-reel; InlineCoater, which enables mass production of PVD-coated parts, and PlastiCoater, which is a PVD metallization unit designed to work alongside, and in synchronization with, a moulding machine. As of December 31, 2011, the Company’s largest shareholder was Forsakringsaktiebolaget Avanza Pension (16.38%).",
    "employeeTotal": "34.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "2004-12-15",
    "isin": "SE0001279142",
    "logo": "",
    "marketCapitalization": 1081.233,
    "naics": "Industrial Machinery Manufacturing",
    "naicsNationalIndustry": "All Other Industrial Machinery Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Impact Coatings AB (publ)",
    "phone": "46736870623.0",
    "sedol": "B03FGF8",
    "shareOutstanding": 56.609051,
    "state": "OSTERGOTLAND",
    "ticker": "IMPC.ST",
    "weburl": "http://www.impactcoatings.com/"
}