{
    "address": "Raseborgsgatan 9",
    "city": "Kista",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Indutrade AB engages in the development, marketing, and sale of components, systems, and services. The company is headquartered in Kista, Stockholm and currently employs 7,488 full-time employees. The company went IPO on 2005-10-05. The company operates through eight segments: Benelux, DACH and UK offer custom-manufactured niche products, design solutions, aftermarket services, assembly and customization. Finland provides components, customization, combinations and product installations. Flow Technology supplies components and systems for controlling, measuring, monitoring and regulating flows. Fluids & Mechanical Solutions offers hydraulic and mechanical components to industries in the Nordic countries, but also in Europe and North America. Industrial Components includes technical components and systems for industrial production, maintenance and medical technology equipment. Measurement & Sensor Technology sells measurement instruments and systems, sensors, control and regulating technology, and monitoring equipment. Through its subsidiaries the Company operates globally.",
    "employeeTotal": "7488.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "2005-10-05",
    "isin": "SE0001515552",
    "logo": "https://finnhub.io/api/logo?symbol=INDT.ST",
    "marketCapitalization": 81413.12,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Other Measuring and Controlling Device Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Indutrade AB",
    "phone": "4687030300.0",
    "sedol": "B0LDBX7",
    "shareOutstanding": 363.615,
    "state": "STOCKHOLM",
    "ticker": "INDT.ST",
    "weburl": "https://www.indutrade.se/"
}