{
    "address": "Arvid Wallgrens backe 20",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4962T109",
    "description": "Insplorion AB is a holding company, which engages in the development and market of NanoPlasmonic Sensing technology for sensor system applications. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 15 full-time employees. The company went IPO on 2015-06-25. The company is engaged in the development and marketing of NanoPlasmonic Sensing (NPS) technology, which allows to perform real-time optical material studies. The firm's offer includes instruments for studying processes of nanomaterials, sensor chips, and Insplorer, a software product for instruments control. Its main product is scientific instrument system, consisting of sensors built of gold nanoparticles. The firm dedicates its offer to such applications as biomolecular interactions, catalysis and surface physics, dye sensitized solar cells (DSSC) and perovskite solar cells, and polymer physics.",
    "employeeTotal": "15.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "2015-06-25",
    "isin": "SE0006994943",
    "logo": "https://finnhub.io/api/logo?symbol=INSP.ST",
    "marketCapitalization": 241.6523,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Instruments and Related Products Manufacturing for Measuring, Displaying, and Controlling Industrial Process Variables",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Insplorion AB",
    "phone": "46313802695.0",
    "sedol": "BX1BCV7",
    "shareOutstanding": 13.085944,
    "state": "VASTRA GOTALANDS",
    "ticker": "INSP.ST",
    "weburl": "https://www.insplorion.com/"
}