{
    "address": "Marcusplatsen 1",
    "city": "Nacka",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4662R106",
    "description": "Intrum AB is engaged in providing credit management services. The company is headquartered in Nacka, Stockholm and currently employs 9,626 full-time employees. The company went IPO on 2002-06-07. The firm offers services covering the entire credit management chain, ranging from prospecting and segmenting to payment management services, collection and financial services. Its offering includes credit optimization services; such as credit decisions, credit monitoring and credit information, as well as consultancy and advisory services; payment services, such as sales ledger services, reminder services and e-commerce services, as well as VAT refund services, and collection services, such as debt collection and debt surveillance services, as well as worldwide debt collection services. The firm also offers a range of solutions for different type of businesses. The firm has a number of subsidiaries based in Denmark, Italy, Lithuania, Portugal, Switzerland, and the United Kingdom, among others.",
    "employeeTotal": "9626.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Diversified Support Services",
    "ipo": "2002-06-07",
    "isin": "SE0000936478",
    "logo": "https://finnhub.io/api/logo?symbol=INTRUM.ST",
    "marketCapitalization": 34203.58,
    "naics": "Business Support Services",
    "naicsNationalIndustry": "Collection Agencies",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "Intrum AB",
    "phone": "4686167700.0",
    "sedol": "7371431",
    "shareOutstanding": 120.870918,
    "state": "STOCKHOLM",
    "ticker": "INTRUM.ST",
    "weburl": "https://www.intrum.com/"
}