{
    "address": "Lindholmspiren 7 A",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5757W108",
    "description": "Irisity AB engages in the development and sale of licenses, surveillance, and monitoring solutions. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 45 full-time employees. The company went IPO on 2013-10-23. The company develops security solutions in the area of video surveillance, with cameras connected to certified alarm centrals, monitoring of the system, installation, automatic alarms and ongoing service. The company offers complete packages for different types of areas, dependent on their requirements and potential threats. The solutions are designed to cover vast areas with a limited number of cameras. The Company’s movement detectors are proof to weather conditions, as well supplied with guarantee of no false alarm. The service is provided on the contract basis. Through cooperation with partners, it offers complete security solutions, including installation, guard service and alarm central operations. The firm directs its offer to municipalities, institutions and companies. The company operates in Sweden, Finland, Norway, Denmark and Poland, among others.",
    "employeeTotal": "45.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Security & Alarm Services",
    "ipo": "2013-10-23",
    "isin": "SE0005365681",
    "logo": "",
    "marketCapitalization": 1612.472,
    "naics": "Building Equipment Contractors",
    "naicsNationalIndustry": "Electrical Contractors and Other Wiring Installation Contractors",
    "naicsSector": "Construction",
    "naicsSubsector": "Specialty Trade Contractors",
    "name": "Irisity AB (publ)",
    "phone": "46771411100.0",
    "sedol": "BFSS668",
    "shareOutstanding": 25.840904,
    "state": "VASTRA GOTALANDS",
    "ticker": "IRIS.ST",
    "weburl": "https://www.irisity.com/"
}