{
    "address": "Arvid Wallgrens Backe 20",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W4846G125",
    "description": "IRLAB Therapeutics AB engages in the provision of novel treatments for disorders of the brain that focuses on illness in the central nervous system. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 25 full-time employees. The company went IPO on 2017-02-28. The company focuses on illnesses in the central nervous system and primarily on development of drugs to assist patients with Parkinson’s disease. The firm possesses a research platform Integrative Screening Process (ISP), which aims to discover and develop drug candidates for the treatment of brain diseases. The firm operates projects on both clinical phase and preclinical phases. The primary projects are IRL790 and IRL752, both on clinical phase. The IRL790 project is a psychomotor stabilizer for the treatment of levodopa (L-dopa) amino acid that dyskinesia induces in Parkinson’s Disease (PD-LIDs) and Parkinson Disease psychosis (PD-Psychosis). The IRL752 project aims at cortical enhancement for the treatment of Parkinson Disease Dementia (PD-D) and Behavioral and Psychological Symptoms of Dementia (BPSD).",
    "employeeTotal": "25.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2017-02-28",
    "isin": "SE0012675361",
    "logo": "https://finnhub.io/api/logo?symbol=IRLAB A.ST",
    "marketCapitalization": 2186.101,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "IRLAB Therapeutics AB",
    "phone": "46317573800.0",
    "sedol": "BFYWGL9",
    "shareOutstanding": 51.748406,
    "state": "VASTRA GOTALANDS",
    "ticker": "IRLAB A.ST",
    "weburl": "http://www.irlab.se"
}