{
    "address": "Instrumentvagen 2",
    "city": "Jonkoping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5188G193",
    "description": "ITAB Shop Concept AB is a SE-based company operating in Commercial Services & Supplies industry. The company is headquartered in Jonkoping, Jonkopings and currently employs 2,962 full-time employees. The company went IPO on 2004-05-28. ITAB Shop Concept AB is a Sweden-based company engaged in the development, manufacture, marketing and installation of shop fitting concepts and products for chain stores in the food and non-food segments. The Company’s product portfolio comprises equipment for the checkout aisle, self-checkout solutions, flexible entrance and exit systems, as well as lighting systems. In addition, It offers custom-made shop concepts and light planning and service. The firm operates worldwide, including the United Kingdom, Poland, Germany, Hungary, Lithuania, Latvia, Russia, and the Nordic countries, among others. Furthermore, It is a parent of a number of entities, such as AB ITAB Novena, ITAB Germany Gmbh, ITAB Konsult AB, ITAB Pharmacy AB, Nordic Light Group AB, ITAB Pan-Oston Oy, ITAB Shop Concept AS, New Store Europe Denmark AS and JPD.",
    "employeeTotal": "2962.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Office Services & Supplies",
    "ipo": "2004-05-28",
    "isin": "SE0015962097",
    "logo": "https://finnhub.io/api/logo?symbol=ITAB.ST",
    "marketCapitalization": 3808.029,
    "naics": "Office Furniture (including Fixtures) Manufacturing",
    "naicsNationalIndustry": "Office Furniture (except Wood) Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Furniture and Related Product Manufacturing",
    "name": "ITAB Shop Concept AB",
    "phone": "4636317300.0",
    "sedol": "BNXLXK1",
    "shareOutstanding": 240.266592,
    "state": "JONKOPINGS",
    "ticker": "ITAB.ST",
    "weburl": "https://itab.com/sv/"
}