{
    "address": "Karolinska Institutet Science Park, Banvaktsvagen 22",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5S817308",
    "description": "Kancera AB engages in the research, development, and sale of drug candidate to pharmaceutical companies. The company is headquartered in Solna, Stockholm and currently employs 8 full-time employees. The company went IPO on 2011-02-21. The firm's activities are divided into two areas, namely Pharmaceutical Development and Industrial Research and Development (R&D). Pharmaceutical Development area runs such projects, as Project PFKFB3, which aims to develop a drug to combat solid tumors; and Project ROR-1, which aims to develop a drug to combat chronic lymphatic leukemia (CLL). Industrial R&D area consists of the identification of new projects of high potential and of R&D work commissioned by clients. The firm's other activities include development of cancer models and stem cell-based techniques. The firm is active through its subsidiary iNovacia, which carries out analytical development, as well as the identification, validation and further optimization of drug candidates. The firm's operations are conducted at the Karolinska Institutet Science Park in Solna, Sweden.",
    "employeeTotal": "8.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2011-02-21",
    "isin": "SE0015658570",
    "logo": "",
    "marketCapitalization": 503.7168,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Medicinal and Botanical Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Kancera AB",
    "phone": "46850126080.0",
    "sedol": "BKY88Q1",
    "shareOutstanding": 55.771963,
    "state": "STOCKHOLM",
    "ticker": "KAN.ST",
    "weburl": "http://kancera.com/"
}