{
    "address": "Tomtebodavagen 23 A",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W50064125",
    "description": "Karolinska Development AB engages in the investment in pharmaceutical and medical technology companies. The company is headquartered in Solna, Stockholm and currently employs 7 full-time employees. The company went IPO on 2011-04-15. The firm provides capital to biotechnology firms, as well as develops and commercializes biotechnological products. Its activities are involved in a range of areas: oncology, infections and wound healing, women’s health, cardiovascular and hematology, medical equipment, diagnostics, pharmaceutical formulation, as well as implants, among others. The Company’s pharmaceuticals portfolio comprises: AXL1717 for non-small-cell lung carcinoma (NSCLC), APR-246 for ovarian cancer, Sevuparin for malaria, SHACT for pain relief at hysteroscopy and intrauterine device (IUD) insertion, and PC-mAB for acute coronary syndrome (ACS), among others. Furthermore, the Company controls a number of subsidiaries, such as Avaris AB, HBV Thernostica AB, KD Incentive AB, KDev Oncology AB and Limone AB.",
    "employeeTotal": "7.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2011-04-15",
    "isin": "SE0002190926",
    "logo": "",
    "marketCapitalization": 508.554,
    "naics": "Medical Equipment and Supplies Manufacturing",
    "naicsNationalIndustry": "Surgical Appliance and Supplies Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Miscellaneous Manufacturing",
    "name": "Karolinska Development AB",
    "phone": "46852486070.0",
    "sedol": "B3FPFG1",
    "shareOutstanding": 175.665409,
    "state": "STOCKHOLM",
    "ticker": "KDEV.ST",
    "weburl": "http://www.karolinskadevelopment.com/"
}