{
    "address": "Klarabergsgatan 60, Box 3383",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Knowit AB engages in the provision of consulting services focusing on digital and cross-functional solutions. The company is headquartered in Stockholm, Stockholm and currently employs 2,534 full-time employees.  The company offers its clients information technology (IT) consulting services, IT solutions and tailored processes. Its offering comprises: Application Management, including activities that guarantee that a solution provides the functions that were ordered; Business and IT Management, reviewing processes, working methods and providing IT support; Decision Support, helping clients to make use of their own information; Systems Development, offering services from architecture and design to test and installation; Technology Management, focused on management, strategic development, product management, project management, architecture, quality assurance, safety engineering and modeling; Test and Quality Management, improving quality assurance through structured competency training for organizations; Web and Collaboration, including services such as Web Content Management; and Knowit Dataunit GmbH, specialized in defense and the manufacturing industry.",
    "employeeTotal": "2534.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "1999-03-11",
    "isin": "SE0000421273",
    "logo": "https://finnhub.io/api/logo?symbol=KNOW.ST",
    "marketCapitalization": 6104.656,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Computer Systems Design Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Knowit AB (publ)",
    "phone": "4687006600.0",
    "sedol": "5364886",
    "shareOutstanding": 19.809558,
    "state": "STOCKHOLM",
    "ticker": "KNOW.ST",
    "weburl": "https://www.knowit.se/"
}