{
    "address": "Torsgatan 2, Box 3508",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5303A147",
    "description": "Lagercrantz Group AB engages in the provision and distribution of technology products and solutions in the field of electronics, electricity, communications, and related fields. The company is headquartered in Stockholm, Stockholm and currently employs 1,511 full-time employees. The company went IPO on 2001-09-03. Its activities are organized into three divisions. The Electronics division offers industrial wireless communication products and embedded electronic systems. The Mechatronics division sells electric and electro-mechanical products and offers electric connection systems and customized production of cable harnesses, as well as develops support brackets and masts. The Communications division offers products, systems and services in digital image transmission, technical security and access, and software distribution, as well as comprises Precimeter Control AB, a developer of laser and induction technology solutions, and Excidor AB, a provider of control systems for mobile operator environments. The Niche products division produces and sells products in market niches through Svenska Industriborstar i Vasteras AB, Dooman Teknik AB and Profsafe AB.",
    "employeeTotal": "1511.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "2001-09-03",
    "isin": "SE0014990966",
    "logo": "",
    "marketCapitalization": 20652.03,
    "naics": "Other Electrical Equipment and Component Manufacturing",
    "naicsNationalIndustry": "All Other Miscellaneous Electrical Equipment and Component Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Electrical Equipment, Appliance, and Component Manufacturing",
    "name": "Lagercrantz Group AB",
    "phone": "4687006670.0",
    "sedol": "BMWX9N6",
    "shareOutstanding": 203.42077,
    "state": "STOCKHOLM",
    "ticker": "LAGR B.ST",
    "weburl": "https://www.lagercrantz.com/"
}