{
    "address": "Lammengatan 2",
    "city": "Lammhult",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7282C102",
    "description": "Lammhults Design Group AB designs, manufactures, and markets furniture for home, office, and public buildings. The company is headquartered in Lammhult, Kronoberg and currently employs 309 full-time employees.  The firm operates within three divisions: Office & Home Interiors, Public Interiors and Scandinavian Eyewear. Office & Home Interiors division operates under such brand names, as Lammhults, Abstracta, Borks, Ire and Voice. The area offers barstool and stools, benches and modular seating, sofas and tables, among others. Public Interiors division operates two areas: Project, which offers such brands, as BCI and Schulz Speyer, and After market, offering consumable and exchangeable products through the Eurobib Direct brand. The area offers shelving systems, lighting, displays and counter systems, among others. Scandinavian Eyewear division develops and markets spectacle frames under such brand names, as Skaga, Birka and Cirkus, among others. In September 2013, the Company acquired 100% of shares in Fora Form AS, a Norwegian furniture design company.",
    "employeeTotal": "309.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Office Services & Supplies",
    "ipo": "1989-06-09",
    "isin": "SE0000386138",
    "logo": "https://finnhub.io/api/logo?symbol=LAMM B.ST",
    "marketCapitalization": 315.0707,
    "naics": "Office Furniture (including Fixtures) Manufacturing",
    "naicsNationalIndustry": "Wood Office Furniture Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Furniture and Related Product Manufacturing",
    "name": "Lammhults Design Group AB",
    "phone": "",
    "sedol": "5269204",
    "shareOutstanding": 8.448104,
    "state": "KRONOBERG",
    "ticker": "LAMM B.ST",
    "weburl": "https://lammhultsdesigngroup.com/"
}