{
    "address": "J A Wettergrens Gata 7, Box 336",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Investment AB Latour operates as an investment company, which operates in two business lines: the wholly owned industrial operations and a portfolio with listed holdings. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 7,090 full-time employees.  Its operations are divided into two business lines. One is made up of the wholly owned industrial and trading operations and the other is a portfolio with listed holdings. Its industrial and trading operations are organized into four business areas: Hultafors Group, Latour Industries, Specma Group and Swegon. The firm's investment portfolio comprises Assa Abloy, Fagerhult, HMS Networks, Loomis, Nederman, Nobia, Securitas, Sweco and Tomra. The Company’s operations are run by its two wholly owned subsidiaries, Nordiska Industri AB and Latour-Gruppen AB, trading with shares and securities is handled by the Karpalunds Angbryggeri AB, while administration of securities is managed by the wholly owned subsidiary, Saki Forvaltning AB.",
    "employeeTotal": "7090.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Industrial Conglomerates",
    "ggroup": "Capital Goods",
    "gind": "Industrial Conglomerates",
    "gsector": "Industrials",
    "gsubind": "Industrial Conglomerates",
    "ipo": "1991-11-01",
    "isin": "SE0010100958",
    "logo": "https://finnhub.io/api/logo?symbol=LATO B.ST",
    "marketCapitalization": 195131.5,
    "naics": "Communications Equipment Manufacturing",
    "naicsNationalIndustry": "Other Communications Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Investment AB Latour",
    "phone": "4631891790.0",
    "sedol": "BZ404X1",
    "shareOutstanding": 639.3795,
    "state": "VASTRA GOTALANDS",
    "ticker": "LATO B.ST",
    "weburl": "http://www.latour.se/"
}