{
    "address": "Jarnvagsgatan 41",
    "city": "Bastad",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Lindab International AB engages in the development, manufacture, and distribution of products and system solutions in steel for construction and indoor climate. The company is headquartered in Bastad, Skane and currently employs 5,098 full-time employees. The company went IPO on 2006-12-01. The Company’s activities are divided into three business areas: Ventilation, which offers duct systems with accessories, as well as solutions for ventilation, heating and cooling for a controlled indoor climate; Building Components, providing steel products and systems for roof drainage, roof and wall cladding, as well as steel profiles for walls, roof and beam constructions; and Building Systems, which supplies pre-engineered steel building systems and a information technology (IT) software, which enables the project planning and quotation process for designers and contractors. Furthermore, the Company operates worldwide through a number of subsidiaries in Sweden, the Czech Republic, Denmark, Russia, the United Kingdom, Luxembourg, Poland, Hungary, Germany, and Switzerland, among others.",
    "employeeTotal": "5098.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Building",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "ipo": "2006-12-01",
    "isin": "SE0001852419",
    "logo": "https://finnhub.io/api/logo?symbol=LIAB.ST",
    "marketCapitalization": 16565.38,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Lindab International AB",
    "phone": "4643185000.0",
    "sedol": "B1HP071",
    "shareOutstanding": 76.356982,
    "state": "SKANE",
    "ticker": "LIAB.ST",
    "weburl": "https://www.lindabgroup.com"
}