{
    "address": "Drottninggatan 82, plan 4",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5S50Y116",
    "description": "Loomis AB engages in the provision of cash handling solutions. The company is headquartered in Stockholm, Stockholm and currently employs 22,200 full-time employees. The company went IPO on 2008-12-09. Its offerings include Cash in Transit services, encompassing cash transportation services mainly used by banks and business enterprises carried out by a fleet of vehicles transporting cash to and from retailers, banks, safe deposit boxes and automated teller machines, and Cash Management services, such as counting, analysis, planning, reporting and authenticity and quality control of bills and coins. The firm has over 200 cash processing centers. The company operates through a network of 400 branches located across numerous countries, including Argentina, Austria, the Czech Republic, Denmark, Finland, France, Norway, Portugal, Slovenia, Slovakia, Spain, Switzerland, Turkey, the United Kingdom, and the United States. The company operates VIA MAT Holding AG and Intermarketing Oy as subsidiaries.",
    "employeeTotal": "22200.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Security & Alarm Services",
    "ipo": "2008-12-09",
    "isin": "SE0014504817",
    "logo": "https://finnhub.io/api/logo?symbol=LOOMIS.ST",
    "marketCapitalization": 20701.95,
    "naics": "Investigation and Security Services",
    "naicsNationalIndustry": "Armored Car Services",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "Loomis AB",
    "phone": "46852292000.0",
    "sedol": "BMVB566",
    "shareOutstanding": 78.654552,
    "state": "STOCKHOLM",
    "ticker": "LOOMIS.ST",
    "weburl": "https://www.loomis.com/"
}