{
    "address": "Malminrinne 1 B",
    "city": "Helsinki",
    "country": "FI",
    "currency": "EUR",
    "cusip": "X1424P112",
    "description": "Loudspring Oyj engages in economic activities related to resource efficiency and related creation of services and content, administration and development tasks, and consulting. The company is headquartered in Helsinki, Etela-Suomen and currently employs 4 full-time employees. The company went IPO on 2014-06-12. The company is focused on the clean technology sector and invests in the companies located in the Nordic and Baltic region. Its investment strategy targets growth companies, with products or services which solve customer problems, scalable business model and experienced management teams. Additionally, it includes the participation in the development of portfolio companies. Loudspring Oyj is also engaged in applying for grants and contacting possible future investors, as well as in the search of partners, customers, suppliers and personnel, among others. Its investment portfolio includes: Nuuka Solutions Oy, providing energy management systems for real estate; Oricane AB, engaged in the development of technology for energy efficient usage of Internet and hardware; Savo-Solar Oy, developing solar thermal collectors, among others.",
    "employeeTotal": "4.0",
    "exchange": "NASDAQ OMX HELSINKI LTD.",
    "finnhubIndustry": "Financial Services",
    "ggroup": "Diversified Financials",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Asset Management & Custody Banks",
    "ipo": "2014-06-12",
    "isin": "FI4000092523",
    "logo": "https://finnhub.io/api/logo?symbol=LOUD.HE",
    "marketCapitalization": 10.59524,
    "naics": "Other Financial Investment Activities",
    "naicsNationalIndustry": "Miscellaneous Intermediation",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Loudspring Plc",
    "phone": "358505810583.0",
    "sedol": "BMH0CT9",
    "shareOutstanding": 43.616991,
    "state": "ETELA-SUOMEN",
    "ticker": "LOUD.HE",
    "weburl": "http://loudspring.earth/"
}