{
    "address": "885 West Georgia Street",
    "city": "Vancouver",
    "country": "CA",
    "currency": "USD",
    "cusip": "54928Q108",
    "description": "Lucara Diamond Corp. engages in the production and exploration of diamond properties. The company is headquartered in Vancouver, British Columbia and currently employs 335 full-time employees. The company went IPO on 2006-02-07. The firm's business consists of the acquisition, exploration, development and operation of diamond properties. Its segments include Karowe Mine, and Corporate and other. The firm holds a 100% interest in the Karowe Mine and three prospecting licenses located in Botswana. The Karowe Mine is located in north-central Botswana and is part of the Orapa/Letlhakane Kimberlite district. The kimberlite at the Karowe Mine (the AK6 Kimberlite) consists of three distinct intrusions, which form a contiguous tri-lobate kimberlite pipe. The Karowe Mine is the mine developed from the Company's AK6 Project. The firm holds interest in two precious stone prospecting licenses (PL367/2014 and PL371/2014), which host kimberlites, BK02, AK11 and AK12, AK13 and AK14. The prospecting licenses are located within a distance of 15 kilometer and 30 kilometer from the Karowe mine.",
    "employeeTotal": "335.0",
    "exchange": "TORONTO STOCK EXCHANGE",
    "finnhubIndustry": "Metals & Mining",
    "ggroup": "Materials",
    "gind": "Metals & Mining",
    "gsector": "Materials",
    "gsubind": "Precious Metals & Minerals",
    "ipo": "2006-02-07",
    "isin": "CA54928Q1081",
    "logo": "https://finnhub.io/api/logo?symbol=LUC.TO",
    "marketCapitalization": 297.7488,
    "naics": "Nonmetallic Mineral Mining and Quarrying",
    "naicsNationalIndustry": "All Other Nonmetallic Mineral Mining",
    "naicsSector": "Mining",
    "naicsSubsector": "Mining (except Oil and Gas)",
    "name": "Lucara Diamond Corp",
    "phone": "16046897842.0",
    "sedol": "2862565",
    "shareOutstanding": 397.12534,
    "state": "BRITISH COLUMBIA",
    "ticker": "LUC.TO",
    "weburl": "https://www.lucaradiamond.com/"
}