{
    "address": "885 Georgia St W Suite 2000",
    "city": "Vancouver",
    "country": "CA",
    "currency": "USD",
    "cusip": "550371108",
    "description": "Lundin Gold, Inc. is a natural resource mining company, which engages in the acquisition, exploration, and development of gold, base, and precious metal properties. The company is headquartered in Vancouver, British Columbia and currently employs 1,266 full-time employees. The company went IPO on 2001-08-20. The firm owns the Fruta del Norte gold mine and approximately 30 metallic mineral concessions, totaling approximately 64,500 hectares. The Fruta del Norte Project is comprised of approximately seven concessions covering an area of approximately 5,566 hectares and is located approximately 140 kilometeres eastnortheast of the City of Loja in southeastern Ecuador. The Fruta del Norte deposit is an intermediate sulphidation epithermal gold-silver deposit. The Fruta del Norte's mineralogy consists of chalcedonic to crystalline quartz, manganese carbonates, calcite, adularia, barite, marcasite, and pyrite, as well as subordinate sphalerite, galena, chalcopyrite, traces of tetrahedrite and silver sulphosalts. The firm produces gold in the form of concentrate and dore bars. Its subsidiaries include Aurelian Ecuador S.A., Condor Finance Corp., Ecoaurelian Agricola S.A, Aurelianmenor S.A. and Surnorte S.A.",
    "employeeTotal": "1266.0",
    "exchange": "TORONTO STOCK EXCHANGE",
    "finnhubIndustry": "Metals & Mining",
    "ggroup": "Materials",
    "gind": "Metals & Mining",
    "gsector": "Materials",
    "gsubind": "Gold",
    "ipo": "2001-08-20",
    "isin": "CA5503711080",
    "logo": "https://finnhub.io/api/logo?symbol=LUG.TO",
    "marketCapitalization": 2431.586,
    "naics": "Metal Ore Mining",
    "naicsNationalIndustry": "Gold Ore Mining",
    "naicsSector": "Mining",
    "naicsSubsector": "Mining (except Oil and Gas)",
    "name": "Lundin Gold Inc",
    "phone": "16046897842.0",
    "sedol": "BTKSSY6",
    "shareOutstanding": 232.539576,
    "state": "BRITISH COLUMBIA",
    "ticker": "LUG.TO",
    "weburl": "https://www.lundingold.com/"
}