{
    "address": "Kolonnvagen 2",
    "city": "Gavle",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W3474E196",
    "description": "Mackmyra Svensk Whisky AB engages in the production and sale of whisky. The company is headquartered in Gavle, Gavleborg and currently employs 57 full-time employees. The company went IPO on 2011-12-16. The firm is principally engaged in the production of whisky. Its products include Mackmyra Brukswhisky, Mackmyra Whisky-Den Forsta Utgavan, Mackmyra Moment and Mackmyra Special, among others. As of March 2013, the Company's distilling activities take place in the new facility within Mackmyra Whiskyby (Mackmyra Whisky Village). The firm also offers such services, as Mackmyra Gravity and Mackmyra Reserve, which enable the customers to follow the production of their personal 30-liter whisky barrels, as well as Mackmyraresan and Svenska Whiskyupplevelser, which offer the visits to the Company’s facilities, among others. The firm sells its products in Systembolaget shops, taverns and restaurants, as well as in the duty-free zones and through selected whisky traders in Europe. During quarter one, 2013, the Candaian LCBO has chosen to bring the Company's The First Edition whiskey into its permanent assortment.",
    "employeeTotal": "57.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Beverages",
    "ggroup": "Food, Beverage & Tobacco",
    "gind": "Beverages",
    "gsector": "Consumer Staples",
    "gsubind": "Distillers & Vintners",
    "ipo": "2011-12-16",
    "isin": "SE0000731747",
    "logo": "https://finnhub.io/api/logo?symbol=MACK B.ST",
    "marketCapitalization": 167.3174,
    "naics": "Beverage Manufacturing",
    "naicsNationalIndustry": "Distilleries",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Beverage and Tobacco Product Manufacturing",
    "name": "Mackmyra Svensk Whisky AB",
    "phone": "4626541880.0",
    "sedol": "B0401S0",
    "shareOutstanding": 20.768912,
    "state": "GAVLEBORG",
    "ticker": "MACK B.ST",
    "weburl": "http://www.mackmyra.com"
}