{
    "address": "Munkgatan 7 4Tr",
    "city": "Vasteras",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5651J104",
    "description": "Modern Ekonomi Sverige Holding AB engages in the accounting and financial administration solutions. The company is headquartered in Vasteras, Vastmanland and currently employs 48 full-time employees. The company went IPO on 2006-11-13. The company produces, owns and manages magazines, Web magazines and newsletters in Sweden and Denmark. Its product portfolio principally comprises two areas: Mobile and Photo. Its products include such magazines as Mobil, Allt om Android, iPhonetidningen, Kamera & Bild and Mobil Business, as well as such Web magazines as Mobil.se, Kamerabild.se, Fotoguiden.se, and others. The firm also organizes events such as Mobilgalan, a Scandinavian gala within the mobile sector, and Mobil Business, cyclical seminars and conferences for the mobile sector. The company also runs Web television. The firm has three wholly owned subsidiaries, namely Modern Kommunikation Forlag pa Liljeholmen AB (MKF), MKF Danmark Aps and Mediaprovider A/S. In October 2013, with the approval of the District Court of Stockholm, the Company concluded the reconstruction. In January 2014, it acquired Modern Ekonomi Sverige AB.",
    "employeeTotal": "48.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Professional Services",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Professional Services",
    "gsector": "Industrials",
    "gsubind": "Research & Consulting Services",
    "ipo": "2006-11-13",
    "isin": "SE0005991601",
    "logo": "https://finnhub.io/api/logo?symbol=ME.ST",
    "marketCapitalization": 87.16665,
    "naics": "Newspaper, Periodical, Book, and Directory Publishers",
    "naicsNationalIndustry": "Periodical Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "Modern Ekonomi Sverige Holding AB (publ)",
    "phone": "",
    "sedol": "BMNQP92",
    "shareOutstanding": 14.774008,
    "state": "VASTMANLAND",
    "ticker": "ME.ST",
    "weburl": "https://www.modernekonomi.se/"
}