{
    "address": "Vastra Bangatan 54, Box 144",
    "city": "KUMLA",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5528B102",
    "description": "Malmbergs Elektriska AB engages in the distribution and wholesale of electrical products and components. The company is headquartered in Kumla, Orebro and currently employs 170 full-time employees.  The company is engaged in the import, agency and wholesale distribution of electrical components and products to dealers, contractors, wholesalers and industrial companies. Its offering includes such electrical components and products, as energy meters, motors and motor components, starters and starter switches, lighting products, installation materials, wires, heating and ventilation appliances, tools and other products. As of December 31, 2011, the Company had representatives in 20 locations in six countries and was active through such wholly owned subsidiaries, as Malmbergs Elektriske AS, Malmbergs Elektriske A/S, Malmberg-Elektro Oy, Malmbergs UK Ltd, Malbergs Asia Electric Ltd Hongkong, Bygg-Strom i Sverige AB and Proel Proffs AB.",
    "employeeTotal": "170.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Trading Companies & Distributors",
    "ggroup": "Capital Goods",
    "gind": "Trading Companies & Distributors",
    "gsector": "Industrials",
    "gsubind": "Trading Companies & Distributors",
    "ipo": "1999-03-12",
    "isin": "SE0000507659",
    "logo": "https://finnhub.io/api/logo?symbol=MEAB B.ST",
    "marketCapitalization": 476.64,
    "naics": "Electrical and Electronic Goods Merchant Wholesalers",
    "naicsNationalIndustry": "Electrical Apparatus and Equipment, Wiring Supplies, and Related Equipment Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Durable Goods",
    "name": "Malmbergs Elektriska AB (publ)",
    "phone": "4619587700.0",
    "sedol": "B1WP667",
    "shareOutstanding": 8,
    "state": "OREBRO",
    "ticker": "MEAB B.ST",
    "weburl": "https://www.malmbergs.com/"
}