{
    "address": "Solnavagen 4, Floor 11, Box 19542",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5615X116",
    "description": "Mekonomen AB is a car service chain company, which manufactures and distributes automotive spare parts, as well as provides workshop services. The company is headquartered in Stockholm, Stockholm and currently employs 4,958 full-time employees. The company went IPO on 2000-05-29. The company is also engaged in wholesale. The company serves as a holding company of Mekonomen Group, comprising MECA Scandinavia (MECA), Mekonomen Norden and Sorensen og Balchen. MECA sells spare parts and workshop equipment on a business-to-business (B2B) basis, to automotive workshops in Sweden, Norway and Denmark. The offering includes accessories, tools, tires and diagnostic equipment. Mekonomen Norden operates in Sweden, Norway and Finland under Mekonomen brand, providing parts and accessories, warehouse operations and marine products. Sorensen og Balchen is a Norwegian retailer of spare parts and accessories, which operates BilXtra brand. The firm operates through more than 400 owned and associated stores, and over 2,000 service centers and affiliated workshops. In November 2013, it established a purchasing company in Hong Kong, as a part of cooperation agreement with Inter Cars.",
    "employeeTotal": "4958.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Retail",
    "ggroup": "Retailing",
    "gind": "Specialty Retail",
    "gsector": "Consumer Discretionary",
    "gsubind": "Automotive Retail",
    "ipo": "2000-05-29",
    "isin": "SE0002110064",
    "logo": "",
    "marketCapitalization": 8304.526,
    "naics": "Automotive Parts, Accessories, and Tire Stores",
    "naicsNationalIndustry": "Automotive Parts and Accessories Stores",
    "naicsSector": "Retail Trade",
    "naicsSubsector": "Motor Vehicle and Parts Dealers",
    "name": "Mekonomen AB",
    "phone": "4684640000.0",
    "sedol": "B23PWD2",
    "shareOutstanding": 56.323372,
    "state": "STOCKHOLM",
    "ticker": "MEKO.ST",
    "weburl": "https://www.mekonomen.com/"
}