{
    "address": "Gustavslundsvagen 42, 5 tr.",
    "city": "Bromma",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5658C151",
    "description": "Moberg Pharma AB is a pharmaceutical company, which engages in the development and commercialization of medical products. The company is headquartered in Bromma, Stockholm and currently employs 12 full-time employees. The company went IPO on 2011-05-26. Its product portfolio includes products for the treatment of skin diseases and pain, such as Emtrix/Nalox, for the treatment of nails damaged by fungus or psoriasis; Kerasal, for dry and damaged feet, and Kaprolac, a range of products for several types of skin and scalp problems. Additionally, the Company has two projects in phase II of development, namely MOB-15, for the treatment of nail fungus, and Limtop, for the treatment of actinic keratosis, basalioma and genital warts. The firm collaborates with Meda AB, Menarini Group, Perrigo Company, OzHealth Pharma and Zelmic AB, among others. The company is active in more than 35 countries, and operates, among others, through Alterna LLC. The company also owns three Over-The-Counter (OTC) brands in the United States.",
    "employeeTotal": "12.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2011-05-26",
    "isin": "SE0013121340",
    "logo": "https://finnhub.io/api/logo?symbol=MOB.ST",
    "marketCapitalization": 256.0122,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Medicinal and Botanical Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Moberg Pharma AB (publ)",
    "phone": "46852230700.0",
    "sedol": "BK26FD3",
    "shareOutstanding": 44.046679,
    "state": "STOCKHOLM",
    "ticker": "MOB.ST",
    "weburl": "http://www.mobergpharma.se/"
}