{
    "address": "Tradgardsgatan 2",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9731A109",
    "description": "Moment Group AB engages in the production and management of events and entertainment. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 150 full-time employees. The company went IPO on 2000-06-28. Its activities comprise theatrical events, musicals, shows, concerts, dinner shows, artist’s bookings, as well as corporate entertainment, meetings and events. The firm operates in three segments: Live Entertainment, Meetings and E-Commerce. The Live Entertainment segment refers to theatrical performances, shows and specially commissioned entertainment. The Meetings segment comprises operations of subsidiary Hansen Event & Conference AB, which conducts its activities worldwide. The E-Commerce segment implies operations of Showtic.se brand, where customers buy tickets for events organized by the Company, as well as by the other market actors. The Company’s portfolio also includes such brands, as 2Entertain, 2E Live, Golden Hits, Ladies Night, Nordic Light Agency and Wallmans.",
    "employeeTotal": "150.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Media",
    "ggroup": "Media & Entertainment",
    "gind": "Entertainment",
    "gsector": "Communication Services",
    "gsubind": "Movies & Entertainment",
    "ipo": "2000-06-28",
    "isin": "SE0000680902",
    "logo": "",
    "marketCapitalization": 407.5703,
    "naics": "Performing Arts Companies",
    "naicsNationalIndustry": "Theater Companies and Dinner Theaters",
    "naicsSector": "Arts, Entertainment, and Recreation",
    "naicsSubsector": "Performing Arts, Spectator Sports, and Related Industries",
    "name": "Moment Group AB",
    "phone": "",
    "sedol": "B011WP0",
    "shareOutstanding": 32.401689,
    "state": "VASTRA GOTALANDS",
    "ticker": "MOMENT.ST",
    "weburl": "http://www.momentgroup.com/"
}