{
    "address": "Hornsbruksgatan 28",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W56339109",
    "description": "Micro Systemation AB engages in the development of forensic technology for mobile device examination. The company is headquartered in Stockholm, Stockholm and currently employs 188 full-time employees. The company went IPO on 2000-06-26. The firm provides a software application, named XRY, which enables investigators to retrieve data, such as pictures, Short Message Services (SMS), call history, contact lists and applications, from a range of mobile devices, including smartphones, portable music players, Global Positioning System (GPS) navigation devices, as well as tablet processors. Its product portfolio comprises XRY Complete, XRY Logical, XRY Physical, and XRY Field Version, among others. Furthermore, It offers XAMN, an analytical tool, designed for visualizing mobile device forensic files. The firm cooperates with a number of entities, such as Contego Solutions, EMT Electronics Ltd, Fulcrum Asia, MC Systems and DataExpert. The company is a parent of Micro Systemation Ltd, MSAB Incorporated, and Micro Systemation HK Ltd, among others.",
    "employeeTotal": "188.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Systems Software",
    "ipo": "2000-06-26",
    "isin": "SE0000526626",
    "logo": "https://finnhub.io/api/logo?symbol=MSAB B.ST",
    "marketCapitalization": 919.62,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "Micro Systemation AB (publ)",
    "phone": "4687390270.0",
    "sedol": "5808641",
    "shareOutstanding": 18.468404,
    "state": "STOCKHOLM",
    "ticker": "MSAB B.ST",
    "weburl": "https://www.msab.com/"
}