{
    "address": "Box 3141",
    "city": "Taby",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Mycronic AB engages in the development, manufacture, and sale of production equipment for electronics and display manufacturing. The company is headquartered in Taby, Stockholm and currently employs 1,535 full-time employees. The company went IPO on 2000-03-09. The Company’s operations are divided into two segments. The Assembly Solutions segment develops, manufactures and markets advanced surface mount equipment for flexible electronics production. The equipment is used for stencil-free jetting of solder paste on printed circuit boards (PCBs) and surface mounting of electronic components on PCBs. The Pattern Generators business area is subdivided into mask writers and direct writers, and develops, manufactures and markets a range of laser pattern generators for the production of photomasks and electronic products. The systems are used by electronics companies in the manufacture of displays and semiconductors. The company also develops Camera Module Assembly and Test (CMAT) systems, mainly for automotive industry. The company operates in France, Singapore, the United Kingdom, Germany and the United States, among others.",
    "employeeTotal": "1535.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "2000-03-09",
    "isin": "SE0000375115",
    "logo": "",
    "marketCapitalization": 26868.29,
    "naics": "Industrial Machinery Manufacturing",
    "naicsNationalIndustry": "Semiconductor Machinery Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Mycronic AB (publ)",
    "phone": "4686385200.0",
    "sedol": "5262849",
    "shareOutstanding": 97.672,
    "state": "STOCKHOLM",
    "ticker": "MYCR.ST",
    "weburl": "https://www.mycronic.com/"
}