{
    "address": "Smidesvagen 7",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W57102118",
    "description": "Net Insight AB engages in media network, resource optimization, and streaming solutions. The company is headquartered in Solna, Stockholm and currently employs 153 full-time employees.  The firm develops, commercializes and sells routing solutions for the transfer of video, voice and data under the brand name Nimbra. Its activities are divided into four business areas: Broadcast and Media Networks (BMN), offering network solutions for the production and contribution of media services; Digital Terrestrial Television (DTT), providing the distribution of television (TV) programs from a central location (headend) to transmission towers within region; Cable TV & Internet Protocol Television (CATV/IPTV), which distributes TV, video, broadband and telephony to households; and Over the Top (OTT), offering video over the Internet solutions. Its customers include broadcasters, media companies, telecom and satellite operators, as well as cable TV/IPTV providers. Net Insight AB operates in Europe, the Middle East and Africa (EMEA), Asia and Pacific (APAC) and the Americas.",
    "employeeTotal": "153.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Communications",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Communications Equipment",
    "gsector": "Information Technology",
    "gsubind": "Communications Equipment",
    "ipo": "1999-06-07",
    "isin": "SE0000366098",
    "logo": "https://finnhub.io/api/logo?symbol=NETI B.ST",
    "marketCapitalization": 1118.182,
    "naics": "Communications Equipment Manufacturing",
    "naicsNationalIndustry": "Radio and Television Broadcasting and Wireless Communications Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Net Insight AB",
    "phone": "4686850400.0",
    "sedol": "5967683",
    "shareOutstanding": 382.758009,
    "state": "STOCKHOLM",
    "ticker": "NETI B.ST",
    "weburl": "https://www.netinsight.net/"
}