{
    "address": "Kungsportsavenyen 10",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "New Wave Group AB engages in the design, acquisition and development of brands and products. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 2,035 full-time employees.  The Company’s activities are divided into three business areas: Corporate Promo, Sports & Leisure and Gifts & Home Furnishings. The Corporate Promo area is divided into three subdivisions: Promowear, offering clothes adapted for printing and embroidery; Promotional Gifts, which promotes and markets a brand through pens, bags, and towels, among others; and Workwear, providing clothing for processionals, such as construction and installation workers, waiters and carriers. The Sports & Leisure area operates a range of sport brands, named AHEAD, ANNIKA, Craft, and Skona Marie, among others. The Gifts & Home Furnishings area includes glass and metal home decorations, cutlery, as well as textile goods. Furthermore, the Company operates worldwide through a number of subsidiaries, such as DJ Frantextile AB, GC Sportswear Oy, Jobman Workwear AB, New Wave France SAS and Texet AB.",
    "employeeTotal": "2035.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Textiles, Apparel & Luxury Goods",
    "ggroup": "Consumer Durables & Apparel",
    "gind": "Textiles, Apparel & Luxury Goods",
    "gsector": "Consumer Discretionary",
    "gsubind": "Apparel, Accessories & Luxury Goods",
    "ipo": "1997-12-11",
    "isin": "SE0000426546",
    "logo": "",
    "marketCapitalization": 5381.779,
    "naics": "Cut and Sew Apparel Manufacturing",
    "naicsNationalIndustry": "Men's and Boys' Cut and Sew Work Clothing Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Apparel Manufacturing",
    "name": "New Wave Group AB",
    "phone": "46317128900.0",
    "sedol": "B0FLGQ5",
    "shareOutstanding": 66.343543,
    "state": "VASTRA GOTALANDS",
    "ticker": "NEWA B.ST",
    "weburl": "https://www.nwg.se/"
}