{
    "address": "Industrigatan 27, Box 165",
    "city": "Lomma",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5711M113",
    "description": "Nexam Chemical Holding AB engages in the development, manufacturing, and marketing of solutions for the performance of polymers. The company is headquartered in Lomma, Skane and currently employs 46 full-time employees. The company went IPO on 2013-04-23. The company develops technology and products that improve properties and performance of plastics, without changing the production technology of its customers. Nexam’s operations are based on crosslinking, a heat-activated technology of linking multiple polymer chains by small molecules called crosslinkers. Its main products are additive closslinkers, Neximid and Nexamite, manufactured at production plant in Scotland, which are transported to plastic manufacturers to be added during the production process. Neximid series improves properties of polyimides and Nexamite crosslinkers are designed for other thermoplastics. Nexam’s solutions serve electronics, aerospace, and pharmaceutical industries, among others. The firm is the parent entity of Nexam Chemical AB and its subsidiary, Nexam St. Andrews Ltd. Also, it operates masterbatch manufacturer Plasticolor Sweden AB as subsidiary.",
    "employeeTotal": "46.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Chemicals",
    "ggroup": "Materials",
    "gind": "Chemicals",
    "gsector": "Materials",
    "gsubind": "Commodity Chemicals",
    "ipo": "2013-04-23",
    "isin": "SE0005101003",
    "logo": "https://finnhub.io/api/logo?symbol=NEXAM.ST",
    "marketCapitalization": 1084.921,
    "naics": "Resin, Synthetic Rubber, and Artificial Synthetic Fibers and Filaments Manufacturing",
    "naicsNationalIndustry": "Plastics Material and Resin Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Nexam Chemical Holding AB",
    "phone": "4640413620.0",
    "sedol": "B9M1S43",
    "shareOutstanding": 78.903367,
    "state": "SKANE",
    "ticker": "NEXAM.ST",
    "weburl": "http://www.nexam.se"
}