{
    "address": "Kungsgatan 12",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6S958118",
    "description": "NGS Group AB engages in the provision of human capital sourcing services. The company is headquartered in Stockholm, Stockholm and currently employs 389 full-time employees. The company went IPO on 2002-03-25. The firm operates within three business sectors, namely School Replacement, Psychiatric and First Med. The School Replacement area offers temporary employment services to pre-schools, primary schools and secondary schools, and employs teachers, nannies, student assistants, cooks and kitchen assistants for both short and long term. The Psychiatric sector is engaged in the leasing of doctors and nurses to psychiatric clinics. The First Med sector is engaged in the leasing of nurses to municipalities and private health care operators, and employs specialists within such areas, as emergency care, geriatrics, primary care and healthcare administration. The firm operates through numerous subsidiaries, among others, Hemmafronten AB, Stjarnpoolen AB, Nurse Partner Scandinavia AB and Human Capital Group HCG AB.",
    "employeeTotal": "389.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Providers & Services",
    "gsector": "Health Care",
    "gsubind": "Health Care  Services",
    "ipo": "2002-03-25",
    "isin": "SE0009947708",
    "logo": "",
    "marketCapitalization": 197.6008,
    "naics": "Employment Services",
    "naicsNationalIndustry": "Employment Placement Agencies",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "NGS Group AB",
    "phone": "46850580830.0",
    "sedol": "BYPBSV2",
    "shareOutstanding": 9.022868,
    "state": "STOCKHOLM",
    "ticker": "NGS.ST",
    "weburl": "http://www.ngsgroup.se"
}