{
    "address": "Hannabadsvagen 5",
    "city": "Markaryd",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6S38Z126",
    "description": "Nibe Industrier AB is a SE-based company operating in Building Products industry. The company is headquartered in Markaryd, Kronoberg and currently employs 18,700 full-time employees.  Nibe Industrier AB is a Sweden-based company engaged in the provision of heating technology solutions. Its operations are organized into three business areas: NIBE Element, which is engaged in the manufacturing of electric heating elements that are used in white goods and industry commercial equipment, as well as heating, control and measurement components and systems of ASKOMA AG, comprises also HT S.p.A.; NIBE Energy Systems, focusing on heat pumps and electric water heaters for private homes and larger premises, and NIBE Stoves, specializing within wood-burning stoves for private homeowners in the new and existing housing market and in the holiday homes sector. Its brands include Contura, Premodul, Nordpeis, Lotus Heating Sustems and TermaTech, among others. The firm is also engaged in the field of heat pumps via Enertech Global Llc, in the area of ventilations systems through the partially owned subsidiary Air Site AB, and with regard to heating solutions through Hotwatt Inc.",
    "employeeTotal": "18700.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Building",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "ipo": "1997-06-16",
    "isin": "SE0015988019",
    "logo": "https://finnhub.io/api/logo?symbol=NIBE B.ST",
    "marketCapitalization": 161070.5,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Heating Equipment (except Warm Air Furnaces) Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Nibe Industrier AB",
    "phone": "4643373000.0",
    "sedol": "BN7BZM3",
    "shareOutstanding": 1841.218718,
    "state": "KRONOBERG",
    "ticker": "NIBE B.ST",
    "weburl": "https://www.nibe.com/"
}