{
    "address": "Narvavagen 12",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5711K109",
    "description": "NetJobs Group AB engages in the provision of specialized and general career websites. The company is headquartered in Stockholm, Stockholm and currently employs 47 full-time employees. The company went IPO on 2006-10-12. The firm operates in the Northern Europe market. The company owns 40 job Websites, out of which five are broad and general, and 35 are niche and specialized, including halsojobb.se, okonomijobb.no, taloustyot.fi, okonomijobs.de and krankenschwesterjobs.de, among others. Broad Websites offer a range job offers in different professions and industries. Niche Websites offer job offers in the selected professional segments. Additionally, the Company offers complementary products, such as banners and company presentations. Its customers operate mainly within the private sector, but also include municipalities and government authorities, as well as recruitment companies. The firm is active in Sweden, Norway, Denmark, Germany and Finland. As of December 31, 2011, the Company had one wholly owned subsidiary, NetJobs Germany GmbH.",
    "employeeTotal": "47.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Professional Services",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Professional Services",
    "gsector": "Industrials",
    "gsubind": "Human Resource & Employment Services",
    "ipo": "2006-10-12",
    "isin": "SE0001790346",
    "logo": "https://finnhub.io/api/logo?symbol=NJOB.ST",
    "marketCapitalization": 40.66402,
    "naics": "Employment Services",
    "naicsNationalIndustry": "Employment Placement Agencies",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "NetJobs Group AB",
    "phone": "46867874246.0",
    "sedol": "B1FSCF4",
    "shareOutstanding": 32.401612,
    "state": "STOCKHOLM",
    "ticker": "NJOB.ST",
    "weburl": "https://www.netjobs.com/"
}