{
    "address": "Sydhamnsgatan 2",
    "city": "Helsingborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5S11E100",
    "description": "Nederman Holding AB offers solutions in the field of environmental technology, which focuses on industrial air filtration and recycling. The company is headquartered in Helsingborg, Skane and currently employs 2,130 full-time employees. The company went IPO on 2007-05-16. The company provides industrial vacuum cleaners, dust and fume collectors, filters, and pre-separators, among others, for three business areas: air extraction and filtrations systems, cleaning and recycling. Also, the Company offers particulate monitors and filter control solutions. Its activities are focused on four market segments: Metal Fabrication, which includes manual and robotic welding, thermal cutting, blasting and others, as well as machining; Fiber-based industries and general industries, such as primary wood, food, chemicals and textiles, among others; Process industries and energy, including foundry, smelters and crematories; as well as Automotive aftermarket, such as vehicle repair shops and emergency stations. The company operates primarily in Sweden, Denmark, Germany, Canada, the United States, and China.",
    "employeeTotal": "2130.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Building",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "ipo": "2007-05-16",
    "isin": "SE0011204510",
    "logo": "",
    "marketCapitalization": 6730.463,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air Purification Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Nederman Holding AB",
    "phone": "4642188700.0",
    "sedol": "BFXY8F4",
    "shareOutstanding": 35.093096,
    "state": "SKANE",
    "ticker": "NMAN.ST",
    "weburl": "https://www.nederman.com/"
}