{
    "address": "Nolatovagen 32",
    "city": "",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Nolato AB is a SE-based company operating in Industrial Conglomerates industry. The company employs 7,195 full-time employees  Nolato AB is a Sweden-based company engaged in the development and manufacture of polymer product systems for customers in medical technology, pharmaceuticals, consumer electronics, telecom, automotive products, hygiene and other industrial sectors. The Company’s operations are divided into three operating segments. The Medical Solutions segment develops and manufactures complex product systems and components for medical devices, the pharmaceutical industry and diagnostics. The Integrated Solutions segments offers a wide range of technologies and expertise in a one-stop shop for areas including injection molding, casting, die-cutting, painting, decoration, assembly, testing and packaging of electronic products. The Industrial Solutionssegment develops and manufactures components and product systems for customers in the automotive industry, hygiene, packaging, gardening/ forestry, domestic appliances, furniture and other selected industrial segments. The firm operates worldwide.",
    "employeeTotal": "7195.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Industrial Conglomerates",
    "ggroup": "Capital Goods",
    "gind": "Industrial Conglomerates",
    "gsector": "Industrials",
    "gsubind": "Industrial Conglomerates",
    "ipo": "1987-01-02",
    "isin": "SE0015962477",
    "logo": "",
    "marketCapitalization": 22129.1,
    "naics": "Resin, Synthetic Rubber, and Artificial Synthetic Fibers and Filaments Manufacturing",
    "naicsNationalIndustry": "Plastics Material and Resin Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Nolato AB",
    "phone": "46431442290.0",
    "sedol": "BMXT8K3",
    "shareOutstanding": 242.60748,
    "state": "",
    "ticker": "NOLA B.ST",
    "weburl": "https://www.nolato.se/"
}