{
    "address": "Hojdrodergatan 18",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5908H109",
    "description": "Novotek AB engages in the provision of industrial, information technology, and automation solutions. The company is headquartered in Malmo, Skane and currently employs 112 full-time employees.  The firm specializes in developing products, which enable users to collect, analyze, store and manage the production processes. Its product portfolio comprises five categories: Kepware, a platform, which connects a range of devices through Object Linking and Embedding for Process Control (OPC); Plant Information, which provides systems for optimization of production processes, such as Proficy Plant Applications and Proficy Historian; Plant Execution, offering solutions for production control, including Proficy Batch Execution; Operator Interface, providing complementary tools for management, such as Proficy Pulse; and Control, supplying a range of controllers, input/output (I/O) and programming tools, such as PACSystems. Furthermore, the Company is a parent of Novotek Sverige AB, Novotek Cloud Service Solutions AB, and Novotek GmbH, among others.",
    "employeeTotal": "112.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "1999-06-30",
    "isin": "SE0000567752",
    "logo": "https://finnhub.io/api/logo?symbol=NTEK B.ST",
    "marketCapitalization": 448.63,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Custom Computer Programming Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Novotek AB",
    "phone": "4640316900.0",
    "sedol": "5717231",
    "shareOutstanding": 10.6,
    "state": "SKANE",
    "ticker": "NTEK B.ST",
    "weburl": "https://www.novotek.com"
}