{
    "address": "Elimaenkatu 9 B",
    "city": "Helsinki",
    "country": "FI",
    "currency": "EUR",
    "cusip": "X583A4257",
    "description": "Nexstim Oyj is a FI-based company operating in Health Care Equipment & Supplies industry. The company is headquartered in Helsinki, Etela-Suomen and currently employs 31 full-time employees. The company went IPO on 2014-11-14. Nexstim Oyj is a Finland-based medical technology company. The company is focused on improving rehabilitation for stroke patients through the use of noninvasive brain stimulation. Its offering comprises: a diagnostic tool for brain surgery planning, Navigated Brain Stimulation (NBS) System, which comprises navigated transcranial magnetic stimulation (nTMS) device for presurgical mapping (PSM) of the motor and speech cortices; and a device for stroke therapy called Navigated Brain Therapy (NBT) System, which focuses stimulation on targeted locations in the brain in order to enhance rehabilitation process. The NBT System targets upper limb motor disability and is under Phase III pivotal clinical trial study at rehabilitation sites in the United States. The Company’s systems are used in over 100 facilities in research, therapy and neurosurgical planning purposes. Nexstim Oyj has two subsidiaries: Nexstim Inc and Nexstim Germany GmbH.",
    "employeeTotal": "31.0",
    "exchange": "NASDAQ OMX HELSINKI LTD.",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2014-11-14",
    "isin": "FI4000506811",
    "logo": "https://finnhub.io/api/logo?symbol=NXTMH.HE",
    "marketCapitalization": 23.80456,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Nexstim Oyj",
    "phone": "35892727170.0",
    "sedol": "BP2NJX7",
    "shareOutstanding": 6.686673,
    "state": "ETELA-SUOMEN",
    "ticker": "NXTMH.HE",
    "weburl": "http://www.nexstim.com"
}