{
    "address": "Hastholmsvagen 28",
    "city": "Nacka",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6S88K102",
    "description": "Nyfosa AB engages in the management and development of commercial properties. The company is headquartered in Nacka, Stockholm and currently employs 67 full-time employees. The company went IPO on 2018-11-23. The firm's transaction-based investment strategy is not limited by property category, region, scope of the transaction or holding period. The firm focuses on commercial real estate, with the property portfolio divided into three categories: Offices, Logistics/Warehouse and Other. The properties are diversified geographically, with the office buildings mainly located in Swedish municipalities and the warehouses in transportation hubs across Sweden. The Other category includes retail premises, hotels and industrial spaces. The portfolio comprises more than 170 properties with a total leaseable area of approximately 1,500,000 square meters. The firm develops and adds value to its property holdings through active approach to property management. All of electricity supplied to its properties derives from renewable sources.",
    "employeeTotal": "67.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Real Estate",
    "ggroup": "Real Estate",
    "gind": "Real Estate Management & Development",
    "gsector": "Real Estate",
    "gsubind": "Real Estate Operating Companies",
    "ipo": "2018-11-23",
    "isin": "SE0011426428",
    "logo": "https://finnhub.io/api/logo?symbol=NYF.ST",
    "marketCapitalization": 25367.83,
    "naics": "Lessors of Real Estate",
    "naicsNationalIndustry": "Lessors of Nonresidential Buildings (except Miniwarehouses)",
    "naicsSector": "Real Estate Rental and Leasing",
    "naicsSubsector": "Real Estate",
    "name": "Nyfosa AB",
    "phone": "4684066400.0",
    "sedol": "BFD2NK8",
    "shareOutstanding": 191.022813,
    "state": "STOCKHOLM",
    "ticker": "NYF.ST",
    "weburl": "https://nyfosa.se/"
}