{
    "address": "Forradsvagen 2",
    "city": "TRANAS",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5943D212",
    "description": "OEM International AB is a SE-based company operating in Trading Companies & Distributors industry. The company is headquartered in Tranas, Jonkopings and currently employs 881 full-time employees.  OEM International AB is a Sweden-based holding company active within industrial trading. The company offers a range of industrial components and systems from various suppliers, including electrical components, flow components, motors and transmissions, bearings, seals and couplings, as well as appliance components, lighting and complete production systems. Sales are conducted under such names, as OEM Automatic, OEM Motor, OEM Electronics, Internordic Bearings, Telfa, Elektro Elco, Svenska Helag, Svenska Batteripoolen and Flexitron. The company operates three primary market regions, namely Region Sweden, Region Finland and the Baltic States, and Region Denmark, Norway, the United Kingdom and Central Eastern Europe. The firm has around 40 directly and indirectly owned subsidiaries, such as OEM Industrial Components AB, OEM Electronics AB, Cyncrona A/S, Flexitron AB, Telfa AB, Danish Scanding A/S, AB Ernst Hj Rydahl Bromsbandsfabrik and Candelux Sp. z o.o.",
    "employeeTotal": "881.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Trading Companies & Distributors",
    "ggroup": "Capital Goods",
    "gind": "Trading Companies & Distributors",
    "gsector": "Industrials",
    "gsubind": "Trading Companies & Distributors",
    "ipo": "1983-12-01",
    "isin": "SE0015810577",
    "logo": "https://finnhub.io/api/logo?symbol=OEM B.ST",
    "marketCapitalization": 7585.392,
    "naics": "Electrical and Electronic Goods Merchant Wholesalers",
    "naicsNationalIndustry": "Electrical Apparatus and Equipment, Wiring Supplies, and Related Equipment Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Durable Goods",
    "name": "OEM International AB",
    "phone": "46752424000.0",
    "sedol": "BL6KFT4",
    "shareOutstanding": 23.1075,
    "state": "JONKOPINGS",
    "ticker": "OEM B.ST",
    "weburl": "http://www.oem.se"
}