{
    "address": "Luntmakargatan 46, 7th floor",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6709H108",
    "description": "Oncopeptides AB is a pharmaceutical company focused on the development of targeted therapies for hematological diseases. The company is headquartered in Stockholm, Stockholm and currently employs 294 full-time employees. The company went IPO on 2017-02-22. The Company’s lead product candidate PEPAXTO (melphalan flufenamide, also known as melflufen) has been approved in relapsed or refractory multiple myeloma by The U.S. Food and Drug Administration. Melphalan flufenamide is the first drug originated from the Company PDC-platform and is evaluated in a clinical study program, including the ongoing phase 3 OCEAN study. Melphalan flufenamide is an anticancer peptide-drug conjugate for patients with relapsed or refractory multiple myeloma. The drug uses technology that links a peptide carrier to a cytotoxic agent, resulting in a lipophilic compound. Due to its high lipophilicity, it is distributed into the cells. Melphalan flufenamide is designed to leverage aminopeptidases, enzymes which are overexpressed in myeloma cells and cause the release of the cytotoxic agents in the cells.",
    "employeeTotal": "294.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2017-02-22",
    "isin": "SE0009414576",
    "logo": "https://finnhub.io/api/logo?symbol=ONCO.ST",
    "marketCapitalization": 5323.133,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Oncopeptides AB",
    "phone": "4686152040.0",
    "sedol": "BZBZTD4",
    "shareOutstanding": 68.084855,
    "state": "STOCKHOLM",
    "ticker": "ONCO.ST",
    "weburl": "https://www.oncopeptides.se/"
}