{
    "address": "Linjalvagen 9",
    "city": "Taby",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6S27K106",
    "description": "OrganoClick AB engages in the development, manufacture, and marketing of cellulose-based materials based on fiber chemistry. The company is headquartered in Taby, Stockholm and currently employs 54 full-time employees. The company went IPO on 2015-02-16. The company is engaged in development and marketing of environmentally friendly fiber-based materials, aimed at manufacturers of renewable, functional cellulose-based products. The company uses natural chemistry to provide fire retardancy, anti-fungal properties, increased strength and water repellency. The company is active in three business areas: Functional wood, offering textile binders and water repellent additives, and fire and rot protected wooden material, OrganoWood, free from biocides and toxic heavy metals; Performance textiles & nonwoven, including fluorocarbon-free water repellent textile treatment OrganoTex; and Fiber composites & paper products, comprising fiber molded products, such as chemical-free funeral casket, as well as paper strength and water repellent additives, among others. The company is also active in research and development in such areas as chemical engineering, bioplastics, flame retardant wood and biopolymers.",
    "employeeTotal": "54.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Chemicals",
    "ggroup": "Materials",
    "gind": "Chemicals",
    "gsector": "Materials",
    "gsubind": "Specialty Chemicals",
    "ipo": "2015-02-16",
    "isin": "SE0006510335",
    "logo": "",
    "marketCapitalization": 1209.682,
    "naics": "Resin, Synthetic Rubber, and Artificial Synthetic Fibers and Filaments Manufacturing",
    "naicsNationalIndustry": "Cellulosic Organic Fiber Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "OrganoClick AB",
    "phone": "4686740080.0",
    "sedol": "BVXLCF5",
    "shareOutstanding": 92.112789,
    "state": "STOCKHOLM",
    "ticker": "ORGC.ST",
    "weburl": "http://www.organoclick.com"
}