{
    "address": "Rapsgatan 7E",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6827A100",
    "description": "Orexo AB is engaged in the development of pharmaceuticals based on innovative drug delivery technologies. The company is headquartered in Uppsala, Uppsala and currently employs 145 full-time employees. The company went IPO on 2005-11-09. The company focuses primarily on the development of new, patented drugs by combining documented substances with technologies, and the new treatments for respiratory and inflammatory diseases. The firm has four commercialized products, several projects developed in partnership, as well as three development programs. The firm's registered products are: Abstral for the treatment of break through cancer pain, sold by ProStrakan Group plc in Europe, the United States and Canada; the sleeping pill Edluar, sold by Meda in the United States and Canada; as well as two products for the diagnosis of Helicobacter pylori which are being marketed by the subsidiary, Kibion AB. The firm operates through subsidiaries: Pharmacall AB, Noster System AB, Orexo UK, and Pharmakodex Ltd, among others. In December 2013, Kyowa Hakko Kirin Co., Ltd (KHK), with the licensed right to Abstral, commenced the launch of it in Japan.",
    "employeeTotal": "145.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2005-11-09",
    "isin": "SE0000736415",
    "logo": "",
    "marketCapitalization": 1319.698,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Orexo AB",
    "phone": "46187808800.0",
    "sedol": "B0MZGM6",
    "shareOutstanding": 35.074844,
    "state": "UPPSALA",
    "ticker": "ORX.ST",
    "weburl": "https://orexo.se/"
}