{
    "address": "Anderstorpsvagen 10",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6S046104",
    "description": "Ovzon AB engages in the provision of mobile broadband services through satellite. The company is headquartered in Solna, Stockholm and currently employs 33 full-time employees. The company went IPO on 2018-05-18. The firm offers services via satellite combining bandwidth satellite communication services with mobile terminals. Terminals are offered in two versions: Manpacks, which enable transmit throughput of 20 megabits per second (Mbps) and received reception of 60 Mbps, as well as On The Move (OTM) terminal that transmits data rates of 8 Mbps using 6 inches antennas (13 Mbps with 9 inches). The Company’s services and technologies are applicable for providing secure broadband satellite communication in remote and dynamic coverage areas, for high-resolution live broadcasts and for secure, broadband communication for drones. Ovzon AB (publ) reports segment’s division that is based on the customer types and is divided into: Government, Media, NGO and Others. The firm operates in Sweden and the United States.",
    "employeeTotal": "33.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Telecommunication",
    "ggroup": "Telecommunication Services",
    "gind": "Diversified Telecommunication Services",
    "gsector": "Communication Services",
    "gsubind": "Alternative Carriers",
    "ipo": "2018-05-18",
    "isin": "SE0010948711",
    "logo": "https://finnhub.io/api/logo?symbol=OVZON.ST",
    "marketCapitalization": 2825.551,
    "naics": "Communications Equipment Manufacturing",
    "naicsNationalIndustry": "Radio and Television Broadcasting and Wireless Communications Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Ovzon AB (publ)",
    "phone": "46850860060.0",
    "sedol": "BD21M27",
    "shareOutstanding": 46.244688,
    "state": "STOCKHOLM",
    "ticker": "OVZON.ST",
    "weburl": "https://www.ovzon.com/"
}