{
    "address": "Bronasgatan 6",
    "city": "Ulricehamn",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6710D187",
    "description": "Precomp Solutions AB engages in the manufacturing and sale of precision components to the automotive and manufacturing industries. The company is headquartered in Ulricehamn, Vastra Gotalands and currently employs 117 full-time employees. The company went IPO on 2007-08-29. The company specializes in fine blanking. The Company’s operations are structured into two divisions, Precomp Solutions Technology and Precomp Solutions Production. The Company’s offer comprises technical consultancy and manufacturing of precision components, including delivery of production methods and cutting tools. The Company’s clients principally encompass European automobile manufacturers and suppliers to the European automobile industry. Its operations are mainly conducted in Ulricehamn, Sweden, and Sofia, Bulgaria. The firm has also a project and sales office in Mainz, Germany. As of December 31, 2011, it had one wholly owned subsidiary, Precomp Solutions EAD. As of December 31, 2011, its largest shareholder was Precomp Holding AB (60.3%).",
    "employeeTotal": "117.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "2007-08-29",
    "isin": "SE0006091724",
    "logo": "",
    "marketCapitalization": 84.1411,
    "naics": "Other Fabricated Metal Product Manufacturing",
    "naicsNationalIndustry": "Other Metal Valve and Pipe Fitting Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Fabricated Metal Product Manufacturing",
    "name": "Precomp Solutions AB (publ)",
    "phone": "46321530800.0",
    "sedol": "BP268D9",
    "shareOutstanding": 23.709956,
    "state": "VASTRA GOTALANDS",
    "ticker": "PCOM B.ST",
    "weburl": "http://precomp.se/"
}