{
    "address": "235 E 42ND ST",
    "city": "New York City",
    "country": "US",
    "currency": "USD",
    "cusip": "717081103",
    "description": "Pfizer Inc. engages in the discovery, development, and manufacture of healthcare products specializes in medicines, vaccine, and consumer healthcare. The company is headquartered in New York City, New York and currently employs 78,500 full-time employees.  The firm is engaged in the discovery, development and manufacture of healthcare products. Its global portfolio includes medicines and vaccines. The firm manages its commercial operations through two business segments: Pfizer Innovative Health (IH) and Pfizer Essential Health (EH). IH focuses on developing and commercializing medicines and vaccines. IH therapeutic areas include internal medicine, vaccines, oncology, inflammation and immunology, rare diseases and consumer healthcare. EH includes legacy brands, branded generics, generic sterile injectable products, biosimilars and infusion systems. EH also includes a research and development (R&D) organization, as well as its contract manufacturing business. Its brands include Prevnar 13, Xeljanz, Eliquis, Lipitor, Celebrex, Pristiq and Viagra.",
    "employeeTotal": "78500.0",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "1944-01-17",
    "isin": "US7170811035",
    "logo": "https://finnhub.io/api/logo?symbol=PFE",
    "marketCapitalization": 221724.7,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Pfizer Inc",
    "phone": "12125732323.0",
    "sedol": "2684703",
    "shareOutstanding": 5597.693867,
    "state": "NEW YORK",
    "ticker": "PFE",
    "weburl": "https://www.pfizer.com/"
}