{
    "address": "Anders Personsgatan 16",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Platzer Fastigheter Holding AB engages in the acquisition, management, development, and sale of properties and securities. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 86 full-time employees. The company went IPO on 2013-11-29. The company is active primarily in the area of Gothenburg and its portfolio includes around 370,000 square meters of commercial real estate. The portfolio is designed for rental and includes primarily office space, but also warehouses and boutiques. To acquire profits, the Company owns, manages and develops real estate on a long term basis. The company offers approximately 50 properties in Backaplan, Centrum, Gamlestaden, Gullbergsvass, Garda, Hogsbo, Molndal and Molnlycke, among others. The firm's organization is divided in two segments: Investment Properties and Project Properties. The Investment segment is split into three geographical areas: Central Gothenburg, Western Gothenburg and Rest of Gothenburg, and responsible for development, management and daily operation and service. The Project division coordinates implementation of projects, planned maintenance and energy optimization.",
    "employeeTotal": "86.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Real Estate",
    "ggroup": "Real Estate",
    "gind": "Real Estate Management & Development",
    "gsector": "Real Estate",
    "gsubind": "Real Estate Operating Companies",
    "ipo": "2013-11-29",
    "isin": "SE0004977692",
    "logo": "",
    "marketCapitalization": 15649.71,
    "naics": "Lessors of Real Estate",
    "naicsNationalIndustry": "Lessors of Nonresidential Buildings (except Miniwarehouses)",
    "naicsSector": "Real Estate Rental and Leasing",
    "naicsSubsector": "Real Estate",
    "name": "Platzer Fastigheter Holding AB (publ)",
    "phone": "4674649546423.0",
    "sedol": "BH0WHG9",
    "shareOutstanding": 119.815863,
    "state": "VASTRA GOTALANDS",
    "ticker": "PLAZ B.ST",
    "weburl": "http://www.platzer.se"
}