{
    "address": "Vasagatan 11, vaning 9",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W70174102",
    "description": "Pandox AB engages in the ownership and management of hotel properties. The company is headquartered in Stockholm, Stockholm and currently employs 428 full-time employees. The company went IPO on 2015-06-18. The firm's principal business activities are the active ownership, development and leasing of large hotel properties in Stockholm, Gothenburg and Malmo, in Swedish regional and university cities and in capitals and other major cities in northern Europe. The firm's hotel properties are situated in such locations as city centers, airports and convention centers. Pandox' hotels are in the upper-medium to high price range and focus on the business and leisure segment. The firm's portfolio is comprised of 44 hotel properties in five countries (Sweden, Denmark, Germany, Belgium and the United Kingdom) totaling 8,143 rooms. The average number of rooms per hotel is 188. The firm's hotels are operated by such hotel operators as Hilton Group plc, Choice Hotels, Rezidor SAS, Best Western, Elite Hotels and First Hospitality, among others.",
    "employeeTotal": "428.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Hotels, Restaurants & Leisure",
    "ggroup": "Consumer Services",
    "gind": "Hotels, Restaurants & Leisure",
    "gsector": "Consumer Discretionary",
    "gsubind": "Hotels, Resorts & Cruise Lines",
    "ipo": "2015-06-18",
    "isin": "SE0007100359",
    "logo": "https://finnhub.io/api/logo?symbol=PNDX B.ST",
    "marketCapitalization": 16762.9,
    "naics": "Traveler Accommodation",
    "naicsNationalIndustry": "Hotels (except Casino Hotels) and Motels",
    "naicsSector": "Accommodation and Food Services",
    "naicsSubsector": "Accommodation",
    "name": "Pandox AB",
    "phone": "46850620550.0",
    "sedol": "BZ0CT92",
    "shareOutstanding": 183.849999,
    "state": "STOCKHOLM",
    "ticker": "PNDX B.ST",
    "weburl": "https://www.pandox.se/"
}