{
    "address": "Stortorget 8",
    "city": "Orebro",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W1769Q106",
    "description": "Precio Fishbone AB engages in the provision of information technology services. The company is headquartered in Orebro, Orebro and currently employs 119 full-time employees. The company went IPO on 2000-08-28. The company provides solutions for software projects and delivers such services as feasibility studies, deployment and application management. Its activities are divided into three areas: Information Worker, which provides such solutions as Company portals, Collaboration solutions, Enterprise Content Management, Document Management and Workflow solutions, among others; Integration and Custom Development, with solutions for Enterprise Application Integration and Business Process Management, both for client platforms, mobile devices and the web, as well as Application Manager. Within this business unit, the Company provides support and maintenance services for all of the above solutions. The company is operational through its offices in Stockholm, Gothenburg, Eskilstuna, Borlange and Orebro in Sweden.",
    "employeeTotal": "119.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "2000-08-28",
    "isin": "SE0000141137",
    "logo": "https://finnhub.io/api/logo?symbol=PRCO B.ST",
    "marketCapitalization": 567.6548,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Other Computer Related Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Precio Fishbone AB",
    "phone": "46771440080.0",
    "sedol": "5873155",
    "shareOutstanding": 9.175722,
    "state": "OREBRO",
    "ticker": "PRCO B.ST",
    "weburl": "https://www.preciofishbone.se/"
}