{
    "address": "Scheelevagen 27, 8th floor",
    "city": "Lund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W67033238",
    "description": "Precise Biometrics AB engages in the development and provision of smart card and fingerprint readers for computers and mobile devices. The company is headquartered in Lund, Skane and currently employs 23 full-time employees. The company went IPO on 2000-10-03. The company operates in three business areas: Mobile Smart Card Solutions, which offers the product portfolio Tactivo - a range of smart cards and fingerprint readers for smartphones and tablets, and software for the development of applications for Tactivo; Fingerprint Technology, which offers core technology in the form of algorithms for matching of fingerprint recognition and software for integration in third-part hardware, such as mobile phones; Desktop & Physical Access Solutions, which includes Precise Biometrics’ fingerprint and smart card readers and development software for authentication at desktop computers, as well as physical access through fingerprint recognition to buildings. As of December 31, 2013, the Company had two wholly owned subsidiaries based in Sweden and the United States.",
    "employeeTotal": "23.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "2000-10-03",
    "isin": "SE0001823303",
    "logo": "https://finnhub.io/api/logo?symbol=PREC.ST",
    "marketCapitalization": 432.2778,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "Precise Biometrics AB",
    "phone": "4646311100.0",
    "sedol": "5822908",
    "shareOutstanding": 360.231,
    "state": "SKANE",
    "ticker": "PREC.ST",
    "weburl": "https://precisebiometrics.com/"
}