{
    "address": "Legeringsgatan 18, Box 4",
    "city": "Vasteras",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W67068101",
    "description": "Prevas AB engages in the provision of information technology solutions and services. The company is headquartered in Vasteras, Vastmanland and currently employs 790 full-time employees.  The Company’s activities are divided into three areas: Product Development, which offers software, electronics and mechatronics for embedded systems, as well as technical consulting services for Scandinavian companies; Industrial Systems, providing IT solutions for logistics and automation, Manufacturing Execution Systems (MES), Enterprise Asset Management (EAM) and Enterprise Manufacturing Intelligence (EMI); and Management Consulting, including advisory services related to a range of areas, such as Business Development, Business Model Innovation, Value Management, Customer Relation and Enterprise Architecture. Its customer portfolio includes Ericsson, Siemens, SAAB Aerosystems, Volvo, GE Healthcare, Sandvik, and Bombardier Transportation, among others. The firm is a parent of a number of entities, such as Prevas AS and Prevas Technology AB.",
    "employeeTotal": "790.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "1998-05-29",
    "isin": "SE0000356008",
    "logo": "https://finnhub.io/api/logo?symbol=PREV B.ST",
    "marketCapitalization": 1070.088,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Computer Systems Design Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Prevas AB",
    "phone": "46213601900.0",
    "sedol": "5473180",
    "shareOutstanding": 12.749693,
    "state": "VASTMANLAND",
    "ticker": "PREV B.ST",
    "weburl": "https://www.prevas.se/"
}