{
    "address": "Vastra Jarnvagsgatan 7",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W6709C117",
    "description": "Pricer AB engages in the provision of in-store digital shelf-edge solutions. The company is headquartered in Stockholm, Stockholm and currently employs 163 full-time employees.  The firm develops and markets a system consisting of components for communication in a store environment. The firm has over 15,000 installations in over 50 countries. Its solutions include shopper solutions, store manage solutions, price automation and communication platform. Its product offering enables users to display and change prices of a whole store; help shoppers find what they want in a Pricer equipped store; use scheduled SmartFLASH functionality to automate promotions; validate that all products are in the correct place according to the floor plan; make sure prices are the same in the store as in the Web shop; give any near field communications (NFC) enabled smartphone the ability to show added product info, and draw, synchronize and show maps on mobiles and on the Web, among others. The platform's other features include geofencing, infrared geopositioning, in-store navigation, Shelf label and in-store picking.",
    "employeeTotal": "163.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "1996-01-01",
    "isin": "SE0000233934",
    "logo": "",
    "marketCapitalization": 3393.265,
    "naics": "Commercial and Service Industry Machinery Manufacturing",
    "naicsNationalIndustry": "Office Machinery Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Pricer AB",
    "phone": "46850558200.0",
    "sedol": "4668028",
    "shareOutstanding": 110.324,
    "state": "STOCKHOLM",
    "ticker": "PRIC B.ST",
    "weburl": "https://www.pricer.com/"
}