{
    "address": "Fogdevreten 2",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7340A106",
    "description": "Promore Pharma AB is a biopharmaceutical company, which engages in the development of therapeutic peptides for the bioactive wound care market. The company is headquartered in Solna, Stockholm and currently employs 1 full-time employees. The company went IPO on 2017-07-06. The company specializes in the development of therapeutic peptides for the bioactive wound care market. The firm possesses two therapeutic peptides, PXL01 and LL-37, in late stage clinical phase. The peptides are derived from human sequences that are part of innate immune system, having multiple biological functions and properties. PXL01 aims to prevent post-surgical adhesions and scars and is for clinical phase III-studies on patients performing tendon repair surgery in the hand. LL-37 aims to heal chronic wounds and is in a clinical phase IIb study on patients with venous leg ulcers and in a clinical phase IIa study on patients with diabetic foot ulcers. The Company’s main shareholders are Midroc New Technology AB and Rosetta IV SARL.",
    "employeeTotal": "1.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2017-07-06",
    "isin": "SE0009947740",
    "logo": "https://finnhub.io/api/logo?symbol=PROMO.ST",
    "marketCapitalization": 125.0707,
    "naics": "Scientific Research and Development Services",
    "naicsNationalIndustry": "Research and Development in Biotechnology",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Promore Pharma AB",
    "phone": "46850884744.0",
    "sedol": "BYVKW11",
    "shareOutstanding": 60.713936,
    "state": "STOCKHOLM",
    "ticker": "PROMO.ST",
    "weburl": "https://www.promorepharma.com/"
}