{
    "address": "Uppsala Business Park, Virdings Alle 32 B",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9821A100",
    "description": "Quiapeg Pharmaceuticals Holding AB engages in the research, development, and commercialization of drug delivery system. The company is headquartered in Uppsala, Uppsala and currently employs 8 full-time employees. The company went IPO on 2005-06-21. The firm develops improved versions of clinically validated biopharmaceutical drugs based on PEGylation technology platform. The Company’s technology is applicable on proteins, peptides and small molecules and offers a half-life extension platform consisting of covalent, as well as extended release PEGylation. The firm focuses on development of long-acting biopharmaceuticals for the treatment of metabolic disorders. The main project intends to reduce the frequent injection therapy by requiring significantly fewer injections. The firm offers out-licensing and partnering opportunities. The company has a patent portfolio with patents pending and an approved the United States patent covering chemical linkers.",
    "employeeTotal": "8.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2005-06-21",
    "isin": "SE0001384850",
    "logo": "",
    "marketCapitalization": 57.18385,
    "naics": "Waste Treatment and Disposal",
    "naicsNationalIndustry": "Hazardous Waste Treatment and Disposal",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Waste Management and Remediation Services",
    "name": "QuiaPEG Pharmaceuticals Holding AB",
    "phone": "46708528651.0",
    "sedol": "B0BV829",
    "shareOutstanding": 60.448041,
    "state": "UPPSALA",
    "ticker": "QUIA.ST",
    "weburl": "http://www.quiapeg.com/"
}