{
    "address": "Drottninggatan 2, Box 1661",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W72177111",
    "description": "Ratos AB is an investment company, which comprises acquisition, development, and divestment of unlisted companies. The company is headquartered in Stockholm, Stockholm and currently employs 8,477 full-time employees.  The company owns and develops over 10 unlisted medium-sized enterprises in Nordic region. Enterprises are active in various sectors, such as industry, consumer goods, services and life science, among others. The Company’s portfolio comprises Aibel, the supplier of maintenance and modification services for production platforms and onshore installations within oil and gas industry; Bisnode, the data and analytics company; HENT, the construction company with focus on public and commercial real estate; Plantasjen, the chain for sales of plants and gardening accessories; HL Display, the supplier of products and solutions for in-store communication and merchandising; and Diab, the manufacturer of materials for sandwich composite structures, among others enterprises.",
    "employeeTotal": "8477.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Financial Services",
    "ggroup": "Diversified Financials",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Asset Management & Custody Banks",
    "ipo": "1954-01-01",
    "isin": "SE0000111940",
    "logo": "",
    "marketCapitalization": 21157.76,
    "naics": "Personal and Household Goods Repair and Maintenance",
    "naicsNationalIndustry": "Home and Garden Equipment Repair and Maintenance",
    "naicsSector": "Other Services (except Public Administration)",
    "naicsSubsector": "Repair and Maintenance",
    "name": "Ratos AB",
    "phone": "4687001700.0",
    "sedol": "B130WD0",
    "shareOutstanding": 319.492634,
    "state": "STOCKHOLM",
    "ticker": "RATO B.ST",
    "weburl": "https://www.ratos.com/"
}