{
    "address": "Sveavagen 44, Box 3297",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W72195105",
    "description": "RaySearch Laboratories AB is a medical technology company, which engages in the development of software solutions for improved radiation therapy of cancer. The company is headquartered in Stockholm, Stockholm and currently employs 413 full-time employees.  The company markets and sells its products mainly in the United States and in Europe through license agreements with medical technology companies and scientific institutions. As of December 31, 2011, 15 of the Company’s products were launched, including the software platform ORBIT (optimization of radiation therapy beams by iterative technique), which is available in its main products, and is a non-clinical system which functions as a research and development environment. Additionally, its solutions include software for optimizing Intensity Modulated Radiation Therapy (IMRT) plans for photons, adaptive technology for IMRT treatments and software for proton treatments. The Company’s commercial partners are Philips, Nucletron and IBA Dosimetry, among others. In April 2014, it established a German subsidiary, RaySearch Germany GmbH.",
    "employeeTotal": "413.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Technology",
    "gsector": "Health Care",
    "gsubind": "Health Care Technology",
    "ipo": "1990-05-29",
    "isin": "SE0000135485",
    "logo": "https://finnhub.io/api/logo?symbol=RAY B.ST",
    "marketCapitalization": 2275.429,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "RaySearch Laboratories AB (publ)",
    "phone": "46851053000.0",
    "sedol": "7591239",
    "shareOutstanding": 34.282773,
    "state": "STOCKHOLM",
    "ticker": "RAY B.ST",
    "weburl": "http://www.raysearchlabs.com"
}