{
    "address": "Box 603, Drottninggatan 29",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7S15G123",
    "description": "Recipharm AB engages in the manufacture of pharmaceuticals and contract development services for pharmaceutical companies. The company is headquartered in Stockholm, Stockholm and currently employs 7,383 full-time employees. The company went IPO on 2014-04-03. The company is divided in two business areas: Manufacturing Services, supplying a range of pharmaceutical products in different dosage forms, such as solid dose, semi solids, beta-lactams, hormones, dry powder metered dose inhalers, oral liquids and granulates, among others; and Development and Technology, offering clinical supply, product development, formulation, analytical development, stability studies, packaging development and raw material selection, as well as regulatory advice. The company is also engaged in the development of own product portfolio. The firm targets two customer segments: large pharmaceutical companies, outsourcing part of their production; and small and medium-sized enterprises, outsourcing manufacturing and development services. Recipharm publ AB operates as a parent entity of the Recipharm Group, comprising approximately 15 subsidiaries.",
    "employeeTotal": "7383.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Pharmaceuticals",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Pharmaceuticals",
    "gsector": "Health Care",
    "gsubind": "Pharmaceuticals",
    "ipo": "2014-04-03",
    "isin": "SE0005757267",
    "logo": "https://finnhub.io/api/logo?symbol=RECI B.ST",
    "marketCapitalization": 18530.42,
    "naics": "Pharmaceutical and Medicine Manufacturing",
    "naicsNationalIndustry": "Pharmaceutical Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Recipharm AB (publ)",
    "phone": "4686025200.0",
    "sedol": "BL95N58",
    "shareOutstanding": 101.485683,
    "state": "STOCKHOLM",
    "ticker": "RECI B.ST",
    "weburl": "https://www.recipharm.com/"
}