{
    "address": "Drottninggatan 33, Box 161 42",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7263G189",
    "description": "RNB Retail & Brands AB engages in the acquisition, operation, and development of fashion clothing, accessories, jewelry, and cosmetics stores. The company is headquartered in Stockholm, Stockholm and currently employs 1,024 full-time employees. The company went IPO on 2001-06-26. The firm owns, operates and develops fashion, clothing, accessories, jewelry and cosmetics stores. RNB operates through four business areas: Polarn O. Pyret, Department Stores, Brothers & Sisters and JC. Polarn O. Pyret is an integrated brand that designs, produces and distributes baby and children’s clothing through its own stores and franchisees in Sweden and abroad. The Department Stores offer fashion for women, men and children, as well as accessories, jewelry and cosmetics in the NK department stores in Stockholm and Gothenburg. Brothers & Sisters business area provides the range of internal and external brands in the upper mid-price segment for both men and women. JC offers mainly jeans, as well as clothing worn with jeans. As of August 31, 2013, the Company operated a total of 383 stores, of which 143 were operated by franchisees.",
    "employeeTotal": "1024.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Retail",
    "ggroup": "Retailing",
    "gind": "Specialty Retail",
    "gsector": "Consumer Discretionary",
    "gsubind": "Apparel Retail",
    "ipo": "2001-06-26",
    "isin": "SE0005223674",
    "logo": "",
    "marketCapitalization": 425.2587,
    "naics": "Clothing Stores",
    "naicsNationalIndustry": "Women's Clothing Stores",
    "naicsSector": "Retail Trade",
    "naicsSubsector": "Clothing and Clothing Accessories Stores",
    "name": "Rnb Retail and Brands AB (publ)",
    "phone": "46841052000.0",
    "sedol": "BBFL402",
    "shareOutstanding": 101.736528,
    "state": "STOCKHOLM",
    "ticker": "RNBS.ST",
    "weburl": "http://www.rnb.se"
}