{
    "address": "Sunnorpsgatan 5",
    "city": "Linkoping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8953R105",
    "description": "S2Medical AB engages in the development and sale of wound healing products for the entire wound healing process focusing on burns and chronic wounds. The company is headquartered in Linkoping, Ostergotland. The company went IPO on 2018-11-28. The firm focuses on developing products for healing burns and chronic wounds, from debridement and granulation to reepithelialization. The firm's product portfolio includes INSTAQRETT, a sterile single-use mechanical debridement tool, the Epiprotect product line based on its collagen-mimicking Eiratex material, which includes EPIPROTECT Safestop, a blood-stilling membrane dressing, EPIPROTECT 2117, a synthetic substitute to allografts and xenografts, EPIPROTECT ULCER, dressing for treating ulcers, as well as INSTABIND bandages and Instagraft, a single-use medical device designed to treat chronic wounds with microtransplants from the patient's own skin without creating any new wounds. The firm is also the official distributor of Silverlon antimicrobial dressings for Nordic countries. In addition, it operates the S2Clinic, a wound healing center in Sweden.",
    "employeeTotal": "",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Supplies",
    "ipo": "2018-11-28",
    "isin": "SE0011725084",
    "logo": "https://finnhub.io/api/logo?symbol=S2M.ST",
    "marketCapitalization": 83.955,
    "naics": "Medical Equipment and Supplies Manufacturing",
    "naicsNationalIndustry": "Surgical Appliance and Supplies Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Miscellaneous Manufacturing",
    "name": "S2Medical AB (publ)",
    "phone": "4687000050.0",
    "sedol": "BF55CR5",
    "shareOutstanding": 14.785417,
    "state": "OSTERGOTLAND",
    "ticker": "S2M.ST",
    "weburl": "http://www.s2m.se/"
}