{
    "address": "Akerbogatan 45",
    "city": "Linkoping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W72838118",
    "description": "Saab AB engages in the production and sale of products, services, and solutions for military defence, commercial aviation and civil security. The company is headquartered in Linkoping, Ostergotland and currently employs 18,140 full-time employees.  The Company’s operations are divided into six business areas. The Aeronautics includes the development of civil and military aviation technology, including the Gripen and Unmanned Aerial Systems. The Dynamics comprises a product portfolio of weapon systems, such as support weapons, missiles, Remotely Operated Vehicles and signature management systems. The Electronic Defense Systems provides airbone, land-based and naval systems and radar, signals intelligence and self-protection. The Security and Defense Solutions provides the military and civil security market with, among others, computerized command, control, communications and intelligence systems. The Support and Services offers service and support to the Saab’s clients. Among others, the Company operates through Thyssen Krupp Marine Systems AB and Nordic Defence Industries, a producer of mine disposal charge systems.",
    "employeeTotal": "18140.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Aerospace & Defense",
    "ggroup": "Capital Goods",
    "gind": "Aerospace & Defense",
    "gsector": "Industrials",
    "gsubind": "Aerospace & Defense",
    "ipo": "1998-01-01",
    "isin": "SE0000112385",
    "logo": "https://finnhub.io/api/logo?symbol=SAAB B.ST",
    "marketCapitalization": 30989.86,
    "naics": "Aerospace Product and Parts Manufacturing",
    "naicsNationalIndustry": "Aircraft Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Transportation Equipment Manufacturing",
    "name": "Saab AB",
    "phone": "4613180000.0",
    "sedol": "5469554",
    "shareOutstanding": 132.39654,
    "state": "OSTERGOTLAND",
    "ticker": "SAAB B.ST",
    "weburl": "https://www.saabgroup.com/"
}