{
    "address": "Kungsbron 1, Section 6, plan G",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W74857165",
    "description": "Sandvik AB engages in the development, manufacture, and sale of tools, equipment, and tooling systems for the mining and construction industries. The company is headquartered in Stockholm, Stockholm and currently employs 38,418 full-time employees.  The firm is engaged in the developing, manufacturing and marketing processed products and services. Its segments include Sandvik Machining Solutions, Sandvik Mining and Rock Technology, Sandvik Materials Technology and Other Operations. The company operates in the areas of Mining, which includes delivering drill rigs; Engineering, which includes tools and tooling systems; Energy, which offers solutions for energy production; Automotive, which includes cemented-carbide tools and tooling systems; Construction, which provides solutions for the construction industry, and Aerospace, which works with aerospace companies. Its various product categories include metal-cutting tools and tooling systems; mining equipment and tools; construction equipment and tools; stainless steels, special alloys and titanium; furnace products and heating systems, and industrial processing systems.",
    "employeeTotal": "38418.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "1905-03-15",
    "isin": "SE0000667891",
    "logo": "https://finnhub.io/api/logo?symbol=SAND.ST",
    "marketCapitalization": 284620.2,
    "naics": "Metalworking Machinery Manufacturing",
    "naicsNationalIndustry": "Machine Tool (Metal Cutting Types) Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Sandvik AB",
    "phone": "4684561100.0",
    "sedol": "B1VQ252",
    "shareOutstanding": 1254.386,
    "state": "STOCKHOLM",
    "ticker": "SAND.ST",
    "weburl": "http://www.home.sandvik/"
}