{
    "address": "Baltorpvej 154",
    "city": "Ballerup",
    "country": "DK",
    "currency": "SEK",
    "cusip": "W7T20C108",
    "description": "Saniona AB engages in the research and development on drugs for diseases of the central nervous system, autoimmune diseases, metabolic diseases, and treatment of pain. The company operates in the area of drugs targeting ion channels to develop therapeutics for pain, central nervous system, and inflammatory or autoimmune diseases. The firm develops a technology platform which enables investigation of all types of ion channel drug targets. Its research is focused on GABAA receptors, nicotinic acetylcholine receptors and potassium channels. The clinical pipeline includes: AN788, a clinical candidate for second line treatment of major depressive disorder (MDD); AN761, to be developed for cognition deficits in schizophrenia and Alzheimer's disease; AN363, a candidate for treatment of pain disorders; and AN346, an anti-inflammatory treatment in inflammatory bowel disease (IBD); as well as several other projects. The firm is engaged in partnerships with Janssen Pharmaceuticals Inc, Pfizer Inc and Atlas Venture Inc.",
    "employeeTotal": "42.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2014-04-22",
    "isin": "SE0005794617",
    "logo": "https://finnhub.io/api/logo?symbol=SANION.ST",
    "marketCapitalization": 1070.538,
    "naics": "Scientific Research and Development Services",
    "naicsNationalIndustry": "Research and Development in Biotechnology",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Saniona AB",
    "phone": "4570705225.0",
    "sedol": "BKGR0L5",
    "shareOutstanding": 62.372831,
    "state": "",
    "ticker": "SANION.ST",
    "weburl": "https://saniona.com/"
}