{
    "address": "Frosundaviks Alle 1",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7501Z171",
    "description": "SAS AB engages in the provision of air transportation services, air cargo, and other aviation services at selected airports in the route network. The company is headquartered in Solna, Stockholm and currently employs 4,730 full-time employees. The company went IPO on 2001-07-06. The firm's core business is operating passenger flights flights to, from and within Scandinavia. Additionally, The Company provides such services air Cargo, which provides postal and air freight services to, from and within Scandinavia, and SAS Ground Handling, which is handling provider at airports in Copenhagen, Oslo and Stockholm and provides passenger, cargo and ramp services for SAS and other airlines. The Group’s operations are reported as one operating segment, which is consistent with the internal reporting to the Chief Operating Decision Maker (CODM), which is defined as SAS Group Management, has strategic responsibility for allocating resources, primarily in terms of aircraft capacity to the various route sectors, and prepares decision data ahead of strategic Board decisions.",
    "employeeTotal": "4730.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Airlines",
    "ggroup": "Transportation",
    "gind": "Airlines",
    "gsector": "Industrials",
    "gsubind": "Airlines",
    "ipo": "2001-07-06",
    "isin": "SE0003366871",
    "logo": "https://finnhub.io/api/logo?symbol=SAS.ST",
    "marketCapitalization": 15273.21,
    "naics": "Scheduled Air Transportation",
    "naicsNationalIndustry": "Scheduled Passenger Air Transportation",
    "naicsSector": "Transportation and Warehousing",
    "naicsSubsector": "Air Transportation",
    "name": "SAS AB",
    "phone": "46879746464646.0",
    "sedol": "7129577",
    "shareOutstanding": 7266.039292,
    "state": "STOCKHOLM",
    "ticker": "SAS.ST",
    "weburl": "https://www.sasgroup.net/"
}