{
    "address": "Frosundaviks Alle 15",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8046J102",
    "description": "Scout Gaming Group AB engages in the provision of business to business daily fantasy sports and pool games. The company is headquartered in Solna, Stockholm and currently employs 88 full-time employees. The company went IPO on 2017-12-11. The firm is a licensed and regulated business-to-business (B2B) Fantasy Sports provider. The firm offers a manageable platform with an add-on application Betflex, a cross-selling tool. Its Fantasy Sports Network includes a variety of game types, including traditional Fantasy Sports and Daily Fantasy Sports, as well as Predictor Games, PickEm and Fantasy Odds. The platform also includes a StatCenter, providing users with real-time information and statistics for a number of standard sports and sport leagues, with possible customization to include local divisions. Featured sports include football, ice hockey and basketball, among others. The firm holds gaming licenses on Malta and in the United Kingdom. The company directs its offering at betting companies on a revenue share basis.",
    "employeeTotal": "88.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Hotels, Restaurants & Leisure",
    "ggroup": "Consumer Services",
    "gind": "Hotels, Restaurants & Leisure",
    "gsector": "Consumer Discretionary",
    "gsubind": "Casinos & Gaming",
    "ipo": "2017-12-11",
    "isin": "SE0010521153",
    "logo": "https://finnhub.io/api/logo?symbol=SCOUT.ST",
    "marketCapitalization": 653.0656,
    "naics": "Other Information Services",
    "naicsNationalIndustry": "Internet Publishing and Broadcasting and Web Search Portals",
    "naicsSector": "Information",
    "naicsSubsector": "Other Information Services",
    "name": "Scout Gaming Group AB",
    "phone": "467467581668.0",
    "sedol": "BF1PMV3",
    "shareOutstanding": 20.536654,
    "state": "STOCKHOLM",
    "ticker": "SCOUT.ST",
    "weburl": "https://www.scoutgaminggroup.com/"
}