{
    "address": "Strandbergsgatan 55",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W75737101",
    "description": "Scandi Standard AB is a holding company, which engages in the production, sale, and marketing of refrigerated, frozen, and processed chicken. The company is headquartered in Stockholm, Stockholm and currently employs 3,227 full-time employees. The company went IPO on 2014-06-27. The firm is operational through Kronfagel AB in Sweden (including SweHatch AB and AB Skanefagel), Scandinavian Standard AS, formerly Cardinal Foods AS, in Norway and Danpo A/S in Denmark. Scandi Standard publ AB produces and sells fresh and frozen chicken as well as other chicken products through its brands Kronfagel, Danpo and Den Stolte Hane and through private label. In addition to chicken production, the Norwegian operations also include egg sales and turkey as well as duck products. Kronfagel AB is a chicken producer, SweHatch AB is an egg hatchery company, and Skanefagel supplies locally produced chicken products to Swedish retail stores, food service/catering and restaurants. Furthermore, Scandinavian Standard AS is engaged in the white meat and egg market, and Danpo A/S is engaged in the production of chicken products.",
    "employeeTotal": "3227.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Food Products",
    "ggroup": "Food, Beverage & Tobacco",
    "gind": "Food Products",
    "gsector": "Consumer Staples",
    "gsubind": "Packaged Foods & Meats",
    "ipo": "2014-06-27",
    "isin": "SE0005999760",
    "logo": "",
    "marketCapitalization": 3765.471,
    "naics": "Poultry and Egg Production",
    "naicsNationalIndustry": "Poultry Hatcheries",
    "naicsSector": "Agriculture, Forestry, Fishing and Hunting",
    "naicsSubsector": "Animal Production",
    "name": "Scandi Standard AB (publ)",
    "phone": "46104561300.0",
    "sedol": "BNJZRJ4",
    "shareOutstanding": 65.081937,
    "state": "STOCKHOLM",
    "ticker": "SCST.ST",
    "weburl": "https://www.scandistandard.com/"
}