{
    "address": "Stureplan 13",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T88U121",
    "description": "Sdiptech AB (publ) is a SE-based company operating in Commercial Services & Supplies industry. The company is headquartered in Stockholm, Stockholm and currently employs 1,652 full-time employees. The company went IPO on 2015-03-04. Sdiptech AB (publ) is a Sweden-based engineering company and provider of technical services and products for urban infrastructures, such as hospitals, traffic systems, water supply systems, and data centers. The firm divides its activities into two segments: Tailored Installations and Niched Products & Services. In the Tailored Installations segment the Company offers cooling installation services, wastewater treatment, solutions for electric automation, uninterruptible power supply solutions, roof maintenance and services within elevator industry, among others. The firm's Niched Products & Services include electrical power monitoring solutions, vibration monitoring services and measurement systems, water and district heating monitoring, decontamination services, radio infrastructure and traffic enforcement cameras, among others. The firm is active primarily in Northern Europe, with focus on Nordic countries and the United Kingdom.",
    "employeeTotal": "1652.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Environmental & Facilities Services",
    "ipo": "2015-03-04",
    "isin": "SE0006758348",
    "logo": "https://finnhub.io/api/logo?symbol=SDIP PREF.ST",
    "marketCapitalization": 14092.1,
    "naics": "Architectural, Engineering, and Related Services",
    "naicsNationalIndustry": "Engineering Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Sdiptech AB (publ)",
    "phone": "",
    "sedol": "BW4Q494",
    "shareOutstanding": 35.391827,
    "state": "STOCKHOLM",
    "ticker": "SDIP PREF.ST",
    "weburl": "https://www.sdiptech.se/"
}