{
    "address": "Dag Hammarskjolds Vag 52 A",
    "city": "Uppsala",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7T14M104",
    "description": "ScandiDos AB engages in the provision of unique measurement systems and software for dosage and quality assurance within radiation therapy. The company is headquartered in Uppsala, Uppsala and currently employs 34 full-time employees. The company went IPO on 2014-04-11. The firm's competence includes the design and development of radiation detectors, electrometers and application software, as well as clinical experience in medical physics and radiation measurements. The firm's business focuses on developing such applications as Arc Therapy - IMAT/VMAT, Tomotherapy, IMRT and Machine QA, among others. ScandiDos AB markets its products under the Delta4 brand. Delta4 offers Delta4AT - At Treatment in-vivo dosimetry for advanced RT and Delta4PT - Pre Treatment volumetric plan QA, among others. The company operates in Europe, Asia, North America and Asia, and through numerous distributors and subsidiaries, including Additec GmbH and Conmedica GmbH in Germany, and ScandiDos SAS in France.",
    "employeeTotal": "34.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2014-04-11",
    "isin": "SE0005768124",
    "logo": "https://finnhub.io/api/logo?symbol=SDOS.ST",
    "marketCapitalization": 162.5188,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Electromedical and Electrotherapeutic Apparatus Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "ScandiDos AB",
    "phone": "46184723030.0",
    "sedol": "BLM77D7",
    "shareOutstanding": 41.45887,
    "state": "UPPSALA",
    "ticker": "SDOS.ST",
    "weburl": "http://www.scandidos.com"
}