{
    "address": "Teknikringen 20",
    "city": "Linkoping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T80J504",
    "description": "Sectra AB engages in the development and sales of information technology solutions. The company is headquartered in Linkoping, Ostergotland and currently employs 819 full-time employees.  The company is operational through two business areas: Secure Communication Systems and Medical Systems. The Secure Communication Systems business area, which operates through the Company’s subsidiary Sectra Communications AB, delivers security solutions for customers who handle classified information, including government authorities, defense departments and critical functions of society throughout Europe. The Medical Systems business area, which operates through the subsidiary Sectra Imtec AB, offers information technology (IT) solutions, software licenses, service and upgrade agreements, online services, consultancy services and training courses to public and private healthcare providers. The company has offices in 12 countries and operates through partners worldwide. As of April 30, 2012, the Company had six wholly owned direct subsidiaries, as well as 13 indirectly held wholly owned subsidiaries.",
    "employeeTotal": "819.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Technology",
    "gsector": "Health Care",
    "gsubind": "Health Care Technology",
    "ipo": "1999-03-03",
    "isin": "SE0014609061",
    "logo": "https://finnhub.io/api/logo?symbol=SECT B.ST",
    "marketCapitalization": 24558.88,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Computer Systems Design Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Sectra AB",
    "phone": "4613235200.0",
    "sedol": "BMFFLK0",
    "shareOutstanding": 38.525494,
    "state": "OSTERGOTLAND",
    "ticker": "SECT B.ST",
    "weburl": "https://www.sectra.com/"
}