{
    "address": "Forsta Langgatan 28B",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T99D100",
    "description": "Smart Eye AB engages in the development of artificial intelligence in the form of eye tracking technology. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 102 full-time employees. The company went IPO on 2016-12-07. The firm focuses on designing a real-time eyelid and head tracking technology. The firm's activities are divided into two areas: Applied solutions and Research instruments. The Applied solutions area offers tracking technology for automotive industry, including AntiSleep, an integrated camera and software, which measures driver head pose, gaze direction and eyelid closure, and Blackbird, a compact camera system for tracking and measuring human eye and head movements. The Research instruments area provides equipment for tracking, measuring and analyzing human eye movements in various industries, such as aerospace, aviation, psychology, communication, neuroscience, medicine and clinical research.",
    "employeeTotal": "102.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Electrical Equipment",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Equipment & Instruments ",
    "ipo": "2016-12-07",
    "isin": "SE0009268279",
    "logo": "https://finnhub.io/api/logo?symbol=SEYE.ST",
    "marketCapitalization": 4105.385,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Smart Eye AB (publ)",
    "phone": "4631606160.0",
    "sedol": "BDFCDX5",
    "shareOutstanding": 16.630882,
    "state": "VASTRA GOTALANDS",
    "ticker": "SEYE.ST",
    "weburl": "https://smarteye.se/"
}