{
    "address": "Kungstradgardsgatan 2",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9112U104",
    "description": "Svenska Handelsbanken AB engages in the provision of financial and banking services. The company is headquartered in Stockholm, Stockholm and currently employs 12,396 full-time employees.  The company provides services for both private and corporate customers and operates through three business segments. Branch office operations in Sweden segment comprises six regional banks, Handelsbanken Finans’s and Stadshypotek’s operations in Sweden. The company provides private banking, financial company services, credit card issuing and mortgage loans, among others. Branch office operation outside Sweden offer a range of banking services, and include regional banks in the United Kingdom, Denmark, Norway and Finland, Handelsbanken International, as well as Handelsbanken Finans’s and Stadshypotek’s operations outside Sweden. Capital Markets segment consists of Handelsbanken’s investment bank and asset management operations, including insurance savings. The Bank operates through a network of more than 700 branch offices and numerous subsidiaries, including Optimix Vermogensbeheer NV.",
    "employeeTotal": "12396.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Banking",
    "ggroup": "Banks",
    "gind": "Banks",
    "gsector": "Financials",
    "gsubind": "Diversified Banks",
    "ipo": "1873-01-01",
    "isin": "SE0007100599",
    "logo": "https://finnhub.io/api/logo?symbol=SHB A.ST",
    "marketCapitalization": 199291,
    "naics": "Depository Credit Intermediation",
    "naicsNationalIndustry": "Commercial Banking",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Credit Intermediation and Related Activities",
    "name": "Svenska Handelsbanken AB",
    "phone": "4687011000.0",
    "sedol": "BXDZ9Q1",
    "shareOutstanding": 1980.028494,
    "state": "STOCKHOLM",
    "ticker": "SHB A.ST",
    "weburl": "https://www.handelsbanken.se/"
}