{
    "address": "Stjarnplan 3",
    "city": "Limhamn",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T5DZ104",
    "description": "Signatur Fastigheter AB engages in the provision of real estate related services. The company is headquartered in Limhamn, Skane and currently employs 0 full-time employees. The company went IPO on 2007-03-29. The company specializes in the marketing and manufacturing of biodegradable flame retardants under the Apyrum brand. The brand includes for main products. Apyrum Liquid has flame retardant properties and it is used as an impregnate and as a mixture in water-based products, glues and suspensions. Apyrum Powder is a grained powder used as an additive in polymers and other applications. Apyrum BIO-FR Canvas and Apyrum BIO-FR WOOD are used for impregnating fibrous and other absorbent materials. Apyrum products can be used in such materials, as polyester, polyamide, polyurethane, bitumen, rubber, latex, cellulose based materials and lacquer, among others. The company can be used in a number of industrial applications, such as building and construction materials, furniture, woven and non-woven fabrics, paper and board, transportation and electronics, adhesives, coatings and sealants.",
    "employeeTotal": "0.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Chemicals",
    "ggroup": "Materials",
    "gind": "Chemicals",
    "gsector": "Materials",
    "gsubind": "Commodity Chemicals",
    "ipo": "2007-03-29",
    "isin": "SE0013646924",
    "logo": "",
    "marketCapitalization": 629.4288,
    "naics": "Other Chemical Product and Preparation Manufacturing",
    "naicsNationalIndustry": "All Other Miscellaneous Chemical Product and Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Signatur Fastigheter publ AB",
    "phone": "46406088200.0",
    "sedol": "BJJJKB1",
    "shareOutstanding": 23.912035,
    "state": "SKANE",
    "ticker": "SIGN B.ST",
    "weburl": "https://signaturfastigheter.se/"
}