{
    "address": "Kungsgatan 2",
    "city": "KATRINEHOLM",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W7987Q216",
    "description": "SinterCast AB engages in the provision of online process control technology and solutions for compacted graphite iron. The company is headquartered in Katrineholm, Sodermanlands and currently employs 29 full-time employees.  The firm specializes in providing online solutions and know-how for the production of Compacted Graphite Iron (CGI), as well as in related services for the product development, installations, calibration and technical support. Its business solutions comprise: System 3000 Hardware Platform, which is suitable for a range of layouts and process flows of foundry; Process Control Software, which applies the metallurgical know-how and provides the operating logic for the System 3000 Hardware; Sampling Consumables, providing thermal analysis devices; and Technical Support, offering engineering service and consultancy for product development, trials, new installations and calibrations; among others. The company is a parent of a number of entities, such as SinterCast Inc, SinterCast Personnel AB and SinterCast SA de CV.",
    "employeeTotal": "29.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "1993-04-26",
    "isin": "SE0000950982",
    "logo": "https://finnhub.io/api/logo?symbol=SINT.ST",
    "marketCapitalization": 1087.626,
    "naics": "Motor Vehicle Parts Manufacturing",
    "naicsNationalIndustry": "Gasoline Engine and Engine Parts Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Transportation Equipment Manufacturing",
    "name": "SinterCast AB",
    "phone": "4686607750.0",
    "sedol": "7385186",
    "shareOutstanding": 7.0901,
    "state": "SODERMANLANDS",
    "ticker": "SINT.ST",
    "weburl": "http://www.sintercast.com"
}