{
    "address": "Humlegardsgatan 20",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T44P133",
    "description": "SJR in Scandinavia AB operates as a recruitment company, which engages in the recruitment and management consulting in the fields of banking and finance. The company is headquartered in Stockholm, Stockholm and currently employs 444 full-time employees. The company went IPO on 2007-03-06. The firm works in cooperation with a number of banking and financial institutions in Sweden, as well as with the financial and accounting departments of a number of the Swedish companies. The Company’s activity is structured into three principal segments: Recruitment, Consulting and Career Guidance. As of December 31, 2011, the Company operated through two wholly owned subsidiaries, namely SW in Scandinavia AB and Ogunsen AB. SW in Scandinavia AB provides its recruiting services to companies, recruiting college students, graduates and other qualified staff with work experience of up to three years. Ogunsen AB is engaged in the provision of recruitment and substitution services on managerial level for both public and private companies. The firm operates in the cities of Stockholm, Malmo and Goteborg, Sweden.",
    "employeeTotal": "444.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Professional Services",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Professional Services",
    "gsector": "Industrials",
    "gsubind": "Human Resource & Employment Services",
    "ipo": "2007-03-06",
    "isin": "SE0008406151",
    "logo": "https://finnhub.io/api/logo?symbol=SJR B.ST",
    "marketCapitalization": 350.84,
    "naics": "Employment Services",
    "naicsNationalIndustry": "Professional Employer Organizations",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "SJR in Scandinavia AB",
    "phone": "4684075500.0",
    "sedol": "BD4DKV6",
    "shareOutstanding": 10.7,
    "state": "STOCKHOLM",
    "ticker": "SJR B.ST",
    "weburl": "http://www.sjr.se"
}