{
    "address": "2000-885 Georgia St W",
    "city": "Vancouver",
    "country": "CA",
    "currency": "USD",
    "cusip": "819320102",
    "description": "ShaMaran Petroleum Corp. engages in the exploration, appraisal and development of oil and gas resources. The company is headquartered in Vancouver, British Columbia and currently employs 11 full-time employees.  The firm is engaged in the business of oil and gas exploration and development and is in the pre-production stages of an exploration and development campaign in respect of the Atrush Block production sharing contract (Atrush Block PSC) related to a petroleum property located in the Kurdistan Region of Iraq (Kurdistan). The company operates in the exploration and development of oil and gas assets segment. The Phase I of Atrush field development consists of installing and commissioning production facilities with approximately 30,000 barrels of oil per day (bopd) capacity and the drilling and completion of over five production wells to supply the production facility. The company has not generated any revenues. Its subsidiaries include ShaMaran Petroleum Holdings Cooperatief U.A., ShaMaran Ventures B.V., ShaMaran Petroleum B.V., ShaMaran Services S.A., Bayou Bend Petroleum U.S.A. Ltd and General Exploration Partners, Inc.",
    "employeeTotal": "11.0",
    "exchange": "TSX VENTURE EXCHANGE - NEX",
    "finnhubIndustry": "Energy ",
    "ggroup": "Energy",
    "gind": "Oil, Gas & Consumable Fuels",
    "gsector": "Energy",
    "gsubind": "Oil & Gas Exploration & Production",
    "ipo": "1993-02-10",
    "isin": "CA8193201024",
    "logo": "https://finnhub.io/api/logo?symbol=SNM.V",
    "marketCapitalization": 121.0622,
    "naics": "Oil and Gas Extraction",
    "naicsNationalIndustry": "Crude Petroleum and Natural Gas Extraction",
    "naicsSector": "Mining",
    "naicsSubsector": "Oil and Gas Extraction",
    "name": "ShaMaran Petroleum Corp",
    "phone": "16046897842.0",
    "sedol": "2926063",
    "shareOutstanding": 2201.656828,
    "state": "BRITISH COLUMBIA",
    "ticker": "SNM.V",
    "weburl": "https://www.shamaranpetroleum.com"
}