{
    "address": "Hammarby kaj 10A",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8454D118",
    "description": "Softronic AB engages in the provision of information technology and management consultancy services. The company is headquartered in Stockholm, Stockholm and currently employs 427 full-time employees.  The firm provides IT-based solutions designed to improve their customer’s business strategy and operations in a range of areas, such as sales, administration, research and development, production, distribution, e-commerce, customer services, and business intelligence. Its product portfolio includes: Softronic Insurance Technology Management (ITM), an insurance software; Appia Air Sales, a sales and reservation system for airlines; Appia Connect, a booking engine for travel agencies; Compliance Manager 1 (CM1), a Software as a Service (SaaS) against money laundering for financial institutions; as well as Vklass, a teaching and communication platform for schools; among others. Furthermore, the Company is a parent of a number of entities, such as Softronic Drift AB, Softronic TBook AB, Softronic Baltic AS and Softronic 1 AB.",
    "employeeTotal": "427.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "1998-12-03",
    "isin": "SE0000323305",
    "logo": "https://finnhub.io/api/logo?symbol=SOF B.ST",
    "marketCapitalization": 1253.738,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Custom Computer Programming Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Softronic AB",
    "phone": "46851909000.0",
    "sedol": "5972126",
    "shareOutstanding": 52.632803,
    "state": "STOCKHOLM",
    "ticker": "SOF B.ST",
    "weburl": "https://www.softronic.se/"
}