{
    "address": "Scheelevagen 22",
    "city": "Lund",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T14G105",
    "description": "Spagpo Nanomedical AB engages in the provision of research and development within nanomedicine. The company is headquartered in Lund, Skane. The company went IPO on 2013-01-15. The company specialized in the areas of contrast agents and nanoscale life science research. The firm is involved in three projects: Spago Pix, a nanomaterial developed for use as a cancer selective contrast agent for Magnetic Resonance Imaging (MRI); the therapeutic project Tumorad, using nanoparticles loaded with radionuclides for selective treatment of cancers, which are unsuitable for surgery or external radiation; and Archaea Platin, aimed at delivering of chemotherapeutic substance cisplatin selectively to tumors in order to reduce side effects on healthy tissue. The firm's technology comprises a technology platform IonXgel, which is a nano-sized biocompatible material consisting of polar polymers; a protein-based drug delivery platform, ProtRc; and 3PEG, a platform which enables attachment of polyethylene glycol (PEG) derivatives to small molecules (PEGylation).",
    "employeeTotal": "",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2013-01-15",
    "isin": "SE0004899474",
    "logo": "",
    "marketCapitalization": 288.276,
    "naics": "Scientific Research and Development Services",
    "naicsNationalIndustry": "Research and Development in Biotechnology",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Spago Nanomedical AB (publ)",
    "phone": "464681188.0",
    "sedol": "B928HD6",
    "shareOutstanding": 41.182287,
    "state": "SKANE",
    "ticker": "SPAGO.ST",
    "weburl": "http://spagonanomedical.se"
}