{
    "address": "Regeringsgatan 29, 5tr",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W5890X104",
    "description": "Speqta AB engages in the development and provision of software applications and social media website. The company is headquartered in Stockholm, Stockholm and currently employs 43 full-time employees. The company went IPO on 2009-12-07. Its IT (information technology) system, Mytaste BigData Engine, a network of sites and apps, generates visitors by attracting customers with offers and discount codes, reducing the cost of customer acquisition while increasing sales and margins for the Company's online partners. The firm operates through two segments: Mytaste Shopping and Mytaste Food & Beverage. Mytaste Shopping provides products and services under the brands Shopello, Affilijet, Kampanjjakt, Lanakuten, OutletSverige, AllaAnnonser, Veckans E, samt AlltidRea. Mytaste Food & Beverage focuses on creating digital services for consumers interested in food and beverages. The company consists of three cooking and drinking sites: myTaste, Matklubben and Vinklubben. The firm focuses on the e-commerce in the Nordic region and in the markets in which operates.",
    "employeeTotal": "43.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Media",
    "ggroup": "Media & Entertainment",
    "gind": "Interactive Media & Services",
    "gsector": "Communication Services",
    "gsubind": "Interactive Media & Services",
    "ipo": "2009-12-07",
    "isin": "SE0003036821",
    "logo": "",
    "marketCapitalization": 275.5361,
    "naics": "Other Information Services",
    "naicsNationalIndustry": "Internet Publishing and Broadcasting and Web Search Portals",
    "naicsSector": "Information",
    "naicsSubsector": "Other Information Services",
    "name": "Speqta publ AB",
    "phone": "",
    "sedol": "B54FZC2",
    "shareOutstanding": 65.917725,
    "state": "STOCKHOLM",
    "ticker": "SPEQT.ST",
    "weburl": "https://speqta.com/"
}