{
    "address": "Kvarnbergsgatan 2",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W8T890118",
    "description": "Serneke Group AB engages in the provision of engineering and construction services. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 1,174 full-time employees. The company went IPO on 2016-11-24. The firm operates through four segments: Construction, Civil Engineering, Project Development and Property Management. The Construction segment involves construction services involving commercial and residential properties. The Civil Engineering segment provides solutions in the fields of ground work, foundation, infrastructure, grids, energy installations, port constructions, concrete constructions/installations, prefabricated units and concrete manufacture. The Project Development segment involves the development of residential and commercial properties alone or with partners. The Property Management segment manages and develops both residential and commercial properties. The firm is active in Sweden and operates offices in Stromstad, Trollhattan, Boras, Alingsas, Varberg, Halmstad, Malmo and Stockholm.",
    "employeeTotal": "1174.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Construction",
    "ggroup": "Capital Goods",
    "gind": "Construction & Engineering",
    "gsector": "Industrials",
    "gsubind": "Construction & Engineering",
    "ipo": "2016-11-24",
    "isin": "SE0007278841",
    "logo": "https://finnhub.io/api/logo?symbol=SRNKE B.ST",
    "marketCapitalization": 1243.083,
    "naics": "Nonresidential Building Construction",
    "naicsNationalIndustry": "Commercial and Institutional Building Construction",
    "naicsSector": "Construction",
    "naicsSubsector": "Construction of Buildings",
    "name": "SERNEKE Group AB (publ)",
    "phone": "4631712974646.0",
    "sedol": "BYZZ290",
    "shareOutstanding": 27.938245,
    "state": "VASTRA GOTALANDS",
    "ticker": "SRNKE B.ST",
    "weburl": "https://www.serneke.se/"
}