{
    "address": "Kanavaranta 1, P.O. Box 309",
    "city": "Helsinki",
    "country": "FI",
    "currency": "EUR",
    "cusip": "X8T9CM113",
    "description": "Stora Enso Oyj engages in the manufacturing and marketing of newsprint, book paper, magazine paper, fine paper, consumer board, industrial packaging, and wood products. The company is headquartered in Helsinki, Etela-Suomen and currently employs 23,068 full-time employees.  The firm's segments include Consumer Board, Packaging Solutions, Biomaterials, Wood Products, Paper and Other. The Consumer Board segment develops and provides consumer packaging boards for printing and packaging applications. The Packaging Solutions segment develops fiber-based packaging, and operates at every stage of the value chain from pulp production, material and packaging production to recycling. The Biomaterials segment offers pulp grades for paper, board, tissue, textile and hygiene product producers. The Wood Products segment provides wood-based solutions for building and housing. The Paper segment provides paper solutions for print media and office use. The Other segment includes the Nordic forest equity accounted investments. The company serves publishers, retailers, printing houses, merchants, converters and joinery, and construction companies.",
    "employeeTotal": "23068.0",
    "exchange": "NASDAQ OMX HELSINKI LTD.",
    "finnhubIndustry": "Paper & Forest",
    "ggroup": "Materials",
    "gind": "Paper & Forest Products",
    "gsector": "Materials",
    "gsubind": "Paper Products",
    "ipo": "1998-01-01",
    "isin": "FI0009005961",
    "logo": "https://finnhub.io/api/logo?symbol=STERV.HE",
    "marketCapitalization": 12861.53,
    "naics": "Pulp, Paper, and Paperboard Mills",
    "naicsNationalIndustry": "Paper (except Newsprint) Mills",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Paper Manufacturing",
    "name": "Stora Enso Oyj",
    "phone": "3582046131.0",
    "sedol": "5072673",
    "shareOutstanding": 788.619987,
    "state": "ETELA-SUOMEN",
    "ticker": "STERV.HE",
    "weburl": "http://www.storaenso.com"
}