{
    "address": "Drakegatan 7 A, 3 tr.",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W89622125",
    "description": "Surgical Science Sweden AB engages in the development of simulators for laparoscopic medical training. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 83 full-time employees. The company went IPO on 2017-06-19. The systems comprise LapSim, EndoSim and TeamSim trainings. Each training combine graphics and cognitive instruction, imply navigation on touch screens and feature tactile feedback technology. The LapSim trainings consist of laparoscopic exercises that range from basic navigation to advanced suturing, the EndoSim endoscopic exercises range from functions of the scope handle and tube, to loop reduction. The TeamSim comprises procedure modules to train in a real world operation room environment and helps to build team communication skills in crisis and routine situations. The training systems are used by medical training centers and institutes worldwide for practice, validation and certification of students, surgeons, and medical doctors.",
    "employeeTotal": "83.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Health Care",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Equipment & Supplies",
    "gsector": "Health Care",
    "gsubind": "Health Care Equipment",
    "ipo": "2017-06-19",
    "isin": "SE0014428512",
    "logo": "https://finnhub.io/api/logo?symbol=SUS.ST",
    "marketCapitalization": 7566.081,
    "naics": "Scientific Research and Development Services",
    "naicsNationalIndustry": "Research and Development in the Physical, Engineering, and Life Sciences (except Biotechnology)",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Surgical Science Sweden AB",
    "phone": "46317416560.0",
    "sedol": "BMFYGB3",
    "shareOutstanding": 37.944236,
    "state": "VASTRA GOTALANDS",
    "ticker": "SUS.ST",
    "weburl": "https://surgicalscience.com/"
}