{
    "address": "Landsvagen 40",
    "city": "Sundbyberg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W94232100",
    "description": "Swedbank AB engages in the provision of financial products and services. The company is headquartered in Sundbyberg, Stockholm and currently employs 16,306 full-time employees.  The firm offers financial services and products in its home markets of Sweden, Estonia, Latvia and Lithuania. The firm's segments are Swedish Banking, Baltic Banking, Large corporates & Institutions, and Group Functions & Other. The firm offers products mainly in the areas of lending, payments and savings. The Swedish Banking segment offers its products to private customers and companies in the Swedish market. The Swedish Banking segment's services are sold through the Company's own branch network, the telephone Bank, the Internet Bank and the distribution network of the independent savings banks. The Baltic Banking segment offers its products to private customers and companies in Estonia, Latvia and Lithuania. The Baltic Banking segment's services are sold through its own branch network, the telephone Bank and the Internet Bank. The Large Corporates & Institutions segment offers its services to large companies and financial institutions.",
    "employeeTotal": "16306.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Banking",
    "ggroup": "Banks",
    "gind": "Banks",
    "gsector": "Financials",
    "gsubind": "Diversified Banks",
    "ipo": "1995-06-02",
    "isin": "SE0000242455",
    "logo": "",
    "marketCapitalization": 186056.5,
    "naics": "Depository Credit Intermediation",
    "naicsNationalIndustry": "Commercial Banking",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Credit Intermediation and Related Activities",
    "name": "Swedbank AB",
    "phone": "46858590000.0",
    "sedol": "4846523",
    "shareOutstanding": 1121.272199,
    "state": "STOCKHOLM",
    "ticker": "SWED A.ST",
    "weburl": "https://www.swedbank.com/"
}