{
    "address": "Industrivagen 3",
    "city": "Skinnskatteberg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9581D104",
    "description": "Systemair AB engages in developing, designing, and manufacturing ventilation products and systems. The company is headquartered in Skinnskatteberg, Vastmanland and currently employs 6,247 full-time employees. The company went IPO on 2007-10-01. The products are marketed under the Systemair, Fantech, Frico and VEAB brands. Systemair comprises mainly ventilation products, such as fans, air distribution products, chillers and air handling units; Fantech develops, designs and markets solutions for residential and commercial properties in North America; Frico focuses on air curtains and heating products, and VEAB focuses on the development, manufacture and marketing of heating products for ventilation systems, movable and stationary fan heaters, as well as dehumidification systems. The firm has operations in more than 40 countries in Europe, North America, South America, the Middle East, Asia, Africa and Australia. The firm operates Airwell, Alitis, Kolektor Koling doo, FRIVENT Luft- & Warmetechnik GmbH and Viking Air Conditioning Pty Ltd, among others.",
    "employeeTotal": "6247.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Building",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "ipo": "2007-10-01",
    "isin": "SE0002133975",
    "logo": "https://finnhub.io/api/logo?symbol=SYSR.ST",
    "marketCapitalization": 16588,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Industrial and Commercial Fan and Blower Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Systemair AB",
    "phone": "4622244000.0",
    "sedol": "B287X74",
    "shareOutstanding": 54,
    "state": "VASTMANLAND",
    "ticker": "SYSR.ST",
    "weburl": "https://www.systemair.com/"
}