{
    "address": "Box 2094, Skeppsbron 18",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Tele2 AB engages in the provision of mobile communication services. The company is headquartered in Stockholm, Stockholm and currently employs 4,528 full-time employees.  The firm offers mobile services, fixed broadband and telephony, data network services, global Internet of things (IoT) solution and content services. The firm's segments include Sweden, the Netherlands, Kazakhstan, Croatia, Lithuania, Latvia, Estonia, Austria, Germany and Other. The Other segment includes IoT, the parent company Tele2 AB and central functions, and other minor operations. Services offered within the segments are mobile telephony, fixed broadband, fixed telephony and other operations (mainly business solutions, carrier operations and wholesale). The firm's mobile service includes various types of subscriptions for residential and business customers, as well as prepaid cards. The firm's mobile service also includes mobile broadband, fixed telephony through mobile network (FVM), machine-to-machine (M2M) communication and mobile carrier. The firm either owns the networks or rents them from other operators a set-up called MVNO.",
    "employeeTotal": "4528.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Telecommunication",
    "ggroup": "Telecommunication Services",
    "gind": "Wireless Telecommunication Services",
    "gsector": "Communication Services",
    "gsubind": "Wireless Telecommunication Services",
    "ipo": "1905-06-18",
    "isin": "SE0005190238",
    "logo": "https://finnhub.io/api/logo?symbol=TEL2 B.ST",
    "marketCapitalization": 88107.45,
    "naics": "Wireless Telecommunications Carriers (except Satellite)",
    "naicsNationalIndustry": "Wireless Telecommunications Carriers (except Satellite)",
    "naicsSector": "Information",
    "naicsSubsector": "Telecommunications",
    "name": "Tele2 AB",
    "phone": "46812147400.0",
    "sedol": "B97C733",
    "shareOutstanding": 689.851504,
    "state": "STOCKHOLM",
    "ticker": "TEL2 B.ST",
    "weburl": "https://www.tele2.com/"
}