{
    "address": "Stjarntorget 1",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W95890104",
    "description": "Telia Co. AB engages in the provision of network access and telecommunication services. The company is headquartered in Solna, Stockholm and currently employs 20,628 full-time employees. The company went IPO on 2000-01-13. The firm connects businesses, individuals, families and communities via fixed and mobile communication solutions. The firm's segments include Sweden, Europe and Other. The Sweden segment consists of the Company's mobile, broadband, television and fixed-line operations in Sweden. The Europe segment consists of the Company's mobile, broadband, television and fixed-line operations in Finland, Norway, Denmark, Lithuania, Latvia and Estonia. The Other segment includes the international carrier operations, customer financing and dunning operations. The firm's brands include Azercell in Azerbaijan; Telia, Call me and DLG Tele in Denmark; Telia and Diil in Estonia; Sonera and TeleFinland in Finland; Kcell and Activ in Kazakhstan; Moldcell in Moldova; Telia, Chess, MyCall and OneCall in Norway; Telia and Halebop in Sweden; Tcell in Tajikistan, and Ucell in Uzbekistan.",
    "employeeTotal": "20628.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Telecommunication",
    "ggroup": "Telecommunication Services",
    "gind": "Diversified Telecommunication Services",
    "gsector": "Communication Services",
    "gsubind": "Integrated Telecommunication Services",
    "ipo": "2000-01-13",
    "isin": "SE0000667925",
    "logo": "https://finnhub.io/api/logo?symbol=TELIA.ST",
    "marketCapitalization": 159802.4,
    "naics": "Wireless Telecommunications Carriers (except Satellite)",
    "naicsNationalIndustry": "Wireless Telecommunications Carriers (except Satellite)",
    "naicsSector": "Information",
    "naicsSubsector": "Telecommunications",
    "name": "Telia Company AB",
    "phone": "46771990100.0",
    "sedol": "5978384",
    "shareOutstanding": 4089.631702,
    "state": "STOCKHOLM",
    "ticker": "TELIA.ST",
    "weburl": "https://www.teliacompany.com/"
}