{
    "address": "Fosievagen 13",
    "city": "Malmo",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9T18N112",
    "description": "Thule Group AB is a holding company that engages in the manufacture of sports and outdoor products. The company is headquartered in Malmo, Skane and currently employs 3,211 full-time employees. The company went IPO on 2014-11-26. Its offering is divided in two business segments: Outdoor&Bags and Specialty. The Outdoor&Bags segment comprises three product categories: sport and cargo carriers, bags for electronic devices, and other outdoor and bags; as well as several product groups, namely bike and car carriers, water and winter carriers, camera bags, laptop cases, recreational vehicle products, roof racks, and sports and travel bags, among others. The Specialty segment comprises two product categories: work gear and snow chains; and such product groups as pick-up truck tool boxes, and professional and consumer snow chains. The Company’s brands are Thule, Case Logic, Konig, UWS, TracRac and SportRac. Its products are sold to retailers, distributors and wholesalers and available in more than 130 countries. The firm is a subsidiary of Thule Group.",
    "employeeTotal": "3211.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Leisure Products",
    "ggroup": "Consumer Durables & Apparel",
    "gind": "Leisure Products",
    "gsector": "Consumer Discretionary",
    "gsubind": "Leisure Products",
    "ipo": "2014-11-26",
    "isin": "SE0006422390",
    "logo": "https://finnhub.io/api/logo?symbol=THULE.ST",
    "marketCapitalization": 41134.86,
    "naics": "Motor Vehicle Parts Manufacturing",
    "naicsNationalIndustry": "All Other Motor Vehicle Parts Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Transportation Equipment Manufacturing",
    "name": "Thule Group AB",
    "phone": "46406359000.0",
    "sedol": "BSQXJ01",
    "shareOutstanding": 104.562436,
    "state": "SKANE",
    "ticker": "THULE.ST",
    "weburl": "http://www.thulegroup.com"
}