{
    "address": "Keilalahdentie 2-4",
    "city": "Espoo",
    "country": "FI",
    "currency": "EUR",
    "cusip": "Y8T39G104",
    "description": "TietoEVRY Corp. engages in the provision of software and digital services. The company is headquartered in Espoo, Etela-Suomen and currently employs 23,724 full-time employees.  The firm operates in four service lines: Industry solutions, Enterprise Solutions, Managed Services and Transformation, and Product Engineering Solutions. The firm focuses on developing its services and products within its Product Development Services business area, which offers solutions for telecom network equipment and platform providers, mobile device and consumer electronics manufacturers, as well as semiconductor providers. The firm's Customer Experience Management business area specializes in multichannel commerce for clients, reaching from retail and financial services to manufacturing, telecom and energy. The company operates through numerous subsidiaries in Finland, Sweden, Austria, Belgium, Canada, China, the Czech Republic, Denmark, Germany, Estonia, Lithuania, Norway, Poland, and the Russian Federation, among others.",
    "employeeTotal": "23724.0",
    "exchange": "NASDAQ OMX HELSINKI LTD.",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "ipo": "1999-04-28",
    "isin": "FI0009000277",
    "logo": "",
    "marketCapitalization": 3166.705,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Custom Computer Programming Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "TietoEVRY Corp",
    "phone": "3582072010.0",
    "sedol": "5479702",
    "shareOutstanding": 118.418184,
    "state": "ETELA-SUOMEN",
    "ticker": "TIETO.HE",
    "weburl": "https://www.tietoevry.com/"
}