{
    "address": "Karlsrovagen 2D",
    "city": "Danderyd",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9T29E101",
    "description": "Tobii AB engages in the provision of eye-tracking solutions. The company is headquartered in Danderyd, Stockholm and currently employs 965 full-time employees. The company went IPO on 2015-04-24. The company operates within three divisions: Tobii Tech, developing eye tracking technology and products for the consumer market and other areas; Tobii Dynavox, developing and selling augmentative solutions aimed at people with hindered mobility or communication, which allow them to access and communicate with computers; and Tobii Pro, developing and selling eye tracking solutions for researchers to gain insight into human behavior for such purposes as market research, usability testing and scientific research. The possible applications of its technology and products include: communication, gaming, healthcare, performance assessment, consumer products and transportation, among others. The firm has offices in Sweden, the United States, China, Japan, Germany and Norway, and an international network of resellers.",
    "employeeTotal": "965.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Technology Hardware, Storage & Peripherals",
    "gsector": "Information Technology",
    "gsubind": "Technology Hardware, Storage & Peripherals",
    "ipo": "2015-04-24",
    "isin": "SE0002591420",
    "logo": "https://finnhub.io/api/logo?symbol=TOBII.ST",
    "marketCapitalization": 6380.487,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Tobii AB",
    "phone": "4686636990.0",
    "sedol": "BWXTN97",
    "shareOutstanding": 99.369972,
    "state": "STOCKHOLM",
    "ticker": "TOBII.ST",
    "weburl": "https://www.tobii.com/"
}