{
    "address": "Flojelbergsgatan 12",
    "city": "Moelndal",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9664G107",
    "description": "Transtema Group AB engages in the provision of system solutions and consultancy services within infrastructure for data center and telecommunications. The company is headquartered in Moelndal, Vastra Gotalands and currently employs 358 full-time employees. The company went IPO on 2015-05-21. The firm provides engineering, design, construction, documentation, maintenance, and other consulting services for communications networks, such as fiber optic networks, computer networks and radio networks. The company is also engaged in design, installation and commissioning of network equipment and radio technology. The company offers services in a number of countries, including Sweden and Norway. The Company’s subsidiaries comprise Datelab AB, Fibergruppen, Fiber Solution Sweden AB, HC Telecom AB, BearCom AB, WinCore AB, Academys, Relink Networks AB, Foki AB, Andersson & Jansater Entreprenad AB, Effektvision AB, Nordlund Entreprenad AB, Copiad Telecom AB and TheBplan AS, among others. The Company’s main shareholders are Tornas Invest AB and Fore C Investment Holding AB.",
    "employeeTotal": "358.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Telecommunication",
    "ggroup": "Telecommunication Services",
    "gind": "Diversified Telecommunication Services",
    "gsector": "Communication Services",
    "gsubind": "Alternative Carriers",
    "ipo": "2015-05-21",
    "isin": "SE0006758587",
    "logo": "https://finnhub.io/api/logo?symbol=TRANS.ST",
    "marketCapitalization": 870.3325,
    "naics": "Wired Telecommunications Carriers",
    "naicsNationalIndustry": "Wired Telecommunications Carriers",
    "naicsSector": "Information",
    "naicsSubsector": "Telecommunications",
    "name": "Transtema Group AB",
    "phone": "",
    "sedol": "BWFDCD4",
    "shareOutstanding": 38.340639,
    "state": "VASTRA GOTALANDS",
    "ticker": "TRANS.ST",
    "weburl": "http://www.transtemagroup.se/"
}