{
    "address": "Johan Kocksgatan 10, Box 153",
    "city": "Trelleborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W96297101",
    "description": "Trelleborg AB engages in the development of polymer technology system. The company is headquartered in Trelleborg, Skane and currently employs 22,209 full-time employees.  The company is engaged in the development, manufacture and marketing of polymer solutions that seal, damp and protect in demanding industrial environments. Its operations are divided into five business areas: Trelleborg Coated Systems, supplying customer solutions for polymer-coated fabrics; Trelleborg Industrial Solutions, offering polymer-based solutions for industrial applications, such as hose systems, antivibration solutions and sealing systems; Trelleborg Offshore & Construction, a project supplier of polymer solutions for oil and gas and infrastructure construction; Trelleborg Sealing Solutions, developing sealing solutions for general industry, light vehicles and aerospace environments, and owning a liquid silicone rubber plant in Bulgaria; and Trelleborg Wheel Systems, a provider of tires and wheels for agricultural, forestry and industry machines.",
    "employeeTotal": "22209.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery",
    "ipo": "1964-01-01",
    "isin": "SE0000114837",
    "logo": "https://finnhub.io/api/logo?symbol=TREL B.ST",
    "marketCapitalization": 51303.93,
    "naics": "Rubber Product Manufacturing",
    "naicsNationalIndustry": "Rubber Product Manufacturing for Mechanical Use",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Plastics and Rubber Products Manufacturing",
    "name": "Trelleborg AB",
    "phone": "4641067000.0",
    "sedol": "4902384",
    "shareOutstanding": 271.071783,
    "state": "SKANE",
    "ticker": "TREL B.ST",
    "weburl": "http://www.trelleborg.com/"
}