{
    "address": "Malaxgatan 1",
    "city": "Kista",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W96661108",
    "description": "Triboron International AB is an environmental technology company, which engages in the manufacturing of fuel formula products. The company is headquartered in Kista, Stockholm. The company went IPO on 2019-04-08. The company owns Triboron, a patented tribology technology and process based on boron. Triboron technology can be used in fuels, oils and fats in a wide span of vehicles and machines, from power tools, scooters and cars to large stationary generators, trucks and ships. The technology interacts with the metal surfaces and forms a layer that reduces friction to a minimum even at extreme pressure. The Company’s products offering includes Fuel Formula Consumer and Fuel Formula Professional, which help to save fuel, reduce mechanical friction, protect the engine from wear, keep injectors clean and prevent bacteria; Two-Stroke Formula Concentrate and Two-Stroke Formula Injection that reduce mechanical friction, optimize performance, protect the engine against wear, reduce emission and smoke; and specialties dedicated to resellers under the brands Future2Green and Fuel Link.",
    "employeeTotal": "",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Energy ",
    "ggroup": "Energy",
    "gind": "Oil, Gas & Consumable Fuels",
    "gsector": "Energy",
    "gsubind": "Oil & Gas Refining & Marketing",
    "ipo": "2019-04-08",
    "isin": "SE0010600429",
    "logo": "https://finnhub.io/api/logo?symbol=TRIBO B.ST",
    "marketCapitalization": 44.1411,
    "naics": "Chemical and Allied Products Merchant Wholesalers",
    "naicsNationalIndustry": "Other Chemical and Allied Products Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Nondurable Goods",
    "name": "Triboron International AB",
    "phone": "4686431000.0",
    "sedol": "BJ7HMX3",
    "shareOutstanding": 34.23418,
    "state": "STOCKHOLM",
    "ticker": "TRIBO B.ST",
    "weburl": "http://www.triboron.com/"
}