{
    "address": "Ralambsvagen 17, 17 trappor",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W95903105",
    "description": "Tempest Security AB offers solutions for security, protection and service. The company is headquartered in Stockholm, Stockholm. The company went IPO on 2017-12-06. The firm specializes in providing security services ranging from traditional security guards to specialized preventive services and surveillance and technology installations. The firm's traditional security services are divided into stationary and mobile monitoring. Its specialized security services include personal protection and surveillance, security consulting, investigations, background checks and training. Its security technology offering includes alarm and monitoring solutions. The firm also operates the Tempest Alarm Center, an emergency and disturbance telephone notification and alarm monitoring center. Additionally, the Company offers health and safety trainings in the workplace. The firm operates across Sweden, in segments such as real estate, events, hotels and restaurants, offices, shops and malls, municipalities, as well as individuals.",
    "employeeTotal": "",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Commercial Services & Supplies",
    "ggroup": "Commercial  & Professional Services",
    "gind": "Commercial Services & Supplies",
    "gsector": "Industrials",
    "gsubind": "Security & Alarm Services",
    "ipo": "2017-12-06",
    "isin": "SE0010469221",
    "logo": "",
    "marketCapitalization": 358.7405,
    "naics": "Investigation and Security Services",
    "naicsNationalIndustry": "Security Guards and Patrol Services",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "Tempest Security AB",
    "phone": "46104577760.0",
    "sedol": "BYVHTY4",
    "shareOutstanding": 9.774947,
    "state": "STOCKHOLM",
    "ticker": "TSEC.ST",
    "weburl": "http://tempest.se/"
}