{
    "address": "Norrtullsgatan 12 A",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9797T109",
    "description": "Unlimited Travel Group AB engages in owning, starting, developing, and acquiring small and medium sized travel and event companies. The company is headquartered in Stockholm, Stockholm and currently employs 66 full-time employees. The company went IPO on 2006-12-15. The company owns, develops and acquires small- and medium-sized travel companies that specialize in two segments: the group, conference and business travel segment, and the private travel segment. Its investment portfolio comprises JB Travel, which specializes in group, conference and business travels; Eventyr, involved in organization of travels and events; Ski Unlimited, involved in the organization of group travels in the Alps and the Swedish mountains; Birdie Golf Tours, providing golf travels and schools; Vastindienspecialisten, offering travel packages to the Caribbean; Travel Beyond, a travel event organizer; WI-Resor, which organizes wandering trips; Varldens Resor, focused on travels to Asia and South America; PolarQuest, which specializes in trips to the Arctic and Antarctica; Good Travel, which organizes trips that combine volunteering with travel; and a tour operator, Specialresor Birgitta Johnson Aktiebolag.",
    "employeeTotal": "66.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Hotels, Restaurants & Leisure",
    "ggroup": "Consumer Services",
    "gind": "Hotels, Restaurants & Leisure",
    "gsector": "Consumer Discretionary",
    "gsubind": "Hotels, Resorts & Cruise Lines",
    "ipo": "2006-12-15",
    "isin": "SE0001834821",
    "logo": "https://finnhub.io/api/logo?symbol=UTG.ST",
    "marketCapitalization": 103.4473,
    "naics": "Travel Arrangement and Reservation Services",
    "naicsNationalIndustry": "Travel Agencies",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "Unlimited Travel Group UTG AB (publ)",
    "phone": "46852254150.0",
    "sedol": "B1KKYF9",
    "shareOutstanding": 11.70218,
    "state": "STOCKHOLM",
    "ticker": "UTG.ST",
    "weburl": "https://www.unlimitedtravelgroup.se/"
}