{
    "address": "Tvistevagen 47A",
    "city": "Umea",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W9820M113",
    "description": "Vitec Software Group AB engages in software business solutions. The company is headquartered in Umea, Vasterbottens and currently employs 975 full-time employees.  The firm's offer consists of software solutions, consulting services and support services. The firm operates through six business areas. The Brokerage area offers software for real estate brokers. The Real Estate area offers software for property managers. The Media area offers the Balance business system, which supports the administrative processes of the Company’s customers’ companies. The Energy area provides software for forecasting of electricity, heat and wind power; technical management and maintenance of the distribution networks. The Capitex area offers software for banks and insurance companies. The 3L System area offers software for construction, real estate and yellow pages companies. The firm's subsidiaries include Futursoft OY, AutoData Norge AS, Tietomitta OY, Aloc A/S, Norwegian Fox Publish AS, Norwegian Insurance Computer Environment AS (Nice AS) and MV-Nordic A/S.",
    "employeeTotal": "975.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "1998-03-16",
    "isin": "SE0007871363",
    "logo": "https://finnhub.io/api/logo?symbol=VIT B.ST",
    "marketCapitalization": 11064.06,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "Vitec Software Group AB (publ)",
    "phone": "4690154900.0",
    "sedol": "BD96BJ5",
    "shareOutstanding": 33.033902,
    "state": "VASTERBOTTENS",
    "ticker": "VIT B.ST",
    "weburl": "https://www.vitecsoftware.com/"
}