{
    "address": "Gustaf Werners gata 2",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "",
    "description": "Vitrolife AB engages in the development, manufacture, and sale of products and systems for the preparation, cultivation, and storage of human cells, tissue, and organs. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 424 full-time employees. The company went IPO on 2001-06-26. The Company’s product portfolio comprises G-RINSE, which is a solution for rinsing of contact materials, EmbryoGlue, which is a human albumin recombinant, ASP, which is a solution for oocyte retrieval and rinsing, and Semen VTS, which is a viscosity treatment system, among others. The company also provides a range of procedural solutions for sperm preparation, vitrification, embryo transfer and oocyte retrieval, such as temperature control, condition control, gamete-safe labware and embryo support. The firm is active in Australia, China, France, Italy, Japan, the United States and the United Kingdom, among others, and conducts its business through a number of subsidiaries, such as Vitrolife Ltd., Vitrolife Pty Ltd., and A.T.S. Srl.",
    "employeeTotal": "424.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2001-06-26",
    "isin": "SE0011205202",
    "logo": "https://finnhub.io/api/logo?symbol=VITR.ST",
    "marketCapitalization": 43854.43,
    "naics": "Medical Equipment and Supplies Manufacturing",
    "naicsNationalIndustry": "Surgical Appliance and Supplies Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Miscellaneous Manufacturing",
    "name": "Vitrolife AB",
    "phone": "46317218000.0",
    "sedol": "BFZCSN4",
    "shareOutstanding": 108.550575,
    "state": "VASTRA GOTALANDS",
    "ticker": "VITR.ST",
    "weburl": "http://www.vitrolife.com"
}