{
    "address": "Engelbrektsplan 1",
    "city": "Stockholm",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W98220143",
    "description": "Volati AB engages in the acquisition and development of early stage companies. The company is headquartered in Stockholm, Stockholm and currently employs 1,904 full-time employees. The company went IPO on 2015-06-08. The company comprises subsidiaries Besikta Bilprovning, operating vehicle inspection stations in Sweden; Corroventa, which develops systems for the restoration of water damage, building drying, dehumidifying crawl spaces and conducts radon decontamination; Ettikettoprintcom, a printing company offering self-adhesive labels and tickets, and manufacturing labeling and packaging machines; Kellfri, which constructs, assembles, buys and sells machinery, trailers, tractors and accessories for agriculture and forestry; me&i, offering clothing for kids and parents; NaturaMed Pharma, a supplier of nutritional supplements and health products; Tornum, which delivers in complete grain handling systems for agriculture and the grain processing industry; Lomond Industrier, a supplier to hardware and building product retailers in the Nordic region; and Akademibokhandeln Holding AB (publ). The firm carries out its operations in several European countries.",
    "employeeTotal": "1904.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Industrial Conglomerates",
    "ggroup": "Capital Goods",
    "gind": "Industrial Conglomerates",
    "gsector": "Industrials",
    "gsubind": "Industrial Conglomerates",
    "ipo": "2015-06-08",
    "isin": "SE0009143662",
    "logo": "https://finnhub.io/api/logo?symbol=VOLO.ST",
    "marketCapitalization": 12124.87,
    "naics": "Electronic and Precision Equipment Repair and Maintenance",
    "naicsNationalIndustry": "Other Electronic and Precision Equipment Repair and Maintenance",
    "naicsSector": "Other Services (except Public Administration)",
    "naicsSubsector": "Repair and Maintenance",
    "name": "Volati AB",
    "phone": "468216840.0",
    "sedol": "BZ006R3",
    "shareOutstanding": 79.406571,
    "state": "STOCKHOLM",
    "ticker": "VOLO.ST",
    "weburl": "https://www.volati.se/"
}