{
    "address": "Gropegardsgatan 2",
    "city": "Goeteborg",
    "country": "SE",
    "currency": "SEK",
    "cusip": "928856301",
    "description": "Volvo AB engages in the design, manufacture, and market of commercial vehicles. The company is headquartered in Goeteborg, Vastra Gotalands and currently employs 87,960 full-time employees.  The Volvo Group is a manufacturer of trucks, buses, construction equipment, diesel engines, and marine and industrial engines. The Volvo Group also provides solutions for financing and service. Its segments include Trucks, Construction Equipment, Buses, Volvo Penta, Group functions & Other, and Financial Services. The firm's brand portfolio consists of Volvo, Volvo Penta, UD, Terex Trucks, Renault Trucks, Prevost, Nova Bus and Mack. In addition to vehicles and machines, its offering includes a range of services, such as insurance, rental services, spare parts, preventive maintenance, service agreements, assistance services and information technology (IT) services. Its product range is divided into Vehicles and Services. The sale of new vehicles, machinery and engines comprise Vehicles, as well as the sale of used vehicles and machines, trailers, superstructures and special vehicles. Its Services include the sale of spare parts.",
    "employeeTotal": "87960.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Machinery",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Construction Machinery & Heavy Trucks",
    "ipo": "1905-04-18",
    "isin": "SE0000115446",
    "logo": "https://finnhub.io/api/logo?symbol=VOLV B.ST",
    "marketCapitalization": 427928.4,
    "naics": "Motor Vehicle Body and Trailer Manufacturing",
    "naicsNationalIndustry": "Truck Trailer Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Transportation Equipment Manufacturing",
    "name": "Volvo AB",
    "phone": "4631660000.0",
    "sedol": "B1QH830",
    "shareOutstanding": 2033.452084,
    "state": "VASTRA GOTALANDS",
    "ticker": "VOLV B.ST",
    "weburl": "https://www.volvogroup.se/"
}