{
    "address": "Mjardevi Center, Teknikringen 10",
    "city": "Linkoping",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W989BG101",
    "description": "XMReality AB engages in the development and trade of mobile technology solutions for the industrial and maintenance industry. The company is headquartered in Linkoping, Ostergotland and currently employs 18 full-time employees. The company went IPO on 2017-04-26. The company develops and delivers systems based on Mixed reality and Augmented reality. The firm offers products for customers active within the fields of industrial service and maintenance. The company provides systems for aviation, shipping and offshore industries, as well as within the power, process, manufacturing and mining sectores. The Company’s flag product is XMExpert, an IT solution providing distance-based expert assistance in real time. The company comprises of a mobile field unit equipped with camera, headset and video glasses. In addition, there is a so-called expert station from which an expert at home can guide the technician in the field. The firm develops also XMViewer, a product at the prototype stage, which makes it possible to insert virtual objects, designed with the help of a computer, into a real environment.",
    "employeeTotal": "18.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Technology",
    "ggroup": "Software & Services",
    "gind": "Software",
    "gsector": "Information Technology",
    "gsubind": "Application Software",
    "ipo": "2017-04-26",
    "isin": "SE0009664188",
    "logo": "https://finnhub.io/api/logo?symbol=XMR.ST",
    "marketCapitalization": 204.3954,
    "naics": "Software Publishers",
    "naicsNationalIndustry": "Software Publishers",
    "naicsSector": "Information",
    "naicsSubsector": "Publishing Industries (except Internet)",
    "name": "XMReality AB (publ)",
    "phone": "4613211110.0",
    "sedol": "BZ7PG59",
    "shareOutstanding": 40.92,
    "state": "OSTERGOTLAND",
    "ticker": "XMR.ST",
    "weburl": "https://xmreality.com/"
}