{
    "address": "Rasundavagen 12",
    "city": "Solna",
    "country": "SE",
    "currency": "SEK",
    "cusip": "W989BH109",
    "description": "Xspray Pharma AB develops and produces particulate materials for the pharmaceutical industry. The company is headquartered in Solna, Stockholm and currently employs 21 full-time employees. The company went IPO on 2017-09-28. The company employs technology platform in order to create a pipeline of anti-cancer products. The firm primarily develops protein kinase inhibitors (PKI) for targeted cancer treatments. The product candidates include Sprycel, also known as HyNap-Dasa, (version of dasatinib medicine), Tasigna, also under name HyNap-Nilo, (version of nilotinib medicine) and Nexavar, also is under name HyNap-Sora, (version of sorafenib medicine), among others. Sprycel and Tasigna are indicated for treatment of adult patients diagnosed with Philadelphia chromosome-positive (pH+) chronic myeloid leukemia (CML). Sprycel is also indicated for the treatment of adult patients with pH+ acute lymphocytic leukemia (ALL) and lymphoid blastic CML with resistance or intolerance to prior treatment. Nexavar is indicated for the treatment of patients with liver cell cancer, renal cell cancer and differentiated thyroid cancer.",
    "employeeTotal": "21.0",
    "exchange": "NASDAQ OMX NORDIC",
    "finnhubIndustry": "Biotechnology",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Biotechnology",
    "gsector": "Health Care",
    "gsubind": "Biotechnology",
    "ipo": "2017-09-28",
    "isin": "SE0009973563",
    "logo": "https://finnhub.io/api/logo?symbol=XSPRAY.ST",
    "marketCapitalization": 2036.409,
    "naics": "Scientific Research and Development Services",
    "naicsNationalIndustry": "Research and Development in Biotechnology",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "XSpray Pharma AB (publ)",
    "phone": "4687303700.0",
    "sedol": "BD8PCR8",
    "shareOutstanding": 19.067504,
    "state": "STOCKHOLM",
    "ticker": "XSPRAY.ST",
    "weburl": "http://xspraypharma.com/"
}